Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: cast from type %s to type %s does not exist
hr: konverzija iz tipa %s u tip %s ne postoji

source: could not find tuple for cast %u
hr: tuple za konverziju %u nije naðen

source: DefineIndex: must specify at least one attribute
hr: DefineIndex: mora biti specificiran najmanje jedan atribut

source: Cannot use more than %d attributes in an index
hr: Nemoguæe koristiti vi¹e od %d atributa u indeksu

source: DefineIndex: relation "%s" is not a table
hr: DefineIndex: relacija "%s" nije tabela

source: Existing indexes are inactive. REINDEX first
hr: Postojeæi indeksi nisu aktivni. prvo REINDEX

source: DefineIndex: access method "%s" not found
hr: DefineIndex: metoda pristupa(access method) "%s" ne postoji

source: DefineIndex: access method "%s" does not support UNIQUE indexes
hr: DefineIndex: metoda pristupa(ccess method) "%s" ne podr¾ava 'UNIQUE' indekse

source: DefineIndex: access method "%s" does not support multi-column indexes
hr: DefineIndex: metoda pristupa(access method) "%s" ne podr¾ava indekse nad vi¹e kolona

source: Functional index can only have one attribute
hr: Funkcionalni indeks mo¾e imati samo jedan atribut

source: Index function can take at most %d arguments
hr: Indeksna funkcija mo¾e primiti najvi¹e %d argumenata

source: Partial-index predicates may refer only to the base relation
hr: 'Partial-index predicates' mogu referencirati samo baznu relaciju

source: Cannot use subselect in index predicate
hr: Nemoguæe koristiti 'subselect'-e u indeksnom izrazu

source: Cannot use aggregate in index predicate
hr: Nemoguæe koristiti agregate u indeksnom izrazu

source: Functions in index predicate must be marked isImmutable
hr: Funkcije u indeksnom iskazu moraju biti oznaèene kao 'isImmutable'

source: DefineIndex: attribute "%s" not found
hr: DefineIndex: atribut "%s" ne postoji

source: DefineIndex: functional index may not use an aggregate function
hr: DefineIndex: funkcionalni indeks ne mo¾e koristiti agregatnu funkciju

source: DefineIndex: functional index must use a real function, not a type coercion Try specifying the index opclass you want to use, instead
hr: DefineIndex: funkcionalni indeks mora koristiti realnu funkciju, ne prinudu tipa Poku¹ajte specificirati 'index opclass' koji ¾elie koristiti

source: DefineIndex: cannot index on a function returning a set
hr: DefineIndex: nemoguæe indeksiranje pomoæu funcije koja vraæa set rezultata

source: DefineIndex: index function must be marked isImmutable
hr: DefineIndex: indeksne funkcije moraju biti oznaèene kao 'isImmutable'

source: missing attribute for define index
hr: nedostaje atribut za definirani index

source: data type %s has no default operator class for access method "%s" You must specify an operator class for the index or define a default operator class for the data type
hr: tip podatka %s nema inicijalnu klasu operatora za pristupnu metodu "%s" Morate specificirati klasu operatora za indeks ili definirati inicijalnu klasu operatora za tip podatka

source: DefineIndex: operator class "%s" not supported by access method "%s"
hr: DefineIndex: klasa operatora "%s" nije podr¾ana od strane pristupne metode "%s"

source: operator class "%s" does not accept data type %s
hr: klasa operatora "%s" ne prihvaèa tip podatka %s

source: pg_opclass contains multiple default opclasses for data type %s
hr: pg_opclass sadr¾i vi¹e od jedne inicijalne 'opclass'-e za tip podatka %s

source: relation "%s" is of type "%c"
hr: relacija "%s" je tipa "%c"

source: index "%s" does not exist
hr: indeks "%s" ne postoji

source: "%s" is a system index. call REINDEX under standalone postgres with -O -P options
hr: "%s" je sistemski indeks. Pozovite REINDEX pod 'standalone postgres' procesom pokrenutim sa -O -P opcijama

source: "%s" is a system index. call REINDEX under standalone postgres with -P -O options
hr: "%s" je sistemski indeks. Pozovite REINDEX pod 'standalone postgres' procesom pokrenutim sa -O -P opcijama

source: index "%s" wasn't reindexed
hr: indeks "%s" nije reindeksiran

source: table "%s" wasn't reindexed
hr: tablica "%s" nije reindeksirana

source: REINDEX DATABASE: Can be executed only on the currently open database.
hr: REINDEX DATABASE: mo¾e biti izvr¹ena samo na trenutno otvorenoj bazi podataka.

source: REINDEX DATABASE: Permission denied.
hr: REINDEX DATABASE: Zabranjen pristup.

source: must be called under standalone postgres with -O -P options
hr: mora biti pokrenuto pod 'standalone postgres' procesom pokrenutim sa -O -P opcijama

source: must be called under standalone postgres with -P -O options
hr: mora biti pokrenuto pod 'standalone postgres' procesom pokrenutim sa -O -P opcijama

source: relation %u was reindexed
hr: relacija %u je reindeksirana

source: LOCK TABLE: %s is not a table
hr: LOCK TABLE: %s nije tabela

source: DefineOpClass: access method "%s" not found
hr: DefineOpClass: metoda pristupa(access method) "%s" ne postoji

source: DefineOpClass: invalid operator number %d, must be between 1 and %d
hr: DefineOpClass: pogre¹an broj operatora %d, mora biti izmeðu 1 i %d

source: DefineOpClass: operator number %d appears more than once
hr: DefineOpClass: operator sa brojem %d pojavljuje se vi¹e puta

source: DefineOpClass: Operator '%s' for types '%s' and '%s' does not exist
hr: DefineOpClass: Operator '%s' za tipove '%s' i '%s' ne postoji

source: DefineOpClass: invalid procedure number %d, must be between 1 and %d
hr: DefineOpClass: pogre¹an broj procedure %d, mora biti izmeðu 1 i %d

source: DefineOpClass: procedure number %d appears more than once
hr: DefineOpClass: broj procedure %d pojavljuje se vi¹e puta

source: DefineOpClass: storage type specified more than once
hr: DefineOpClass: 'storage type' specificiran vi¹e puta

source: DefineOpClass: bogus item type %d
hr: DefineOpClass: pogre¹an tip stavke %d

source: Storage type may not be different from datatype for access method %s
hr: Tip spremi¹ta(Storage type) ne mo¾e biti razlièit od tipa metode pristupa(access method) %s

source: Operator class "%s" already exists for access method "%s"
hr: Klasa operatora "%s" veæ postoji za pristupnu metodu(access method) "%s"

source: Can't add class "%s" as default for type %s class "%s" already is the default
hr: Nemoguæe dodavanje klase "%s" kao poèetne vrijednosti za tip %s klasa "%s" je veæ poèetna vrijednost

source: RemoveOpClass: access method "%s" not found
hr: RemoveOpClass: metoda pristupa(access method) "%s" ne postoji

source: RemoveOpClass: operator class "%s" not supported by access method "%s"
hr: RemoveOpClass: klasa operatora "%s" nije podr¾ana od strane pristupne metode "%s"

source: RemoveOpClassById: couldn't find pg_class entry %u
hr: RemoveOpClassById: 'pg_class' stavka nije naðena %u

source: setof type not implemented for leftarg
hr: 'setof' tip nije implementiran za lijevi argument(leftarg)

source: setof type not implemented for rightarg
hr: 'setof' tip nije implementiran za desni argument(righttarg)

source: DefineOperator: attribute "%s" not recognized
hr: DefineOperator: atribut "%s" nije poznat

source: Define: "procedure" unspecified
hr: Define: "procedure" nije specificirana

source: PerformPortalFetch: missing portal name
hr: PerformPortalFetch: izostavljeno ime portala

source: PerformPortalFetch: portal "%s" not found
hr: PerformPortalFetch: portal "%s" nije naðen

source: PerformPortalClose: missing portal name
hr: PerformPortalClose: izostavljeno ime portala

source: PerformPortalClose: portal "%s" not found
hr: PerformPortalClose: portal "%s" nije naðen

source: Utility statements cannot be prepared
hr: Pomoæni izraz ne mo¾e bit pripremljen(prepared)

source: ExecuteQuery: wrong number of arguments
hr: ExecuteQuery: pogre¹an broj argumenata

source: Prepared statement with name "%s" already exists
hr: Pripremljeni izraz(prepared statement) sa imenom "%s" veæ postoji

source: Unable to store prepared statement "%s"!
hr: Neuspje¹no spremanje pripremjenog izraza(prepared statement) "%s"!

source: Prepared statement with name "%s" does not exist
hr: Pripremljeni izraz(prepared statement) sa imenom "%s" ne postoji

source: Only users with superuser privilege are permitted to create procedural languages
hr: Samo korisnicima sa 'superuser' privilegijama dozvoljeno je kreiranje proceduralnih jezika(PL)

source: Language %s already exists
hr: Jezik %s veæ postoji

source: function %s() doesn't exist
hr: funkcija %s() ne postoji

source: CreateProceduralLanguage: function %s() must return LANGUAGE_HANDLER
hr: CreateProceduralLanguage: funkcija %s() mora vratiti LANGUAGE_HANDLER

source: function %s(oid) doesn't exist
hr: funkcija %s(oid) ne postoji

source: Only users with superuser privilege are permitted to drop procedural languages
hr: Samo korisnicima sa 'superuser' privilegijama dozvoljeno je brisanje proceduralnih jezika(PL)

source: Language %s doesn't exist
hr: Jezik %s ne postoji

source: CREATE SCHEMA: Illegal schema name: "%s" -- pg_ is reserved for system schemas
hr: CREATE SCHEMA: pogre¹no ime ¹eme(schema): "%s" -- pg_ je rezerviran za sistemske ¹eme

source: Schema name may not be qualified
hr: ©ema mo¾da nije specificirana

source: Schema "%s" does not exist
hr: ©ema(schema) "%s" ne postoji

source: RemoveSchemaById: schema %u not found
hr: RemoveSchemaById: ¹ema(schema) %u nije naðena

source: DefineSequence: ReadBuffer failed
hr: DefineSequence: 'ReadBuffer' nije uspio

source: %s.nextval: you don't have permissions to set sequence %s
hr: %s.nextval: nemate pravo na postavljanje vrijednosti sekvence %s

source: %s.nextval: reached MAXVALUE (%s)
hr: %s.nextval: dosegnut MAXVALUE (%s)

source: %s.nextval: reached MINVALUE (%s)
hr: %s.nextval: dosegnut MINVALUE (%s)

source: %s.currval: you don't have permissions to read sequence %s
hr: %s.currval: nemate pravo na èitanje vrijednosti sekvence %s

source: %s.currval is not yet defined in this session
hr: %s.currval nije jo¹ definiran u ovom okru¾enju

source: %s.setval: you don't have permissions to set sequence %s
hr: %s.setval: nemate pravo na postavljanje vrijednosti sekvence %s

source: %s.setval: value %s is out of bounds (%s,%s)
hr: %s.setval: vrijednost %s je van opsega (%s,%s)

source: %s.%s: %s is not a sequence
hr: %s.%s: %s nije sekvenca

source: Memory exhausted in init_sequence
hr: Memorija iscrpljena u 'init_sequence'

source: %s.%s: invalid number of blocks in sequence
hr: %s.%s: pogre¹an broj blokova u sekvenci

source: %s.%s: ReadBuffer failed
hr: %s.%s: 'ReadBuffer' nije uspio

source: %s.%s: bad magic (%08X)
hr: %s.%s: pogre¹an 'magic' (%08X)

source: DefineSequence: option "%s" not recognized
hr: DefineSequence: opcija "%s" nije poznata

source: DefineSequence: can't INCREMENT by 0
hr: DefineSequence: nemoguæe poveèavanje(INCREMENT) za vrijednost 0

source: DefineSequence: CACHE (%s) can't be <= 0
hr: DefineSequence: CACHE (%s) ne mo¾e biti <= 0

source: seq_redo: unknown op code %u
hr: seq_redo: nepoznat 'op' kod %u

source: seq_redo: can't read block of %u/%u
hr: seq_redo: nemoguæe èitanje bloka od %u/%u

source: seq_redo: failed to add item to page
hr: seq_redo: neuspjelo dodavanje stavke na stranicu

source: DefineRelation: please inherit from a relation or define an attribute
hr: DefineRelation: naslijedite od relacije ili definirajte atribut

source: TRUNCATE cannot be used on sequences. '%s' is a sequence
hr: TRUNCATE ne mo¾e biti kori¹ten nad sekvencama. '%s' je sekvenca

source: TRUNCATE cannot be used on views. '%s' is a view
hr: TRUNCATE ne mo¾e biti kori¹ten 'view'-om. '%s' je 'view'

source: TRUNCATE can only be used on tables. '%s' is not a table
hr: TRUNCATE mo¾e biti kori¹ten samo nad tabelalma. '%s' nije tabela

source: TRUNCATE cannot be used on system tables. '%s' is a system table
hr: TRUNCATE ne mo¾e biti kori¹ten nad sistemskim tabelalma. '%s' je sistemska tabela

source: TRUNCATE cannot be used on temp tables of other processes
hr: TRUNCATE ne mo¾e biti kori¹ten na privremenim tabelama drugog procesa

source: CREATE TABLE: attribute "%s" duplicated
hr: CREATE TABLE: attribut "%s" dupliciran

source: CREATE TABLE: inherited relation "%s" is not a table
hr: CREATE TABLE: naslijeðena relacija "%s" nije tabela

source: CREATE TABLE: cannot inherit from temp relation "%s"
hr: CREATE TABLE: ne mo¾ete naslijediti privremenu(temp) relaciju "%s"

source: CREATE TABLE: inherited relation "%s" duplicated
hr: CREATE TABLE: naslijeðena relacija "%s" duplicirana

source: CREATE TABLE: merging multiple inherited definitions of attribute "%s"
hr: CREATE TABLE: spajanje vi¹estruke naslijeðene definicije atributa "%s"

source: CREATE TABLE: inherited attribute "%s" type conflict (%s and %s)
hr: CREATE TABLE: naslijeðeni atribut "%s" konflikt tipa (%s and %s)

source: CREATE TABLE: merging attribute "%s" with inherited definition
hr: CREATE TABLE: spajanje atributa "%s" sa naslijeðenom definicijom

source: CREATE TABLE: attribute "%s" type conflict (%s and %s)
hr: CREATE TABLE: atribut "%s" - konflikt tipa (%s and %s)

source: CREATE TABLE: attribute "%s" inherits conflicting default values To resolve the conflict, specify a default explicitly
hr: CREATE TABLE: atribut "%s" naslijeðuje konflikte poèetne vrijednosti (default values) Da bi rije¹ili konflikt, specificirajte poèetne vrijednosti (default values) eksplicitno

source: setRelhassubclassInRelation: cache lookup failed for relation %u
hr: setRelhassubclassInRelation: nije uspjelo tra¾enje relacije %u u cache-u

source: renameatt: class "%s" is a system catalog
hr: renameatt: klasa "%s" je sistemski katalog

source: renameatt: attribute "%s" does not exist
hr: renameatt: atribut "%s" ne postoji

source: renameatt: system attribute "%s" may not be renamed
hr: renameatt: sistemski atribut "%s" ne mo¾e biti preimenovan

source: renameatt: inherited attribute "%s" may not be renamed
hr: renameatt: nasljeðeni atribut "%s" ne mo¾e biti preimenovan

source: renameatt: attribute "%s" exists
hr: renameatt: atribut "%s" postoji

source: renameatt: can't find index id %u
hr: renameatt: nemoguæe pronaæo indeks id %u

source: renamerel: system relation "%s" may not be renamed
hr: renamerel: sistemska relacija "%s" ne mo¾e se preimenovati

source: renamerel: relation "%s" does not exist
hr: renamerel: relacija "%s" ne postoji

source: renamerel: relation "%s" exists
hr: renamerel: relacija "%s" postoji

source: ALTER TABLE: relation "%s" is not a table
hr: ALTER TABLE: relacija "%s" nije tabela

source: ALTER TABLE: relation "%s" is a system catalog
hr: ALTER TABLE: relacija "%s" je sistemski katalog

source: ALTER TABLE: child table "%s" has different type for column "%s"
hr: ALTER TABLE: tabela potomak(child table)"%s" ima drugaèiji tip za kolonu "%s"

source: ALTER TABLE: merging definition of column "%s" for child %s
hr: ALTER TABLE: spajanje definicje kolone "%s" za potomka(child) %s

source: Adding columns with defaults is not implemented. Add the column, then use ALTER TABLE SET DEFAULT.
hr: Dodavanje kolona sa 'defautl' vrijednostima nije implementirano. Dodajte kolonu, zatim upotrijebite ALTER TABLE SET DEFAULT.

source: Adding NOT NULL columns is not implemented. Add the column, then use ALTER TABLE ... SET NOT NULL.
hr: Dodavanje NOT NULL kolona nije implementirano. Dodajte kolonu, zatim upotrijebite ALTER TABLE ... SET NOT NULL.

source: ALTER TABLE: relation "%s" not found
hr: ALTER TABLE: relacija "%s" nije naðena

source: ALTER TABLE: column name "%s" already exists in table "%s"
hr: ALTER TABLE: kolona sa imenom "%s" veæ postoji u tablici "%s"

source: ALTER TABLE: relations limited to %d columns
hr: ALTER TABLE: relacije su limitirane sa %d kolona

source: ALTER TABLE: Cannot alter system attribute "%s"
hr: ALTER TABLE: nemoguæe mijenjanje sistemskih atributa "%s"

source: ALTER TABLE: Index %u not found
hr: ALTER TABLE: indeks %u nije naðen

source: ALTER TABLE: Attribute "%s" is in a primary key
hr: ALTER TABLE: Atribut "%s" nije primarni kljuè

source: ALTER TABLE: relation "%s" has no column "%s"
hr: ALTER TABLE: relacija "%s" nema kolona "%s"

source: ALTER TABLE: Attribute "%s" contains NULL values
hr: ALTER TABLE: Atribut "%s" - sadr¾ava NULL vrijednosti

source: ALTER TABLE: relation "%s" is not a table or view
hr: ALTER TABLE: relacija "%s" nije tablica(table) niti 'view'

source: ALTER TABLE: statistics target %d is too low
hr: ALTER TABLE: cilj statistike(statistics target) %d je prenizak

source: ALTER TABLE: lowering statistics target to 1000
hr: ALTER TABLE: smanjujem cilj statistike(statistics target) na 1000

source: ALTER TABLE: "%s" storage not recognized
hr: ALTER TABLE: "%s" skladi¹tenje(storage) nije poznato

source: ALTER TABLE: Invalid column flag: %c
hr: ALTER TABLE: Pogre¹na zastavica kolone: %c

source: ALTER TABLE: cannot change system attribute "%s"
hr: ALTER TABLE: nemoguæe mijenjanje sistemskih atributa "%s"

source: ALTER TABLE: Column datatype %s can only have storage "plain"
hr: ALTER TABLE: Tip podatka za kolonu %s mo¾e imati samo "plain" skladi¹tenje(storage)

source: ALTER TABLE: Cannot drop system attribute "%s"
hr: ALTER TABLE: Nemoguæe brisanje sistemskog atributa "%s"

source: ALTER TABLE: Cannot drop inherited column "%s"
hr: CREATE TABLE: Nemoguæe brisanje nasljeðene kolone "%s"

source: ALTER TABLE: relation %u has no column "%s"
hr: ALTER TABLE: relacija %u nema kolone "%s"

source: ALTER TABLE: relation %u has non-inherited column "%s"
hr: ALTER TABLE: relacija %u ima kolonu koja nije nasljeðena "%s"

source: ALTER TABLE / ADD CONSTRAINT is not implemented for that constraint type.
hr: ALTER TABLE / ADD CONSTRAINT nije implementirana za taj tip 'constraint'-a.

source: ALTER TABLE / ADD CONSTRAINT unable to determine type of constraint passed
hr: ALTER TABLE / ADD CONSTRAINT neuspjelo odreðivanje tipa proslijeðenog 'constraint'-a

source: Only relation '%s' can be referenced in CHECK
hr: Samo relacija '%s' mo¾e biti referencirana u CHECK klauzuli.

source: AlterTableAddConstraint: rejected due to CHECK constraint %s
hr: AlterTableAddConstraint: odbaèeno zbog 'CHECK constraint'-a %s

source: referenced relation "%s" is not a table
hr: referencirana relacija '"%s" nije tablica(table)

source: %s: relation "%s" is a system catalog
hr: %s: relacija "%s" je sistemski katalog

source: %s: Unable to reference temporary table from permanent table constraint
hr: %s: Nemoguæe referencirati privremenu(temporary) tabelu iz permanentnog 'table constraint'-a.

source: %s: number of referencing and referenced attributes for foreign key disagree
hr: %s: broj referenciranih i referencirajuæih atributa za 'foreign key' ne odgovaraju

source: %s: column "%s" referenced in foreign key constraint does not exist
hr: %s: kolona "%s" referencirana u 'foreign key constraint'-u ne postoji

source: Can only have %d keys in a foreign key
hr: Moguæe je imati samo %d kljuèeva u 'foreign key'-u

source: transformFkeyGetPrimaryKey: index %u not found
hr: transformFkeyGetPrimaryKey: indeks %u nije naðen

source: PRIMARY KEY for referenced table "%s" not found
hr: PRIMARY KEY za referenciranu tabelu "%s" nije naðen

source: transformFkeyCheckAttrs: index %u not found
hr: transformFkeyCheckAttrs: indeks %u nije naðen

source: UNIQUE constraint matching given keys for referenced table "%s" not found
hr: 'UNIQUE constraint' koji odgovara datim kljuèevima za referenciranu tabelu "%s" nije naðen

source: number of key attributes in referenced table must be equal to foreign key Illegal FOREIGN KEY definition references "%s"
hr: broj kljuènih atributa u referenciranoj tabeli mora biti jednak 'foreign key'-u Pogre¹na FOREIGN KEY definicija reference "%s"

source: Unrecognized ON DELETE action for FOREIGN KEY constraint
hr: Nepoznata ON DELETE akcija za 'FOREIGN KEY constraint'

source: Unrecognized ON UPDATE action for FOREIGN KEY constraint
hr: Nepoznata ON UPDATE akcija za 'FOREIGN KEY constraint'

source: fkMatchTypeToString: Unknown MATCH TYPE '%c'
hr: fkMatchTypeToString: Nepoznat MATCH TYPE '%c'

source: ALTER TABLE / DROP CONSTRAINT: %s does not exist
hr: ALTER TABLE / DROP CONSTRAINT: %s ne postoji

source: Multiple constraints dropped
hr: Vi¹e constraint-a obrisano

source: ALTER TABLE: relation %u not found
hr: ALTER TABLE: relacija %u nije naðena

source: ALTER TABLE: relation "%s" is not a table, TOAST table, index, view, or sequence
hr: ALTER TABLE: relacija "%s" nije 'table','TOAST table','index', 'view' niti 'sequence'

source: Shared relations cannot be toasted after initdb
hr: Dijeljene relacija ne mogu biti 'toasted' poslije 'initdb'

source: ALTER TABLE: relation "%s" already has a toast table
hr: ALTER TABLE: relacija "%s" veæ ima 'toast table'

source: ALTER TABLE: relation "%s" does not need a toast table
hr: ALTER TABLE: relacija "%s" ne zahtijeva 'toast table'

source: Unable to find table for constraint "%s"
hr: Neuspje¹no tra¾enje tabele za 'constraint' "%s"!

source: CreateTrigger: relation "%s" is not a table
hr: CreateTrigger: relacija "%s" nije tabela

source: CreateTrigger: can't create trigger for system relation %s
hr: CreateTrigger: nemoguæe kreiranje 'trigger'-a za sistemsku relaciju %s

source: CreateTrigger: STATEMENT triggers are unimplemented, yet
hr: CreateTrigger: 'STATEMENT triggers' nisu jo¹ implementirani

source: CreateTrigger: double INSERT event specified
hr: CreateTrigger: dvostruki INSERT dogaðaj specificiran

source: CreateTrigger: double DELETE event specified
hr: CreateTrigger: dvostruki DELETE dogaðaj specificiran

source: CreateTrigger: double UPDATE event specified
hr: CreateTrigger: dvostruki UPDATE dogaðaj specificiran

source: CreateTrigger: unknown event specified
hr: CreateTrigger: nepoznati dogaðaj specificiran

source: CreateTrigger: trigger %s already defined on relation %s
hr: CreateTrigger: trigger %s je veæ definiran za relaciju %s

source: CreateTrigger: function %s() does not exist
hr: CreateTrigger: funkcija %s() ne postoji

source: CreateTrigger: changing return type of function %s() from OPAQUE to TRIGGER
hr: CreateTrigger: mijenjanje povratnog tipa funkcije %s() iz OPAQUE u TRIGGER

source: CreateTrigger: function %s() must return TRIGGER
hr: CreateTrigger: funkcija %s() mora vratiti TRIGGER

source: CreateTrigger: relation %s not found in pg_class
hr: CreateTrigger: relacija %s nije naðena u pg_class

source: DropTrigger: there is no trigger %s on relation %s
hr: DropTrigger: ne postoji trigger %s u relaciji %s

source: RemoveTriggerById: Trigger %u does not exist
hr: RemoveTriggerById: Trigger %u ne postoji

source: DropTrigger: relation "%s" is not a table
hr: DropTrigger: relacija "%s" nije tabela

source: DropTrigger: can't drop trigger for system relation %s
hr: DropTrigger: nemoguæe brisanje 'trigger'-a za sistemsku relaciju %s

source: DropTrigger: relation %s not found in pg_class
hr: DropTrigger: relacija %s nije naðena u pg_class

source: DropTrigger: relation %s has reltriggers = 0
hr: DropTrigger: relacija %s ima reltriggers = 0

source: renametrig: trigger %s already defined on relation %s
hr: renametrig: trigger %s je veæ definiran za relaciju %s

source: renametrig: trigger %s not defined on relation %s
hr: renametrig: trigger %s je veæ definiran za relaciju %s

source: RelationBuildTriggers: unexpected record found for rel %s
hr: RelationBuildTriggers: neoèekivan slog naðen za relaciju %s

source: RelationBuildTriggers: tgargs IS NULL for rel %s
hr: RelationBuildTriggers: tgargs IS NULL za relaciju %s

source: RelationBuildTriggers: %d record(s) not found for rel %s
hr: RelationBuildTriggers: %d slog(ova) nije naðeno za relaciju %s

source: ExecCallTriggerFunc: function %u returned NULL
hr: ExecCallTriggerFunc: funkcija %u je vratila NULL

source: Can't serialize access due to concurrent update
hr: Nemoguæe serijalizirati pristup zbog konkurentnog a¾uriranja

source: Unknown status %u from heap_mark4update
hr: Nepoznat status %u od 'heap_mark4update'
