Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: heap_attisnull: zero attnum disallowed
hr: heap_attisnull: nulti attnum nije dopu¹teno

source: heap_attisnull: undefined negative attnum
hr: heap_attisnull: nedefiniran negativni attnum

source: heap_getsysattr: invalid attnum %d
hr: heap_getsysattr: pogre¹an attnum %d

source: heap_formtuple: numberOfAttributes %d exceeds limit %d
hr: heap_formtuple: 'numberOfAttributes' od %d je veæi od %d

source: heap_modifytuple: repl is \%3d
hr: heap_modifytuple: repl je \%3d

source: index_formtuple: data takes %lu bytes, max is %d
hr: index_formtuple: podaci zauzimaju %lu bytes, maximum je %d

source: Unable to look up type id %u
hr: Neuspjelo tra¾enje tipa %u u 'cahe'-u

source: Invalid typrelid for complex type %u
hr: Pogre¹an 'typrelid' za kompleksni tip %u

source: TypeGetTupleDesc: number of aliases does not match number of attributes
hr: TypeGetTupleDesc: broj aliasa ne odgovara broju atributa

source: TypeGetTupleDesc: no column alias was provided
hr: TypeGetTupleDesc: alias kolone nije zadan

source: Unable to determine tuple description for function returning "record"
hr: Nemoguæe utvrditi 'tuple description' za funkciju koja vraæa "record"

source: Unknown kind of return type specified for function
hr: Nepoznata vrsta povratnog tipa specificiranog za funkciju

source: %s already contains data
hr: %s veæ sadr¾i podatke

source: gist: failed to add index item to %s
hr: gist: dodavanje indeksa na %s nije uspjelo

source: gist_redo: unimplemented
hr: gist_redo: neimplemetirano

source: gist_undo: unimplemented
hr: gist_undo: neimplemetirano

source: GiST scan list corrupted -- cannot find 0x%p
hr: GiST scan list koruptiran -- nemoguæe pronaæi 0x%p

source: Bad operation in GiST scan adjust: %d
hr: Pogre¹na operacija u 'GiST scan adjust': %d

source: hash_redo: unimplemented
hr: hash_redo: neimplemetirano

source: hash_undo: unimplemented
hr: hash_undo: neimplemetirano

source: Hash indices valid for only one index key.
hr: Hash pokazivaè ispravan samo za jedan indeksni kljuè.

source: hash item too large
hr: hash stavka prevelika

source: _hash_pgaddtup: failed to add index item to %s
hr: _hash_pgaddtup: nije uspjelo dodavanje indeksa u %s

source: _hash_addovflpage: problem with _hash_getovfladdr.
hr: _hash_addovflpage: problem s _hash_getovfladdr.

source: overflow_page: problem with _hash_initbitmap.
hr: overflow_page: problem s _hash_initbitmap.

source: _hash_squeezebucket: failed to add index item to %s
hr: _hash_squeezebucket: nije uspjelo dodavanje indeksa u %s

source: Cannot initialize non-empty hash table %s
hr: Nemoguæe inicijalizirati hash tabelu koja nije prazna %s

source: Problem with _hash_initbitmap.
hr: problem s _hash_initbitmap.

source: _hash_getbuf: internal error: hash AM does not use P_NEW
hr: _hash_getbuf: interna gre¹ka: hash AM ne koristi P_NEW

source: _hash_getbuf: invalid access (%d) on new blk: %s
hr: _hash_getbuf: pogre¹an pristup (%d) na novom blk: %s

source: _hash_relbuf: invalid access (%d) on blk %x: %s
hr: _hash_relbuf: pogre¹an pristup (%d) na blk %x: %s

source: _hash_chgbufaccess: invalid access (%d) on blk %x: %s
hr: _hash_chgbufaccess: pogre¹an pristup (%d) na blk %x: %s

source: _hash_setpagelock: invalid access (%d) on blk %x: %s
hr: _hash_setpagelock: pogre¹an pristup (%d) na blk %x: %s

source: _hash_unsetpagelock: invalid access (%d) on blk %x: %s
hr: _hash_unsetpagelock: pogre¹an pristup (%d) na blk %x: %s

source: _hash_splitpage: empty overflow page %d
hr: _hash_splitpage: prazna overflow stranica %d

source: _hash_splitpage: empty ovfl page %d!
hr: _hash_splitpage: prazna ovfl stranica %d!

source: _hash_splitpage: failed to add index item to %s
hr: _hash_splitpage: nije uspjelo dodavanje indeksa na %s

source: hash scan list trashed; can't find 0x%p
hr: hash scan list o¹teèen: nemoguæe pronaæi 0x%p

source: hash indices cannot include null keys
hr: hash pokazivaè ne mo¾e sadr¾avati nulti kljuè

source: heapgettup: failed ReadBuffer
hr: heapgettup: neuspjeli ReadBuffer

source: Relation %u does not exist
hr: Relacija %u ne postoji

source: Relation "%s" does not exist
hr: Relacija "%s" ne postoji

source: %s is an index relation
hr: %s nije index

source: %s is a special relation
hr: %s je specijalna relacija

source: %s is a composite type
hr: %s je kompozitni tip

source: heap_getnext returning EOS
hr: heap_getnext vraèa EOS

source: heap_getnext returning tuple
hr: heap_getnext vraèa tuple

source: heap_fetch: ReadBuffer(%s, %lu) failed
hr: heap_fetch: 'ReadBuffer'(%s, %lu) nije uspio

source: heap_get_latest_tid: %s relation: ReadBuffer(%lx) failed
hr: heap_get_latest_tid: %s relacija: ReadBuffer(%lx) nije uspio

source: heap_delete: failed ReadBuffer
hr: heap_delete: nije uspio ReadBuffer

source: heap_delete: (am)invalid tid
hr: heap_delete: pogre¹an tid

source: simple_heap_delete: tuple already updated by self
hr: simple_heap_delete: slog(tuple) je veæ a¾uriran od samog same

source: simple_heap_delete: tuple concurrently updated
hr: simple_heap_delete: slog(tuple) konkurentno a¾uriran

source: Unknown status %u from heap_delete
hr: Nepoznat status %u od heap_delete

source: heap_update: failed ReadBuffer
hr: heap_update: nije uspio ReadBuffer

source: heap_update: (am)invalid tid
hr: heap_update: (am)pogre¹an tid

source: simple_heap_update: tuple already updated by self
hr: simple_heap_update: slog(tuple) je veæ a¾uriran od samog sebe

source: simple_heap_update: tuple concurrently updated
hr: simple_heap_update: slog(tuple) konkurentno a¾uriran

source: Unknown status %u from heap_update
hr: Nepoznat status %u od heap_update

source: heap_mark4update: failed ReadBuffer
hr: heap_mark4update: nije uspio ReadBuffer

source: heap_mark4update: (am)invalid tid
hr: heap_mark4update: (am)pogre¹an tid

source: heap_clean_redo: no block
hr: heap_clean_redo: nije blok

source: heap_clean_redo: uninitialized page
hr: heap_clean_redo: neinicijalizirana stranica

source: heap_delete_%sdo: no block
hr: heap_delete_%sdo: nije blok

source: heap_delete_%sdo: uninitialized page
hr: heap_delete_%sdo: neinicijalizirana stranica

source: heap_delete_undo: bad page LSN
hr: heap_delete_undo: pogre¹an LSN stranice

source: heap_delete_%sdo: invalid lp
hr: heap_delete_%sdo: pogre¹an lp

source: heap_delete_undo: unimplemented
hr: heap_delete_undo: neimplementirano

source: heap_insert_%sdo: uninitialized page
hr: heap_insert_%sdo: neinicijalizirana stranica

source: heap_insert_redo: invalid max offset number
hr: heap_insert_redo: pogre¹an maksimalan broj offset-a

source: heap_insert_redo: failed to add tuple
hr: heap_insert_redo: nije uspjelo dodavanje sloga(tuple)

source: heap_insert_undo: bad page LSN
hr: heap_insert_undo: pogre¹an LSN stranice

source: heap_insert_undo: unimplemented
hr: heap_insert_undo: neimplementirano

source: heap_update_%sdo: no block
hr: heap_update_%sdo: nije block

source: heap_update_%sdo: uninitialized old page
hr: heap_update_%sdo: neinicijalizirana stara stranica

source: heap_update_undo: bad old tuple page LSN
hr: heap_update_undo: pogre¹an LSN stare tuple stranice

source: heap_update_%sdo: invalid lp
hr: heap_update_%sdo: pogre¹an lp

source: heap_update_undo: unimplemented
hr: heap_update_undo: neimplemetirano

source: heap_update_%sdo: uninitialized page
hr: heap_update_%sdo: neinicijalizirana stranica

source: heap_update_redo: invalid max offset number
hr: heap_update_redo: pogre¹an maksimalan broj offset-a

source: heap_update_redo: failed to add tuple
hr: heap_update_redo: nije uspjelo dodavanje sloga(tuple)

source: heap_update_undo: bad new tuple page LSN
hr: heap_update_undo: pogre¹an LSN nove tuple stranice

source: _heap_unlock_tuple: can't open relation
hr: _heap_unlock_tuple: nemoguæe otvoriti relaciju

source: _heap_unlock_tuple: can't read buffer
hr: _heap_unlock_tuple: nemoguæe èitanje buffer-a

source: _heap_unlock_tuple: uninitialized page
hr: _heap_unlock_tuple: neinicijalizirana stranica

source: _heap_unlock_tuple: invalid itemid
hr: _heap_unlock_tuple: pogre¹an id stavke

source: _heap_unlock_tuple: unused/deleted tuple in rollback
hr: _heap_unlock_tuple: neiskori¹ten/obrisan tuple u rollback

source: _heap_unlock_tuple: invalid xmax in rollback
hr: _heap_unlock_tuple: pogre¹an 'xmax' u 'rollback'-u

source: heap_redo: unknown op code %u
hr: heap_redo: nepoznat op kod %u

source: heap_undo: unknown op code %u
hr: heap_undo: nepoznat op kod %u

source: RelationPutHeapTuple: failed to add tuple
hr: RelationPutHeapTuple: nije uspjelo dodavanje sloga(tuple)

source: Tuple is too big: size %lu, max size %ld
hr: Tuple je prevelik: velièina %lu, maksimalna velièina %ld

source: Tuple is too big: size %lu
hr: Tuple je prevelik: velièina %lu

source: Failed to build TOAST tuple
hr: Nije uspjelo kreiranje TOAST sloga(tuple)

source: Failed to insert index entry for TOAST tuple
hr: nije uspjelo dodavanje indeksne stavke za TOAST slog(tuple)

source: unexpected chunk number %d (expected %d) for toast value %u
hr: Neoèekivan broj 'chunk'-a %d (oèekivan %d) za TOAST vrijednost %u

source: unexpected chunk size %d in chunk %d for toast value %u
hr: neoèekivana velièina 'chunk'-a %d u 'chunk'-u %d za TOAST vrijednost %u

source: unexpected chunk number %d for toast value %u
hr: Neoèekivan broj 'chunk'-a %d za TOAST vrijednost %u

source: missing chunk number %d for toast value %u
hr: Nepostojeæi broj 'chunk'-a %d za TOAST vrijednost %u

source: RelationGetIndexScan: relation invalid
hr: RelationGetIndexScan: pogre¹na relacija

source: IndexScanEnd: invalid scan
hr: IndexScanEnd: pogre¹an scan

source: index_%s: invalid %s regproc
hr: index_%s: pogre¹an %s regproc

source: %s is not an index relation
hr: %s nije indeksna relacija

source: Missing support function %d for attribute %d of index %s
hr: Nedostaje funkcija podr¹ke %d za atribut %d indeksa %s

source: StrategyTermEvaluate: impossible case %d
hr: StrategyTermEvaluate: nemoguæ sluèaj %d

source: RelationGetStrategy: impossible case %d
hr: RelationGetStrategy: nemoguæ sluèaj %d

source: RelationGetStrategy: corrupted evaluation
hr: RelationGetStrategy: pogre¹no dodijeljivanje vrijednosti

source: RelationInvokeStrategy: cannot evaluate strategy %d
hr: RelationInvokeStrategy: nemoguæe odrediti strategiju %d

source: Cannot insert a duplicate key into unique index %s
hr: Nemoguæe dodavanje dupliciranog kljuèa u unikatni index %s

source: btree: index item size %lu exceeds maximum %lu
hr: btree: velièina indeksne stavke %lu prekoraèuje maximum %lu

source: btree: concurrent ROOT page split
hr: btree: konkurentna ROOT dioba stranica

source: bt_insertonpg[%s]: no root page found
hr: bt_insertonpg[%s]: niti jedna vr¹na(root) stranica nije naðena

source: bt_insertonpg[%s]: root page unfound - fixing upper levels
hr: bt_insertonpg[%s]: niti jedna vr¹na(root) stranica nije naðena - ispravak vi¹ih nivoa

source: _bt_getstackbuf: my bits moved right off the end of the world! Recreate index %s.
hr: _bt_getstackbuf: Moji bitovi pomaknuti pravo na kraj svijeta ! Ponovno kreirati index %s.

source: bt_insertonpg[%s]: parent page unfound - fixing branch
hr: bt_insertonpg[%s]: matièna stranica nije naðena - popravak izdanka

source: btree: failed to add hikey to the right sibling
hr: btree: nije uspjelo nadodavanje kljuèa desnom susjedu

source: btree: failed to add hikey to the left sibling
hr: btree: nije uspjelo nadodavanje kljuèa lijevom susjedu

source: _bt_findsplitloc: can't find a feasible split point for %s
hr: _bt_findsplitloc: nemoguæe pronaèi isplativu toèku dijeljenja za toèku %s

source: btree: failed to add leftkey to new root page
hr: btree: nije uspjelo dodavanje lijevog kljuèa novoj vr¹noj stranici

source: btree: failed to add rightkey to new root page
hr: btree: nije uspjelo dodavanje desnog kljuèa novoj vr¹noj stranici

source: bt_fixroot: not valid old root page
hr: bt_fixroot: neispravna stara vr¹na(root)stranica

source: bt_fixtree[%s]: invalid start page (need to recreate index)
hr: bt_fixtree[%s]: neispravna poèetna stranica (nu¾no ponovno kreirati index)

source: bt_fixtree[%s]: fixing root page
hr: bt_fixtree[%s]: popravak vr¹ne stranice

source: bt_fixlevel[%s]: invalid maxoff on start page (need to recreate index)
hr: bt_fixlevel[%s]: pogre¹an maxoff vr¹ne stranice (nu¾no ponovno kreirati index)

source: bt_fixtlevel[%s]: non-leftmost child page of leftmost parent (need to recreate index)
hr: bt_fixtlevel[%s]: ne krajnje-lijevi potomak (stranica) od kranje-lijevog roditelja (nu¾noponovno kreirati index)

source: bt_fixtlevel[%s]: invalid start child (need to recreate index)
hr: bt_fixtlevel[%s]: pogre¹an poèetni potomak (nu¾no ponovno kreirati index)

source: bt_fixlevel[%s]: invalid item order(1) (need to recreate index)
hr: bt_fixlevel[%s]: pogre¹an redosljed stavki(1) (nu¾no ponovno kreirati index)

source: bt_fixlevel[%s]: pointer disappeared (need to recreate index)
hr: bt_fixlevel[%s]: pokazivaè izgubljen (nu¾no ponovno kreirati index)

source: bt_fixlevel[%s]: invalid item order(2) (need to recreate index)
hr: bt_fixlevel[%s]: pogre¹an redosljed stavki(2) (nu¾no ponovno kreirati index)

source: bt_fixlevel[%s]: invalid item order(3) (need to recreate index)
hr: bt_fixlevel[%s]: pogre¹an redosljed stavki(3) (nu¾no ponovno kreirati index)

source: bt_fixbranch[%s]: left pointer unfound (need to recreate index)
hr: bt_fixbranch[%s]: lijevi pokazivaè nije naðen (nu¾no ponovno kreirati index)

source: bt_fixbranch[%s]: invalid item order (need to recreate index)
hr: bt_fixlevel[%s]: pogre¹an redosljed stavki (nu¾no ponovno kreirati index)

source: bt_fixbranch[%s]: right pointer unfound(1) (need to recreate index)
hr: bt_fixbranch[%s]: desni pokazivaè nije naðen(1) (nu¾no ponovno kreirati index)

source: bt_fixbranch[%s]: right pointer unfound(2) (need to recreate index)
hr: bt_fixbranch[%s]: desni pokazivaè nije naðen(2) (nu¾no ponovno kreirati index)

source: bt_fixbranch[%s]: fixing upper levels
hr: bt_fixbranch[%s]: popravljanje vi¹ih nivoa

source: bt_fixup[%s]: checking/fixing upper levels
hr: bt_fixup[%s]: provjera/popravljanje vi¹ih nivoa

source: bt_fixup[%s]: fixing root page
hr: bt_fixup[%s]: popravljanje vr¹ne stranice

source: btree: failed to add item to the %s for %s
hr: btree: nije uspjelo dodavanje stavke u %s za %s

source: Cannot initialize non-empty btree %s
hr: Nemoguæe inicijalizirati btree %s jer nije prazan

source: Index %s is not a btree
hr: Index %s nije btree

source: Version mismatch on %s: version %d file, version %d code
hr: Pogre¹na verzija na %s: verzija datoteke je %d, verzija koda %d

source: bt_getroot[%s]: fixing root page
hr: bt_getroot[%s]: popravljanje vr¹ne stranice

source: _bt_restscan: my bits moved right off the end of the world! Recreate index %s.
hr: _bt_restscan: moji bitovi pomaknuti pravo na kraj svijeta ! Ponovno kreirati index %s.

source: _bt_restore_page: can't add item to page
hr: _bt_restore_page: nemoguæe dodati stavku na stranicu

source: btree_delete_redo: block unfound
hr: btree_delete_redo: blok nije naðen

source: btree_delete_redo: uninitialized page
hr: btree_delete_redo: neinicijalizirana stranica

source: btree_insert_%sdo: block unfound
hr: btree_insert_%sdo: blok nije naðen

source: btree_insert_%sdo: uninitialized page
hr: btree_insert_%sdo: neinicijalizirana stranica

source: btree_insert_redo: failed to add item
hr: btree_insert_redo: nemoguæe dodati stavku na stranice

source: btree_insert_undo: bad page LSN
hr: btree_insert_undo: pogre¹an LSN stranice

source: btree_insert_undo: unimplemented
hr: btree_insert_undo: neimplemetirano

source: btree_split_%s: lost left sibling
hr: btree_split_%s: izgubljen lijevi susjed

source: btree_split_undo: uninitialized left sibling
hr: btree_split_undo: neinicijaliziran lijevi susjed

source: btree_split_undo: bad left sibling LSN
hr: btree_split_undo: pogre¹an LSN lijevog susjed

source: btree_split_undo: unimplemented
hr: btree_split_undo: neimplemetirano

source: btree_split_%s: lost right sibling
hr: btree_split_%s: izgubljen desni susjed

source: btree_split_undo: uninitialized right sibling
hr: btree_split_undo: neinicijaliziran desni susjed

source: btree_split_undo: bad right sibling LSN
hr: btree_split_undo: pogre¹an LSN desnog susjeda

source: btree_split_redo: lost next right page
hr: btree_split_redo: izgubljena sljedeæa desna stranica

source: btree_split_redo: uninitialized next right page
hr: btree_split_redo: neinicijalizirana sljedeæa desna stranica

source: btree_newroot_redo: no root page
hr: btree_newroot_redo: nije vr¹na(root)stranica

source: btree_newroot_redo: no metapage
hr: btree_newroot_redo: nije metapage

source: btree_redo: unknown op code %u
hr: btree_redo: nepoznat op kod %u

source: btree_undo: unknown op code %u
hr: btree_undo: nepoznat op kod %u

source: _bt_first: btree doesn't support is(not)null, yet
hr: _bt_first: btree ne podr¾ava je(nije)null, jo¹

source: _bt_first: equal items disappeared?
hr: _bt_first: jednake stavke nestale ?

source: Illegal scan direction %d
hr: Nedopu¹ten smjer scan-a %d

source: btree: failed to add item to the page in _bt_sort
hr: btree: nije uspjelo dodavanje stavke na stranicu u _bt_sort

source: btree: index item size %lu exceeds maximum %ld
hr: btree: velièina stavke index-a %lu prekoraèila maximum %ld

source: _bt_orderkeys: key(s) for attribute 1 missed
hr: _bt_orderkeys: kjuè(evi) za atribut 1 proma¹eni

source: _bt_orderkeys: key(s) for attribute %d missed
hr: _bt_orderkeys: kjuè(evi) za atribut %d proma¹eni

source: _bt_getstrategynumber: unable to identify operator %u
hr: _bt_getstrategynumber: nemoguæe identificirati operator %u

source: rtdoinsert: failed to add index item to %s
hr: rtdoinsert: nije uspjelo dodavanje stavke u index %s

source: rtdosplit: failed to add index item to %s
hr: rtdosplit: nije uspjelo dodavanje stavke u index %s

source: Variable-length rtree keys are not supported.
hr: kljuèevi s promijenjivom duljinom za rtree nisu podr¾ani.

source: rtintinsert: failed to add index item to %s
hr: rtintinsert: nije uspjelo dodavanje stavke u index %s

source: rtnewroot: failed to add index item to %s
hr: rtnewroot: nije uspjelo dodavanje stavke u index %s

source: rtree: index item size %lu exceeds maximum %lu
hr: rtree: velièina stavke index-a %lu prekoraèila maximum %lu

source: rtpicksplit: failed to find a workable page split
hr: rtpicksplit: upotrebljivo dijeljene stranice nije naðeno

source: rtree_redo: unimplemented
hr: rtree_redo: neimplemetirano

source: rtree_undo: unimplemented
hr: rtree_undo: neimplemetirano

source: rtree scan list corrupted -- cannot find 0x%p
hr: rtree scan list koruptiran -- nemoguæe pronaæi 0x%p

source: Bad operation in rtree scan adjust: %d
hr: Pogre¹na operacija u rtree scan-u prilagodi: %d

source: open of %s failed: %m
hr: otvaranje %s nije uspjelo: %m

source: clog file %s doesn't exist, reading as zeroes
hr: clog datoteka %s ne postoji, èitano kao nule

source: lseek of clog file %u, offset %u failed: %m
hr: lseek clog datoteke %u, offset %u nije uspio: %m

source: read of clog file %u, offset %u failed: %m
hr: èitanje clog datoteke %u, offset %u nije uspjelo: %m

source: creation of file %s failed: %m
hr: tvorba datoteke %s nije uspjela: %m

source: write of clog file %u, offset %u failed: %m
hr: pisanje u clog datoteku %u, offset %u nije uspjelo: %m

source: unable to truncate commit log: apparent wraparound
hr: nemoguæe odrezati commit log

source: could not open transaction-commit log directory (%s): %m
hr: nemoguæe otvoriti transaction-commit log direktorij (%s): %m

source: removing commit log file %s
hr: brisanje commit log datoteka %s

source: could not read transaction-commit log directory (%s): %m
hr: nemoguæe èitanje transaction-commit log direktorija (%s): %m

source: You may only have 2^32-1 commands per transaction
hr: Mo¾ete izvr¹iti samo 2^32-1 komande po jednoj transakciji

source: CommitTransaction and not in in-progress state
hr: CommitTransaction nije u in-progress stanju

source: AbortTransaction and not in in-progress state
hr: AbortTransaction nije u in-progress stanju

source: CleanupTransaction and not in abort state
hr: CleanupTransaction nije u abort stanju

source: StartTransactionCommand: can't prevent chain
hr: StartTransactionCommand: nemoguæe sprijeèiti 'chain'

source: StartTransactionCommand: unexpected TBLOCK_BEGIN
hr: StartTransactionCommand: neoèekivani TBLOCK_BEGIN

source: StartTransactionCommand: unexpected TBLOCK_END
hr: StartTransactionCommand: neoèekivani TBLOCK_END

source: StartTransactionCommand: unexpected TBLOCK_ENDABORT
hr: StartTransactionCommand: neoèekivani TBLOCK_ENDABORT

source: %s cannot run inside a transaction block
hr: %s nemoguæe izvr¹iti unutar 'transaction' bloka

source: %s cannot be executed from a function
hr: %s ne mo¾e biti izvr¹en iz unutra¹njosti funkcije

source: PreventTransactionChain: can't prevent chain
hr: PreventTransactionChain: nemoguæe sprijeèiti 'chain'

source: %s may only be used in begin/end transaction blocks
hr: %s mo¾e biti kori¹ten samo unutar transakcijskog bloka

source: BEGIN: already a transaction in progress
hr: BEGIN: transakcija je veæ u tijeku

source: COMMIT: no transaction in progress
hr: COMMIT: nema transakcije u tijeku

source: ROLLBACK: no transaction in progress
hr: ROLLBACK: nema transakcije u tijeku

source: xact_redo: unknown op code %u
hr: xact_redo: nepoznat op code %u

source: XactPushRollback: already installed
hr: XactPushRollback: veæ instaliran

source: XLogInsert: invalid info mask %02X
hr: XLogInsert: neispravna info maska %02X

source: XLogInsert: can backup %d blocks at most
hr: XLogInsert: moguæ backup najvi¹e %d blokova

source: XLogInsert: invalid record length %u
hr: XLogInsert: pogre¹na du¾ina sloga %u

source: XLogWrite: write request %X/%X is past end of log %X/%X
hr: XLogWrite: zahtjev za zapisivanje %X/%X je prema¹io kraj log-a %X/%X

source: close of log file %u, segment %u failed: %m
hr: zatvaranje log datoteke %u, segmenta %u nije uspjelo: %m

source: XLogWrite: time for a checkpoint, signaling postmaster
hr: XLogWrite: vrijeme za kontrolnu toèku, signaliziranje postmaster-u

source: lseek of log file %u, segment %u, offset %u failed: %m
hr: lseek log datoteke %u, segmenta %u, offset %u nije uspjelo: %m

source: write of log file %u, segment %u, offset %u failed: %m
hr: pisanje u log datoteku %u, segment %u, offset %u nije uspjelo: %m

source: XLogFlush%s%s: request %X/%X; write %X/%X; flush %X/%X
hr: XLogFlush%s%s: zahtjev %X/%X; pisanje %X/%X; pra¾njenje %X/%X

source: XLogFlush: request %X/%X is not satisfied --- flushed only to %X/%X
hr: XLogFlush: zahtjev %X/%X nije ispunjen --- ispra¾njeno samo do %X/%X

source: open of %s (log file %u, segment %u) failed: %m
hr: otvaranje %s (log datoteke %u, segment %u) nije uspjelo: %m

source: ZeroFill failed to write %s: %m
hr: ZeroFill nije uspio slog %s: %m

source: fsync of file %s failed: %m
hr: fsync datoteke %s nije uspio: %m

source: link from %s to %s (initialization of log file %u, segment %u) failed: %m
hr: veza od %s do %s (inicijalizacija log datoteke %u, segmentu %u) nije uspio: %m

source: rename from %s to %s (initialization of log file %u, segment %u) failed: %m
hr: preimenovanje od %s do %s (inicijalizacija log datoteke %u, segment %u) nije uspjelo: %m

source: could not open transaction log directory (%s): %m
hr: nemoguæe otvoriti transaction log direktorij (%s): %m

source: archiving transaction log file %s
hr: arhiviranje transaction log datoteke %s

source: archiving log files is not implemented!
hr: arhiviranje log datoteka nije implementirano!

source: recycled transaction log file %s
hr: reciklirana transaction log datoteka %s

source: removing transaction log file %s
hr: obrisana transaction log datoteka %s

source: could not read transaction log directory (%s): %m
hr: nemoguæe èitanje transaction log direktorija (%s): %m
