Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: ReadRecord: bad resource manager data checksum in record at %X/%X
hr: ReadRecord: pogre¹an kontrolni zbroj resource manager-a za slog %X/%X

source: ReadRecord: bad checksum of backup block %d in record at %X/%X
hr: ReadRecord: pogre¹an kontrolni zbroj backup block-a %d za slog %X/%X

source: ReadRecord: invalid record offset at %X/%X
hr: ReadRecord: pogre¹an offset sloga na %X/%X

source: ReadRecord: lseek of log file %u, segment %u, offset %u failed: %m
hr: ReadRecord: lseek log datoteke %u, segment %u, offset %u nije uspio: %m

source: ReadRecord: read of log file %u, segment %u, offset %u failed: %m
hr: ReadRecord: èitanje log datoteke %u, segment %u, offset %u nije uspjelo: %m

source: ReadRecord: contrecord is requested by %X/%X
hr: ReadRecord: contrecord je zatra¾en od %X/%X

source: ReadRecord: record with zero length at %X/%X
hr: ReadRecord: slog s nultom duljinom na %X/%X

source: ReadRecord: record length %u at %X/%X too long
hr: ReadRecord: du¾ina sloga %u na %X/%X je prevelika

source: ReadRecord: invalid resource manager id %u at %X/%X
hr: ReadRecord: pogre¹an resource manager id %u na %X/%X

source: ReadRecord: there is no ContRecord flag in log file %u, segment %u, offset %u
hr: ReadRecord: ne postoji ContRecord zastavica u log datoteci %u, segment %u, offset %u

source: ReadRecord: invalid ContRecord length %u in log file %u, segment %u, offset %u
hr: ReadRecord: pogre¹na ContRecord duljina %u u log datoteci %u, segment %u, offset %u

source: ReadRecord: invalid magic number %04X in log file %u, segment %u, offset %u
hr: ReadRecord: pogre¹an "magic number" %04X u log datoteci %u, segment %u, offset %u

source: ReadRecord: invalid info bits %04X in log file %u, segment %u, offset %u
hr: ReadRecord: pogre¹an info bits %04X u log datoteci %u, segment %u, offset %u

source: ReadRecord: unexpected pageaddr %X/%X in log file %u, segment %u, offset %u
hr: ReadRecord: neoèekivana pageaddr %X/%X u log datoteci %u, segment %u, offset %u

source: ReadRecord: out-of-sequence SUI %u (after %u) in log file %u, segment %u, offset %u
hr: ReadRecord: SUI %u (po %u) u log datoteci %u, segment %u, offset %u je izvan sekvence

source: invalid LC_COLLATE setting
hr: pogre¹na LC_COLLATE postavka

source: invalid LC_CTYPE setting
hr: pogre¹na LC_CTYPE postavka

source: sizeof(ControlFileData) is larger than BLCKSZ; fix either one
hr: sizeof(ControlFileData) je veæi nego BLCKSZ; ispraviti jednu od njih

source: WriteControlFile: could not create control file (%s): %m
hr: WriteControlFile: nemoguæe kreiranje kontrole datoteke (%s): %m

source: WriteControlFile: write to control file failed: %m
hr: WriteControlFile: nemoguæe zapisivanje u kontrolu datoteku: %m

source: WriteControlFile: fsync of control file failed: %m
hr: WriteControlFile: fsync kontrolne datoteke nije uspio: %m

source: could not open control file (%s): %m
hr: nemoguæe otvoriti kontrolu datoteku (%s): %m

source: read from control file failed: %m
hr: èitanje iz kontrolne datoteke nije uspjelo: %m

source: The database cluster was initialized with PG_CONTROL_VERSION %d, but the server was compiled with PG_CONTROL_VERSION %d. It looks like you need to initdb.
hr: Database cluster je inicijaliziran sa PG_CONTROL_VERSION %d, ali server je bio kompajliran s PG_CONTROL_VERSION %d. Izgleda da trebate initdb.

source: invalid checksum in control file
hr: pogre¹an kontrolni zbroj u kontrolnoj datoteci

source: The database cluster was initialized with CATALOG_VERSION_NO %d, but the backend was compiled with CATALOG_VERSION_NO %d. It looks like you need to initdb.
hr: Database cluster je bio inicijaliziran sa CATALOG_VERSION_NO %d, ali server je kompajliran s CATALOG_VERSION_NO %d. Izgleda da trebate initdb.

source: The database cluster was initialized with BLCKSZ %d, but the backend was compiled with BLCKSZ %d. It looks like you need to initdb.
hr: Database cluster je bio inicijaliziran sa BLCKSZ %d, li server je kompajliran s BLCKSZ %d. Izgleda da trebate initdb.

source: The database cluster was initialized with RELSEG_SIZE %d, but the backend was compiled with RELSEG_SIZE %d. It looks like you need to recompile or initdb.
hr: 'Database cluster' je bio inicijaliziran sa RELSEG_SIZE %d, ali server je kompajliran s RELSEG_SIZE %d. Izgleda da trebate ponovno kompajlirati ili upotrijebiti initdb.

source: The database cluster was initialized with NAMEDATALEN %d, but the backend was compiled with NAMEDATALEN %d. It looks like you need to recompile or initdb.
hr: Database cluster je bio inicijaliziran sa NAMEDATALEN %d, tali server je kompajliran s NAMEDATALEN %d. Izgleda da trebate ponovno kompajlirati ili upotrijebiti initdb.

source: The database cluster was initialized with FUNC_MAX_ARGS %d, but the backend was compiled with FUNC_MAX_ARGS %d. It looks like you need to recompile or initdb.
hr: Database cluster je bio inicijaliziran sa FUNC_MAX_ARGS %d, tali server je kompajliran FUNC_MAX_ARGS %d. Izgleda da trebate ponovno kompajlirati ili upotrijebiti initdb.

source: The database cluster was initialized without HAVE_INT64_TIMESTAMP but the backend was compiled with HAVE_INT64_TIMESTAMP. It looks like you need to recompile or initdb.
hr: Database cluster je bio inicijaliziran bez HAVE_INT64_TIMESTAMP, ali server je kompajliran sa HAVE_INT64_TIMESTAMP. Izgleda da trebate ponovno kompajlirati ili upotrijebiti initdb.

source: The database cluster was initialized with HAVE_INT64_TIMESTAMP but the backend was compiled without HAVE_INT64_TIMESTAMP. It looks like you need to recompile or initdb.
hr: Database cluster je bio inicijaliziran sa HAVE_INT64_TIMESTAMP ali server je kompajliran bez HAVE_INT64_TIMESTAMP. Izgleda da trebate ponovno kompajlirati ili upotrijebiti initdb.

source: The database cluster was initialized with LOCALE_NAME_BUFLEN %d, but the backend was compiled with LOCALE_NAME_BUFLEN %d. It looks like you need to initdb.
hr: Database cluster je bio inicijaliziran sa LOCALE_NAME_BUFLEN %d, tali server je kompajliran sa LOCALE_NAME_BUFLEN %d. Izgleda da trebate ponovno kompajlirati ili upotrijebiti initdb.

source: The database cluster was initialized with LC_COLLATE '%s', which is not recognized by setlocale(). It looks like you need to initdb.
hr: Database cluster je bio inicijaliziran sa s LC_COLLATE '%s', koji nije prepoznat od strane setlocale(). Izgleda da trebate initdb.

source: The database cluster was initialized with LC_CTYPE '%s', which is not recognized by setlocale(). It looks like you need to initdb.
hr: Database cluster je bio inicijaliziran sa s LC_CTYPE '%s', koji nije prepoznat od strane setlocale(). Izgleda da trebate initdb.

source: write to control file failed: %m
hr: zapisivanje u kontrolnu datoteku nije uspio: %m

source: fsync of control file failed: %m
hr: fsync kontrolne datoteke nije uspio: %m

source: BootStrapXLOG failed to write log file: %m
hr: BootStrapXLOG nije uspio zapisatu u log datoteku: %m

source: BootStrapXLOG failed to fsync log file: %m
hr: BootStrapXLOG nije uspio fsync log datoteke: %m

source: control file context is broken
hr: kontekst kontrolne datoteke je naru¹en

source: database system was shut down at %s
hr: rad baza podataka je bio zaustavljen u %s

source: database system shutdown was interrupted at %s
hr: rad baze podataka je bio nestandardno prekinut u %s

source: database system was interrupted being in recovery at %s This probably means that some data blocks are corrupted and you will have to use the last backup for recovery.
hr: rad baze podataka je bio nestandardno prekinut u tijeku obnavljanja u %s To vjerovatno znaèi da su neki blokovi podataka koruptirani i trebali bi iskoristiti zadnju kopiju za obnavljanje.

source: database system was interrupted at %s
hr: rad baze podataka je bio nestandardno prekinut u %s

source: checkpoint record is at %X/%X
hr: checkpoint slog je %X/%X

source: using previous checkpoint record at %X/%X
hr: kori¹tenje prethodnog checkpoint-a sloga na %X/%X

source: unable to locate a valid checkpoint record
hr: nemoguæe locirati ispravan checkpoint slog

source: redo record is at %X/%X; undo record is at %X/%X; shutdown %s
hr: redo slog je na %X/%X; undo slog je na %X/%X; kraj rada %s

source: next transaction id: %u; next oid: %u
hr: sljedeæi id transakcije: %u; sljedeæi oid: %u

source: invalid next transaction id
hr: pogre¹an sljedeæi id transakcije

source: invalid redo in checkpoint record
hr: pogre¹an redo u checkpoint slogu

source: invalid redo/undo record in shutdown checkpoint
hr: pogre¹an redo/undo slog u shutdown checkpoint-u

source: database system was not properly shut down; automatic recovery in progress
hr: rad baze podataka nije bio ispravno prekinut; automatsko oporavljanje u tijeku

source: redo starts at %X/%X
hr: redo zapoèinje na %X/%X

source: redo done at %X/%X
hr: redo zavr¹ava na %X/%X

source: redo is not required
hr: redo nije tra¾en

source: undo starts at %X/%X
hr: undo poèinje na %X/%X

source: undo done at %X/%X
hr: undo zavr¹ava na %X/%X

source: undo is not required
hr: undo nije tra¾en

source: database system is ready
hr: baza podataka je spremna

source: shutting down
hr: zaustavljanje rada

source: database system is shut down
hr: rad baze podataka je zaustavljen

source: CreateCheckPoint: cannot be called inside transaction block
hr: CreateCheckPoint: ne mo¾e biti pozvan unutar 'transaction' bloka

source: active transaction while database system is shutting down
hr: aktivne transakcije za vrijeme zaustavljanja rada baze podataka

source: concurrent transaction log activity while database system is shutting down
hr: konkurentna aktivnost transaction log-a za vrijeme zaustavljanja rada baze podataka

source: fsync of log file %u, segment %u failed: %m
hr: fsync log datoteke %u, segment %u nije uspjelo: %m

source: fdatasync of log file %u, segment %u failed: %m
hr: fdatasync log datoteke %u, segment %u nije uspjelo: %m

source: bogus wal_sync_method %d
hr: neispravan wal_sync_method %d

source: _xl_remove_hash_entry: file was not found in cache
hr: _xl_remove_hash_entry: datoteka nije naðena u cache-u

source: XLogOpenRelation: out of memory for cache
hr: XLogOpenRelation: nedostatek memorije za cache-a

source: XLogOpenRelation: file found on insert into cache
hr: XLogOpenRelation: datoteka naðena prilikom insertiranja u cache

source: Usage: postgres -boot [-d level] [-D datadir] [-F] [-o file] [-x num] dbname -d 1-5 debug mode -D datadir data directory -F turn off fsync -o file send debug output to file -x num internal use
hr: Kori¹tenje: postgres -boot [-d nivo] [-D direktorij] [-F] [-o datoteka] [-x broj] ime_baze -d 1-5 debug mod -D direktorij direktorij za podatke -F iskljuèi fsync -o datoteka slanje debug poruka u datoteku -x broj interna upotreba

source: %s does not know where to find the database system data. You must specify the directory that contains the database system either by specifying the -D invocation option or by setting the PGDATA environment variable.
hr: %s ne zna gdje da pronaðe datoteke baze podataka. Morate specificirati direktorij koji sadr¾i ove datoteke, ili specificirajuæi direktorij pomoæu -D opcije ili setirajuæi PGDATA 'environment' varijablu.

source: Unsupported XLOG op %d
hr: Nepodr¾an XLOG op %d

source: open relation %s, attrsize %d
hr: otvorena relacija %s, attrsize %d

source: create attribute %d name %s len %d num %d type %u
hr: kreiranje atributa %d naziv %s du¾ina %d broj %d tip %u

source: closerel: close of '%s' when '%s' was expected
hr: closerel: bli¾e od '%s' kada je '%s' oèekivan

source: closerel: close of '%s' before any relation was opened
hr: closerel: bli¾e od '%s' prije nego je ijedna relacija otvorena

source: no open relation to close
hr: nema otvorenih relacija za zatvaranje

source: close relation %s
hr: zatvaranje relacije %s

source: column %s %s
hr: kolona %s %s

source: inserting row oid %u, %d columns
hr: insertiranje retka oid %u, %d kolona

source: row inserted
hr: redak insertiran

source: inserting column %d value '%s'
hr: insertiranje kolone %d vrijednost '%s'

source: unable to find atttypid %u in Typ list
hr: nemoguæe pronaæi 'atttypid' %u u 'Typ' listi

source: type oid %u not found
hr: oid %u za tip nije naðen

source: inserted
hr: insertiran

source: inserting column %d NULL
hr: insertiranje kolone %d NULL

source: Memory manager fault: cleanup called twice.
hr: Gre¹ka memorijskom menad¾era : èi¹æenje pozvano dvaput

source: external type: %s
hr: externi tip: %s

source: Error: unknown type '%s'.
hr: Gre¹ka: nepoznat tip '%s'.

source: AllocateAttribute: malloc failed
hr: AllocateAttribute: malloc nije uspio

source: There are too many string constants and identifiers for the compiler to handle.
hr: Previ¹e string konstanti i identifikatora za kompajler.

source: start transaction
hr: start transakcije

source: commit transaction
hr: commit transakcije

source: creating%s%s relation %s...
hr: kreiranje%s%s relacije %s...

source: create bootstrap: warning, open relation exists, closing first
hr: kreiranje bootstrap: upozorenje, otvorena relacija postoji, prvo zatvaranje

source: bootstrap relation created
hr: bootstrap relacija kreirana

source: relation created with oid %u
hr: relacija kreirana sa oid %u

source: inserting row with oid %u...
hr: insertiranje retka sa oid %u...

source: inserting row...
hr: insertiranje retka...

source: incorrect number of columns in row (expected %d, got %d)
hr: neispravan broj kolona u retku (oèekivano %d, je %d)

source: relation not open
hr: relacija nije otvorena

source: too many columns
hr: previ¹e kolona

source: syntax error at line %d: unexpected character %s
hr: sintaksna gre¹ka u liniji %d: neoèekivani znak %s

source: syntax error at line %d: unexpected token %s
hr: sintaksna gre¹ka u liniji %d: neoèekivani symbol %s

source: relation %u not found
hr: relatcija %u nije naðena

source: "%s" is an index
hr: "%s" je index

source: database "%s" not found
hr: baza podataka "%s" nije naðena

source: permission denied
hr: zabranjen pristup

source: function %u not found
hr: funkcija %u nije naðena

source: language "%s" not found
hr: jezik "%s" nije naðen

source: language "%s" is not trusted
hr: jezik "%s" nije od povjerenja(trusted)

source: invalid privilege type %s for namespace object
hr: pogre¹an tip privilegije %s za 'namespace' objekt

source: namespace "%s" not found
hr: namespace "%s" nije naðen

source: privilege_to_string: unrecognized privilege %d
hr: privilege_to_string: nepoznata privilegija %d

source: non-existent group "%s"
hr: nepostojeæa skupina "%s"

source: in_group: group %u not found
hr: in_group: grupa %u nije naðena

source: aclcheck: null ACL, returning OK
hr: aclcheck: null ACL, vraæam OK

source: aclcheck: zero-length ACL, returning OK
hr: aclcheck: nulta du¾ina ACL, vraæen OK

source: aclcheck: first entry in ACL is not 'world' entry
hr: aclcheck: prvi slog u ACL nije 'world' slog

source: aclcheck: using world=%d
hr: aclcheck: koristeæi world=%d

source: aclcheck: found user %u/%d
hr: aclcheck: naðen korisnik %u/%d

source: aclcheck: found group %u/%d
hr: aclcheck: naðena grupa %u/%d

source: aclcheck: bogus ACL id type: %d
hr: aclcheck: pogre¹an ACL id typ: %d

source: %s: permission denied
hr: %s: zabranjen pristup

source: pg_class_aclcheck: invalid user id %u
hr: pg_class_aclcheck: pogre¹an id korisnika %u

source: pg_class_aclcheck: relation %u not found
hr: pg_class_aclcheck: relacija %u nije naðena

source: pg_class_aclcheck: catalog update: permission denied
hr: pg_class_aclcheck: a¾uriranje kataloga: zabranjen pristup

source: pg_class_aclcheck: %u is superuser
hr: pg_class_aclcheck: %u je 'superuser'

source: pg_database_aclcheck: database %u not found
hr: pg_database_aclcheck: baza podataka %u nije naðena

source: pg_proc_aclcheck: function %u not found
hr: pg_proc_aclcheck: funkcija %u nije naðena

source: pg_language_aclcheck: language %u not found
hr: pg_language_aclcheck: jezik %u nije naðen

source: pg_namespace_aclcheck: namespace %u not found
hr: pg_namespace_aclcheck: 'namespace' %u nije naðen

source: pg_class_ownercheck: relation %u not found
hr: pg_class_ownercheck: relacija %u nije naðena

source: pg_type_ownercheck: type %u not found
hr: pg_type_ownercheck: tip %u nije naðen

source: pg_oper_ownercheck: operator %u not found
hr: pg_oper_ownercheck: operator %u nije naðen

source: pg_proc_ownercheck: function %u not found
hr: pg_proc_ownercheck: funkcija %u nije naðena

source: pg_namespace_ownercheck: namespace %u not found
hr: pg_namespace_ownercheck: 'namespace' %u nije naðen

source: pg_opclass_ownercheck: operator class %u not found
hr: pg_opclass_ownercheck: klasa operatora %u nije naðena

source: Cannot drop %s because other objects depend on it Use DROP ... CASCADE to drop the dependent objects too
hr: Nemoguæe brisanje %s jer drugi objekti ovise o njemu Koristite DROP ... CASCADE da biste obrisali i sve objekte koje ovise o ovom

source: doDeletion: Unsupported object class %u
hr: doDeletion: nepodr¾ana klasa objekta %u

source: find_expr_references_walker: bogus varattno %d
hr: find_expr_references_walker: pogre¹an 'varattno' %d

source: getObjectDescription: Cast %u does not exist
hr: getObjectDescription: Konverzija(cast) %u ne postoji

source: getObjectDescription: Constraint %u does not exist
hr: getObjectDescription: Constraint %u ne postoji

source: getObjectDescription: Conversion %u does not exist
hr: getObjectDescription: Konverzija %u ne postoji

source: getObjectDescription: Default %u does not exist
hr: getObjectDescription: inicijalna vrijednost %u ne postoji

source: getObjectDescription: Language %u does not exist
hr: getObjectDescription: Jezik %u ne postoji

source: cache lookup of opclass %u failed
hr: nije uspjelo tra¾enje 'opclass' %u u cache-u

source: syscache lookup for AM %u failed
hr: tra¾enje AM tipa %u u syscache-u nije uspjelo

source: getObjectDescription: Rule %u does not exist
hr: getObjectDescription: Pravilo(ruke) %u ne postoji

source: getObjectDescription: Trigger %u does not exist
hr: getObjectDescription: Trigger %u ne postoji

source: getObjectDescription: Schema %u does not exist
hr: getObjectDescription: ©ema(scheme) %u ne postoji

source: cache lookup of relation %u failed
hr: nije uspjelo tra¾enje relacije %u u 'cache'-u

source: SystemAttributeDefinition: invalid attribute number %d
hr: SystemAttributeDefinition: pogre¹an broj atributu %d

source: name of column "%s" conflicts with an existing system column
hr: ime kolone "%s" je u konfliktu s postojeæom sistemskom kolonom

source: column name "%s" is duplicated
hr: ime kolone "%s" je dupliciran

source: Attribute "%s" has an unknown type Proceeding with relation creation anyway
hr: Atribut '%s' je nepoznatog tipa Ipak nastavljam sa kreiranjem relacije

source: Attribute "%s" has composite type %s
hr: Atribut "%s" je kompozitnog tipa %s

source: Number of columns is out of range (1 to %d)
hr: Broj kolona je izvan opsega (1 do %d)

source: Relation '%s' already exists
hr: Relacija '%s' veæ postoji

source: DeleteRelationTuple: cache lookup failed for relation %u
hr: DeleteRelationTuple: nije uspjelo tra¾enje relacije %u u cache-u

source: RemoveAttributeById: Failed to find attribute %d in relation %u
hr: RemoveAttributeById: Nije uspjelo pretra¾ivanje cache-a za atribut %d u tablici %u

source: RemoveAttrDefaultById: cache lookup failed for attrdef %u
hr: RemoveAttrDefaultById: nije uspjelo tra¾enje 'attrdef' %u u cache-u

source: RemoveAttrDefaultById: cache lookup failed for rel %u attr %d
hr: RemoveAttrDefaultById: nije uspjelo tra¾enje relacije %u i atribut %d u cache-u

source: heap_drop_with_catalog: FlushRelationBuffers returned %d
hr: heap_drop_with_catalog: FlushRelationBuffers je vratio %d

source: cache lookup of attribute %d in relation %u failed
hr: nije uspjelo pretra¾ivanje cache-a za atribut %d u tablici %u

source: constraint "%s" already exists for relation "%s"
hr: constraint "%s" je veæ definiran za relaciju "%s"

source: Duplicate CHECK constraint name: '%s'
hr: Dupliciran 'CHECK constraint' pod imenom: '%s'

source: Only relation "%s" can be referenced in CHECK constraint expression
hr: Samo relacija "%s" mo¾e biti referencirana u 'CHECK constraint' izrazu

source: cannot use subselect in CHECK constraint expression
hr: nedozvoljeno kori¹tenje 'subselect' izraza u 'CHECK constraint' izrazu

source: cannot use aggregate function in CHECK constraint expression
hr: nedozvoljeno kori¹tenje agregatne funkcije u 'CHECK constraint' izrazu

source: cannot use column references in DEFAULT clause
hr: nemoguæe kori¹tenje reference na kolonu u DEFAULT klauzuli

source: cannot use subselects in DEFAULT clause
hr: nemoguæe kori¹tenje 'subselect' izraza u DEFAULT klauzuli

source: cannot use aggregate functions in DEFAULT clause
hr: nemoguæe kori¹tenje agregatne funkcije u DEFAULT klauzuli

source: Column "%s" is of type %s but default expression is of type %s You will need to rewrite or cast the expression
hr: Kolona "%s" je tipa %s, ali implicitni izraz je tipa %s Morate izraz napisati drugaèije ili upotrijebiti 'cast'

source: Function %u does not exist
hr: Funkcija %u ne postoji

source: Opclass %u does not exist
hr: Opclass %u ne postoji

source: Type %u does not exist
hr: Tip %u ne postoji

source: cannot create index: column %d does not exist
hr: nemoguæe kreiranje indeksa: kolona %d ne postoji

source: must index at least one column
hr: mora biti indeksirana barem jedna kolona

source: User-defined indexes on system catalogs are not supported
hr: Korisnièki definirani indeksi nad sistemskim katalozima nizu podr¾ani

source: relation named "%s" already exists
hr: relacija sa imenom "%s" veæ postoji

source: index_create: constraint must be PRIMARY or UNIQUE
hr: index_create: 'constraint' mora biti PRIMARY ili UNIQUE

source: index_drop: cache lookup failed for index %u
hr: index_drop: nije uspjelo pretra¾ivanje cache-a za index %u

source: index_drop: FlushRelationBuffers returned %d
hr: index_drop: FlushRelationBuffers vratio %d

source: relation %s isn't an indexable relation
hr: relacija %s nije relacija koja se mo¾e indeksirati

source: setRelhasindex: cannot find relation %u in pg_class
hr: setRelhasindex: nemoguæe pronaæi relaciju %u u pg_class

source: setNewRelfilenode: cannot find relation %u in pg_class
hr: setNewRelfilenode: nemoguæe pronaæi relaciju %u u pg_class

source: UpdateStats: cannot find relation %u in pg_class
hr: UpdateStats: nemoguæe pronaæi relaciju %u u pg_class

source: IndexBuildHeapScan: concurrent insert in progress
hr: IndexBuildHeapScan: konkurentan 'insert' u tijeku

source: IndexBuildHeapScan: concurrent delete in progress
hr: IndexBuildHeapScan: konkurentan 'delete' u tijeku

source: Unexpected HeapTupleSatisfiesVacuum result
hr: Neoèekivan rezultat HeapTupleSatisfiesVacuum

source: IndexGetRelation: can't find index id %u
hr: IndexGetRelation: nemoguæe pronaæi index id %u

source: reindex_index: can't open index relation
hr: reindex_index: nemoguæe otvoriti indeksnu relaciju

source: reindex_index: can't open heap relation
hr: reindex_index: nemoguæe otvoriti 'heap' relaciju

source: the target relation %u is shared
hr: ciljna relacija %u je podijeljena(shared)

source: the target relation %u is nailed
hr: ciljna relacija %u je naðena

source: Relation "%s"."%s" does not exist
hr: Relacija "%s"."%s" ne postoji

source: TEMP tables may not specify a namespace
hr: TEMP tablele ne mogu specificirati 'namespace'

source: Namespace "%s" does not exist
hr: Namespace "%s" ne postoji

source: No namespace has been selected to create in
hr: Niti jedan 'namespace' nije selektiran za kreiranje

source: Cache lookup failed for relation %u
hr: Tra¾enje relacije %u u cache-u nije uspjelo

source: Cache lookup failed for type %u
hr: Tra¾enje tipa %u u cache-u nije uspjelo
