Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: aclitemout: bad idtype: %d
hr: aclitemout: pogre¹an 'idtype': %d

source: acldefault: bogus objtype %d
hr: acldefault: pogre¹an 'objtype' %d

source: function "%s" does not exist
hr: funkcija "%s" ne postoji

source: schema "%s" does not exist
hr: ©ema "%s" ne postoji

source: Bad boolean external representation '%s'
hr: Pogre¹na eksterna 'boolean' prezentacija %s

source: Bad money external representation %s
hr: Pogre¹na eksterna 'money' prezentacija %s

source: Bad date external representation (too long) '%s'
hr: Pogre¹na eksterna 'date' prezentacija (predugaèko) '%s'

source: Bad date external representation '%s'
hr: Pogre¹na eksterna 'date' prezentacija %s

source: Date CURRENT no longer supported date_in() internal coding error
hr: Date CURRENT vi¹e nije podr¾an date_in() internal coding error

source: Unrecognized date external representation '%s'
hr: Nepoznata eksterna 'date' prezentacija %s

source: Unable to convert timestamp to date
hr: Nemoguæe konvertiranje 'timestamp' u 'date' tip

source: Unable to convert reserved abstime value to date
hr: Nemoguæe konvertiranje 'reserverd abstime value' u 'date' tip

source: Bad date external representation (too long)
hr: Pogre¹na eksterna 'date' prezentacija (predugaèko)

source: Bad time external representation (too long) '%s'
hr: Pogre¹na eksterna 'time' prezentacija (predugaèko) '%s'

source: Bad time external representation '%s'
hr: Pogre¹na eksterna 'time' prezentacija %s

source: Unable to convert timestamp to time
hr: Neuspjela konverzija 'timestamp' u 'time' tip

source: Unable to convert timestamptz to time
hr: Neuspjela konverzija 'timestamptz' u 'time' tip

source: Bad time external representation (too long)
hr: Pogre¹na eksterna 'time' prezentacija (predugaèko)

source: TIME units '%s' not recognized
hr: TIME jedinice '%s' nisu poznate

source: TIME units '%s' not supported
hr: TIME jedinice '%s' nisu podr¾ane

source: Bad time with time zone external representation (too long) '%s'
hr: Pogre¹na eksterna 'time with time zone' prezentacija (predugaèko) '%s'

source: Unable to convert timestamptz to timetz
hr: Neuspjela konverzija 'timestamptz' u 'timetz' tip

source: Bad timetz external representation (too long)
hr: Pogre¹na eksterna 'timetz' prezentacija (predugaèko)

source: TIMETZ units '%s' not recognized
hr: TIMETZ jedinice '%s' nisu poznate

source: TIMETZ units '%s' not supported
hr: TIMETZ jedinice '%s' nisu podr¾ane

source: Time zone '%s' not recognized
hr: 'Time zone' '%s' nije poznat

source: INTERVAL time zone '%s' not legal (month specified)
hr: 'INTERVAL time zone' '%s' nije ispravan (mjesec specificiran)

source: 'CURRENT' is no longer supported
hr: 'CURRENT' nije vi¹e podr¾an

source: Inconsistent use of year %04d and 'BC'
hr: Nekonzistentno kori¹tenje godine %04d i 'BC'

source: No such encoding as '%s'
hr: Takav 'encoding' ne postoji '%s'

source: Bad float4 input format -- overflow
hr: Pogre¹an 'float4' ulazni format -- overflow

source: Bad float4 input format -- underflow
hr: Pogre¹an 'float4' ulazni format -- underflow

source: Bad float8 input format -- overflow
hr: Pogre¹an 'float8' ulazni format -- overflow

source: Bad float8 input format -- underflow
hr: Pogre¹an 'float8' ulazni format -- underflow

source: Bad float4 input format '%s'
hr: Pogre¹an 'float4' ulazni format '%s'

source: Input '%s' is out of range for float4
hr: Ulaz '%s' je van opsega za float4

source: Bad float8 input format '%s'
hr: Pogre¹an 'float8' ulazni format '%s'

source: Input '%s' is out of range for float8
hr: Ulaz '%s' je van opsega za float8

source: can't take log of zero
hr: operacija log nije dozvoljena sa 0

source: can't take log of a negative number
hr: operacija log nije dozvoljena sa negativnim brojevima

source: acos(%f) input is out of range
hr: acos(%f) ulaz van opsega

source: asin(%f) input is out of range
hr: asin(%f) ulaz van dosega

source: atan(%f) input is out of range
hr: atan(%f) ulaz van dosega

source: atan2(%f,%f) input is out of range
hr: atan2(%f,%f) ulaz van dosega

source: cos(%f) input is out of range
hr: cos(%f) ulaz van dosega

source: cot(%f) input is out of range
hr: cot(%f) ulaz van dosega

source: sin(%f) input is out of range
hr: sin(%f) ulaz van dosega

source: tan(%f) input is out of range
hr: tan(%f) ulaz van dosega

source: %s: expected 3-element float8 array
hr: %s: oèekivan 'float8 array' sa 3 elementa

source: could not locate data type with oid %u in catalog
hr: tip podatka %u nije naðen u sistemskom katalogu

source: Invalid INTERVAL typmod 0x%x
hr: Pogre¹an interval typmod 0x%x

source: too many points requested
hr: previ¹e toèaka zahtijevano

source: Unable to convert polygon to circle
hr: Neuspjela konverzija 'polygon' u 'circle' tip

source: int8 conversion to OID is out of range
hr: int8 konverzija u OID je van opsega

source: ESCAPE string must be empty or one character
hr: ESCAPE string mora biti prazan ili samo jedan karakter

source: macaddr_in: error in parsing "%s"
hr: macaddr_in: gre¹ka u parsanju "%s"

source: Invalid timezone '%s'
hr: Pogre¹na vremenska zona '%s'

source: Bad abstime external representation (too long) '%s'
hr: Pogre¹na eksterna 'abstime' prezentacija (predugaèko) '%s'

source: Bad abstime external representation '%s'
hr: Pogre¹na 'abstime' eksterna prezentacija '%s'

source: Bad abstime (internal coding error) '%s'
hr: Pogre¹na 'abstime' (internal coding error) '%s'

source: Unable to convert timestamp to abstime
hr: Neuspjela konverzija 'timestamp' u 'abstime' tip

source: Unable to convert abstime 'invalid' to timestamp
hr: Neuspjela konverzija 'abstime invalid' u 'timestamp' tip

source: Unable to convert ABSTIME to TIMESTAMP abstime_timestamp() internal error
hr: Neuspje¹na konverzija ABSTIME u TIMESTAMP abstime_timestamp() gre¹ka u internom kodu

source: Unable to convert abstime 'invalid' to timestamptz
hr: Neuspjela konverzija 'abstime invalid' u 'timestamptz' tip

source: Unable to convert ABSTIME to TIMESTAMP WITH TIME ZONE abstime_timestamptz() internal error
hr: Neuspjela konverzija ABSTIME u TIMESTAMP WITH TIME ZONE abstime_timestamptz() gre¹ka u internom kodu

source: Bad reltime external representation (too long) '%s'
hr: Pogre¹na eksterna 'reltime' prezentacija (predugaèko) '%s'

source: Bad reltime external representation '%s'
hr: Pogre¹na 'reltime' eksterna prezentacija '%s'

source: Bad reltime (internal coding error) '%s'
hr: Pogre¹an 'reltime) (internal coding error) '%s'

source: Unable to decode tinterval '%s'
hr: Nemoguæe dekodiranje 'tinterval'-a '%s'

source: Unable to convert reltime 'invalid' to interval
hr: Nemoguæe konvertiranje 'reltime invalid' u 'interval' tip

source: pg_atoi: zero-length string
hr: pg_atoi: string nulte du¾ine

source: %s: error reading "%s": %m
hr: %s: gre¹ka u èitanju "%s": %m

source: %s: error in "%s": can't parse "%s"
hr: %s: gre¹ka u "%s": nemoguæe parsanje "%s"

source: %s: error reading "%s": %s
hr: %s: gre¹ka u èitanju "%s": %s

source: oidvector value has too many values
hr: oidvector vrijednost ima previ¹e vrijednosti

source: Requested length too large
hr: Tra¾ena du¾ina prevelika

source: Requested buffer is too large.
hr: Tra¾eni 'buffer' prevelik

source: Invalid LC_COLLATE setting
hr: Pogre¹na LC_COLLATE postavka

source: Cannot accept a constant of type %s
hr: Nemoguæe prihvatiti konstantu tipa '%s'

source: Cannot display a value of type %s
hr: Nemoguæe prikazati konstantu tipa '%s'

source: Invalid regular expression: %s
hr: Pogre¹an 'regular expression': %s

source: No procedure with name %s
hr: Ne postoji procedura sa imenom %s

source: There is more than one procedure named %s
hr: Postoji vi¹e nego jedna procedura sa imenom %s.

source: No operator with name %s
hr: Ne postoji operator sa imenom %s

source: There is more than one operator named %s
hr: Postoji vi¹e nego jedan operator sa imenom %s

source: regoperatorin: use NONE to denote the missing argument of a unary operator
hr: regoperatorin: koristite NONE da oznaèite nepostojeæi argument za unarni operator

source: regoperatorin: provide two argument types for operator
hr: regoperatorin: osigurajte dva argumenta za operator

source: No class with name %s
hr: Ne postoji klasa sa imenom %s

source: No type with name %s
hr: Ne postoji tip sa imenom %s

source: %s: invalid name syntax
hr: %s: pogre¹na sintaksa imena

source: %s: expected a left parenthesis
hr: %s: oèekivana lijeva zagrada

source: %s: expected a right parenthesis
hr: %s: oèekivana desna zagrada

source: %s: expected a type name
hr: %s: oèekivano ime tipa

source: %s: improper type name
hr: %s: pogre¹no ime tipa

source: %s: too many argument datatypes
hr: %s: previ¹e 'argument datatypes'

source: RI_FKey_check() not fired by trigger manager
hr: RI_FKey_check() nije pokrenut od strane 'trigger manager'-a

source: RI_FKey_check() must be fired AFTER ROW
hr: RI_FKey_check() mora biti pokrenut AFTER ROW

source: RI_FKey_check() must be fired for INSERT or UPDATE
hr: RI_FKey_check() mora biti pokrenut za INSERT ili UPDATE

source: wrong # of arguments in call to RI_FKey_check()
hr: pogre¹an broj argumenata u pozivu RI_FKey_check()

source: too many keys (%d max) in call to RI_FKey_check()
hr: previ¹e kjuèeva (%d max) u pozivu RI_FKey_check()

source: %s referential integrity violation - no rows found in %s
hr: %s povreda referencijalnog integriteta - nema naðenih redaka u %s

source: MATCH PARTIAL not yet supported
hr: MATCH PARTIAL jo¹ nije podr¾an

source: %s referential integrity violation - MATCH FULL doesn't allow mixing of NULL and NON-NULL key values
hr: %s povreda referencijalnog integriteta - MATCH FULL de dozvoljava mije¹anje NULL i NON-NULL vrijednosti kjuèeva

source: MATCH PARTIAL not yet implemented
hr: MATCH PARTIAL jo¹ nije implementiran

source: %s referential integrity violation - key referenced from %s not found in %s
hr: %s povreda referencijalnog integriteta - kljuè referenciran od %s nije naðen u %s

source: %s referential integrity violation - key in %s still referenced from %s
hr: %s povreda referencijalnog integriteta - kljuè u %s je jo¹ uvijek referenciran od strane %s

source: internal error #9 in ri_triggers.c
hr: interna gre¹ka #9 u ri_triggers.c

source: RI_FKey_setdefault_del() not fired by trigger manager
hr: RI_FKey_setdefault_del() nije pokrenut od strane 'trigger' menad¾era

source: RI_FKey_setdefault_del() must be fired AFTER ROW
hr: RI_FKey_setdefault_del() mora biti pokrenut za AFTER ROW

source: RI_FKey_setdefault_del() must be fired for DELETE
hr: RI_FKey_setdefault_del() mora biti pokrenut za DELETE

source: wrong # of arguments in call to RI_FKey_setdefault_del()
hr: pogre¹an broj argumenata u pozivu 'RI_FKey_setdefault_del()'

source: too many keys (%d max) in call to RI_FKey_setdefault_del()
hr: previ¹e kljuèeva (%d max) u pozivu 'RI_FKey_setdefault_del()'

source: internal error #10 in ri_triggers.c
hr: interna gre¹ka #10 u ri_triggers.c

source: RI_FKey_setdefault_upd() not fired by trigger manager
hr: RI_FKey_setdefault_upd() nije pokrenut od strane 'trigger' menad¾era

source: RI_FKey_setdefault_upd() must be fired AFTER ROW
hr: RI_FKey_setdefault_upd() mora biti pokrenut za AFTER ROW

source: RI_FKey_setdefault_upd() must be fired for UPDATE
hr: RI_FKey_setdefault_upd() mora biti pokrenut za UPDATE

source: wrong # of arguments in call to RI_FKey_setdefault_upd()
hr: pogre¹an broj argumenata u pozivu 'RI_FKey_setdefault_upd()'

source: too many keys (%d max) in call to RI_FKey_setdefault_upd()
hr: previ¹e kljuèeva (%d max) u pozivu 'RI_FKey_setdefault_upd()'

source: internal error #11 in ri_triggers.c
hr: interna gre¹ka #11 u ri_triggers.c

source: wrong # of arguments in call to RI_FKey_keyequal_upd()
hr: pogre¹an broj argumenata u pozivu 'RI_FKey_keyequal_upd()'

source: too many keys (%d max) in call to RI_FKey_keyequal_upd()
hr: previ¹e kljuèeva (%d max) u pozivu 'RI_FKey_keyequal_upd()'

source: internal error #12 in ri_triggers.c
hr: interna gre¹ka #12 u ri_triggers.c

source: unrecognized referential integrity MATCH type '%s'
hr: nepoznat referencijalni integritet MATCH type '%s'

source: constraint %s: table %s does not have an attribute %s
hr: constraint %s: tablica %s nema atribut %s

source: out of memory for RI plan cache
hr: nedovoljno memorije za 'RI plan cache'

source: ri_AttributesEqual(): cannot find '=' operator for type %u
hr: ri_AttributesEqual(): nemoguæe pronaæi '=' operator za tip %u

source: out of memory for RI operator cache
hr: nedovoljno memorije za 'RI operator cache'

source: get_ruledef: cannot connect to SPI manager
hr: get_ruledef: nemoguæe konektiranje na 'SPI' menad¾er

source: SPI_prepare() failed for "%s"
hr: SPI_prepare() nije uspio za "%s"

source: failed to get pg_rewrite tuple for %u
hr: neuspje¹an 'pg_rewrite' sloga za %u

source: get_ruledef: SPI_finish() failed
hr: get_ruledef: SPI_finish() nije uspio

source: get_viewdef: cannot connect to SPI manager
hr: get_viewdef: nemoguæe konektiranje na 'SPI' menad¾er

source: failed to get pg_rewrite tuple for view %u
hr: neuspje¹an 'pg_rewrite' sloga za 'view' %u

source: get_viewdef: SPI_finish() failed
hr: get_viewdef: SPI_finish() nije uspio

source: syscache lookup for index %u failed
hr: tra¾enje indeksa %u u 'syscache'-u nijeuspjelo

source: syscache lookup for relid %u failed
hr: tra¾enje 'relid'-a %u u 'syscache'-u nijeuspjelo

source: Failed to find constraint with OID %u
hr: Nije uspjelo tra¾enje 'constarint'-a sa OID-om %u

source: pg_get_constraintdef: Null conkey for constraint %u
hr: pg_get_constraintdef: 'Null conkey' za 'constraint' %u

source: pg_get_constraintdef: Null confkey for constraint %u
hr: pg_get_constraintdef: 'Null confkey' za 'constraint' %u

source: pg_get_constraintdef: Unknown confmatchtype '%c' for constraint %u
hr: pg_get_constraintdef: Nepoznat 'confmatchtype' '%c' za 'constraint' %u

source: pg_get_constraintdef: Unknown confupdtype '%c' for constraint %u
hr: pg_get_constraintdef: Nepoznat 'confupdtype' '%c' za 'constraint' %u

source: pg_get_constraintdef: Unknown confdeltype '%c' for constraint %u
hr: pg_get_constraintdef: Nepoznat 'confdeltype' '%c' za 'constraint' %u

source: pg_get_constraintdef: unsupported constraint type '%c'
hr: pg_get_constraintdef: nepodr¾ani 'constraint' tip '%c'

source: get_ruledef: rule %s has unsupported event type %d
hr: get_ruledef: pravilo(rule) %s ima nepodr¾an tip dogaðaja(event) %d

source: get_query_def: unknown query command type %d
hr: get_query_def: nepoznat tip komande upita(query command) %d

source: get_setop_query: unexpected set op %d
hr: get_setop_query: neoèekivan 'set op' %d

source: get_setop_query: unexpected node %d
hr: get_setop_query: neoèekivan nod %d

source: get_insert_query_def: too many RTEs in INSERT!
hr: get_insert_query_def: previ¹e RTE-ova u INSERT-u!

source: get_utility_query_def: unexpected statement type
hr: get_utility_query_def: neoèekivan tip izraza

source: get_names_for_var: bogus varlevelsup %d
hr: get_names_for_var: pogre¹an 'varlevelsup' %d

source: get_names_for_var: bogus varno %d
hr: get_names_for_var: pogre¹an 'varno' %d

source: get_rule_expr: expr opType %d not supported
hr: get_rule_expr: izraz 'opType' %d nije podr¾an

source: Argument type %s of FieldSelect is not a tuple type
hr: Tip argumenta %s 'FieldSelect' izraza nije slog(tuple) tipa

source: get_rule_expr: unexpected nulltesttype %d
hr: get_rule_expr: neoèekivan nulltesttype %d

source: get_rule_expr: unexpected booltesttype %d
hr: get_rule_expr: neoèekivan 'booltesttype' %d

source: get_rule_expr: unknown node type %d
hr: get_rule_expr: nepoznat tip noda: %d

source: cache lookup for operator %u failed
hr: tra¾enje operatoera %u u 'cache'-u nije uspjelo

source: get_rule_expr: bogus oprkind
hr: get_rule_expr: pogre¹an 'oprkind'

source: get_sublink_expr: unsupported sublink type %d
hr: get_sublink_expr: nepodr¾an 'sublink' tip %d

source: unexpected rte kind %d
hr: neoèekivana 'rte' vrsta %d

source: get_from_clause_item: unknown join type %d
hr: get_from_clause_item: nepoznat 'join' tip %d

source: get_from_clause_item: unexpected node type %d
hr: get_from_clause_item: neoèekivan tip noda %d

source: cache lookup failed for opclass %u
hr: tra¾enje 'opclass'-a %u u 'cache'-u nije uspjelo

source: tleIsArrayAssign: I'm confused ...
hr: tleIsArrayAssign: Ja sam zbunjen ...

source: cache lookup of operator %u failed
hr: nije uspjelo tra¾enje operatora %u u 'cache'-u

source: unexpected oprkind %c for operator %u
hr: neoèekivan 'oprkind' %c za operator %u

source: patternsel: no = operator for type %u
hr: patternsel: nema operatora = za tip %u

source: booltestsel: unexpected booltesttype %d
hr: booltestsel: neoèekivan 'booltesttype' %d

source: nulltestsel: unexpected nulltesttype %d
hr: nulltestsel: neoèekivan 'nulltesttype' %d

source: convert_numeric_to_scalar: unsupported type %u
hr: convert_numeric_to_scalar: nepodr¾an tip %u

source: convert_string_datum: unsupported type %u
hr: convert_string_datum: nepodr¾an tip %u

source: convert_timevalue_to_scalar: unsupported type %u
hr: convert_timevalue_to_scalar: nepodr¾an tip %u

source: Cannot perform case insensitive matching on type BYTEA
hr: Nemoguæe izvesti pretra¾ivanje koje ne obaraæa pa¾nju na velika i mala slova za tip BYTEA

source: Regex matching not supported on type BYTEA
hr: Regex pretra¾ivanje nije podr¾ano za BYTEA tip

source: pattern_fixed_prefix: bogus ptype
hr: pattern_fixed_prefix: pogre¹an ptype

source: prefix_selectivity: no >= operator for type %u
hr: prefix_selectivity: nema operatora >= za tip %u

source: prefix_selectivity: no < operator for type %u
hr: prefix_selectivity: nema operatora < za tip %u

source: pattern_selectivity: bogus ptype
hr: pattern_selectivity: pogre¹an ptype

source: string_lessthan: unexpected datatype %u
hr: string_lessthan: neoèekivan tip podataka %u

source: SetDefine: unable to define set %s
hr: SetDefine: neuspje¹no definiranje seta %s

source: invalid tid format: '%s'
hr: pogre¹an 'tid' format: '%s'

source: tidin: invalid value.
hr: tidin: pogre¹na vrijednost.

source: ctid isn't of type TID
hr: ctid nije tipa TID

source: currtid can't handle views with no CTID
hr: currtid ne mo¾e obraditi 'view'-e bez CTID-a

source: the view has no rules
hr: ovaj 'view' nema postavljenih pravila(rules)

source: only one select rule is allowed in views
hr: samo jedan 'select rule' je dozvoljen za 'view'

source: currtid can't handle this view
hr: currtid ne mo¾e obraditi ovaj 'view'

source: Bad timestamp external representation (too long) '%s'
hr: Pogre¹na eksterna 'timestamp' prezentacija (predugaèko) '%s'

source: Bad timestamp external representation '%s'
hr: Pogre¹na eksterna 'timestamp' prezentacija '%s'

source: TIMESTAMP out of range '%s'
hr: TIMESTAMP van opsega '%s'

source: TIMESTAMP '%s' no longer supported
hr: TIMESTAMP '%s' vi¹e nije podr¾an

source: TIMESTAMP '%s' not parsed; internal coding error
hr: TIMESTAMP '%s' nije parsano; interna gre¹ka u kodu

source: Unable to format timestamp; internal coding error
hr: Neuspje¹no formatiranje 'timestamp' tipa; interna gre¹ka u kodu

source: TIMESTAMP(%d) precision must be between %d and %d
hr: TIMESTAMP(%d) preciznost mora biti izmeðu %d i %d

source: Bad timestamp with time zone external representation (too long) '%s'
hr: Pogre¹na eksterna 'timestamp' prezentacija (predugaèko) '%s'

source: TIMESTAMP WITH TIME ZONE out of range '%s'
hr: TIMESTAMP WITH TIME ZONE van opsega '%s'

source: TIMESTAMP WITH TIME ZONE '%s' no longer supported
hr: TIMESTAMP WITH TIME ZONE '%s' vi¹e nije podr¾ano

source: TIMESTAMP WITH TIME ZONE '%s' not parsed; internal coding error
hr: TIMESTAMP WITH TIME ZONE '%s' nije parsano; interna gre¹ka u kodu

source: Unable to format timestamp with time zone; internal coding error
hr: Neuspje¹no formatiranje 'timestamp with time zone' tipa; interna gre¹ka u kodu

source: Bad interval external representation (too long) '%s'
hr: Pogre¹na eksterna 'interval' prezentacija (predugaèko) '%s'

source: Bad interval external representation '%s'
hr: Pogre¹na eksterna 'interval' prezentacija '%s'

source: Interval '%s' no longer supported
hr: Interval '%s' vi¹e nije podr¾an

source: Interval '%s' not parsed; internal coding error
hr: Interval '%s' nije parsano; interna gre¹ka u kodu

source: Unable to encode interval; internal coding error
hr: Neuspje¹no enkodiranje interval tipa; interna gre¹ka u kodu

source: Unable to format interval; internal coding error
hr: Neuspje¹no formatiranje interval tipa; interna gre¹ka u kodu

source: AdjustIntervalForTypmod(): internal coding error
hr: AdjustIntervalForTypmod(): gre¹ka u internom kodu

source: Unable to subtract non-finite timestamps
hr: Nemoguæe oduzimanje neodreðenih TIMESTAMP-ova

source: Unable to add TIMESTAMP and INTERVAL timestamp_pl_span() internal error encoding timestamp
hr: Neuspje¹no dodavanje TIMESTAMP-a i INTERVAL-a timestamptz_pl_span() interna gre¹ka kod kodiranja TIMESTAMP-a

source: Unable to add TIMESTAMP and INTERVAL timestamp_pl_span() internal error decoding timestamp
hr: Neuspje¹no dodavanje TIMESTAMP-a i INTERVAL-a timestamptz_pl_span() interna gre¹ka kod dekodiranja TIMESTAMP-a

source: Unable to add TIMESTAMP and INTERVAL timestamptz_pl_span() internal error encoding timestamp
hr: Neuspje¹no dodavanje TIMESTAMP-a i INTERVAL-a timestamptz_pl_span() interna gre¹ka kod kodiranja TIMESTAMP-a

source: Unable to add TIMESTAMP and INTERVAL timestamptz_pl_span() internal error decoding timestamp
hr: Neuspje¹no dodavanje TIMESTAMP-a i INTERVAL-a timestamptz_pl_span() interna gre¹ka kod dekodiranja TIMESTAMP-a

source: interval_div: divide by 0.0 error
hr: interval_div: dijeljenje sa 0.0 - gre¹ka

source: interval_accum: expected 2-element interval array
hr: interval_accum: oèekivan interval niz sa 2 elementa

source: interval_avg: expected 2-element interval array
hr: interval_avg: oèekivan interval niz sa 2 elementa

source: Unable to encode INTERVAL timestamp_age() internal coding error
hr: Neuspje¹no dekodiranje INTERVAL-a timestamp_age() gre¹ka u internom kodu

source: Unable to decode TIMESTAMP timestamp_age() internal coding error
hr: Neuspje¹no dekodiranje TIMESTAMP-a timestamp_age() gre¹ka u internom kodu

source: Unable to decode TIMESTAMP
hr: Neuspje¹no dekodiranje TIMESTAMP-a

source: TIMESTAMP bad external representation (too long)
hr: TIMESTAMP pogre¹na eksterna prezentacija(predugaèko)

source: TIMESTAMP WITH TIME ZONE bad external representation (too long)
hr: TIMESTAMP WITH TIME ZONE pogre¹na eksterna prezentacija(predugaèko)

source: INTERVAL bad external representation (too long)
hr: INTERVAR pogre¹na eksterna prezentacija(predugaèko)

source: TIMESTAMP units '%s' not recognized
hr: TIMESTAMP jedinice '%s' nisu poznate

source: TIMESTAMP units '%s' not supported
hr: TIMESTAMP jedinice '%s' nisu podr¾ane

source: Unable to truncate TIMESTAMP to '%s'
hr: Neuspje¹no skraèivanje TIMESTAMP-a u '%s'

source: TIMESTAMP WITH TIME ZONE units '%s' not recognized
hr: TIMESTAMP WITH TIME ZONE jedinice '%s' nisu poznate

source: TIMESTAMP WITH TIME ZONE units '%s' not supported
hr: TIMESTAMP WITH TIME ZONE jedinice '%s' nisu podr¾ane

source: Unable to truncate TIMESTAMP WITH TIME ZONE to '%s'
hr: Neuspje¹no skraèivanje TIMESTAMP WITH TIME ZONE u '%s'

source: INTERVAL units '%s' not recognized
hr: INTERVAL jedinice '%s' nisu poznate

source: INTERVAL units '%s' not supported
hr: INTERVAL jedinice '%s' nisu podr¾ane

source: Unable to truncate INTERVAL to '%s'
hr: Neuspje¹no skraèivanje INTERVAL-a u '%s'

source: Unable to decode INTERVAL; internal coding error
hr: Neuspje¹no kodiranje INTERVAL-a; gre¹ka u internom kodu

source: isoweek2date(): can't convert without year information
hr: isoweek2date(): nemoguæe konvertiarnje bez podatka o godini

source: Unable to encode TIMESTAMP
hr: Neuspje¹no kodiranje TIMESTAMP-a
