Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: Unable to encode TIMESTAMP WITH TIME ZONE
hr: Neuspje¹no kodiranje TIMESTAMP WITH TIME ZONE

source: Unable to decode INTERVAL interval_part() internal coding error
hr: Neuspjelo dekodiranje INTERVAL-a interval_part() gre¹ka u internom kodu

source: Unable to convert TIMESTAMP to TIMESTAMP WITH TIME ZONE (tm)
hr: Neuspjela konverzija TIMESTAMP u TIMESTAMP WITH TIME ZONE (tm)

source: Unable to convert TIMESTAMP to TIMESTAMP WITH TIME ZONE
hr: Neuspjela konverzija TIMESTAMP u TIMESTAMP WITH TIME ZONE

source: Unable to convert TIMESTAMP WITH TIME ZONE to TIMESTAMP (tm)
hr: Neuspjela konverzija TIMESTAMP WITH TIME ZONE u TIMESTAMP (tm)

source: Unable to convert TIMESTAMP WITH TIME ZONE to TIMESTAMP
hr: Neuspjela konverzija TIMESTAMP WITH TIME ZONE u TIMESTAMP

source: Bit string length %d does not match type BIT(%d)
hr: Du¾ina 'bit string'-a %d ne odgovara tipu 'BIT(%d)'

source: Cannot parse '%c' as a binary digit
hr: Nemoguæe parsanje '%c' kao binarni broj

source: Cannot parse '%c' as a hex digit
hr: Nemoguæe parsanje '%c' kao heksadecimalni broj

source: Bit string too long for type BIT VARYING(%d)
hr: 'Bit string' je prevelik da bi stao u 'BIT VARYING(%d)' tip

source: Cannot AND bit strings of different sizes
hr: Nemoguæa AND operacija nad 'bit string'-ovima razlièite duljine

source: Cannot OR bit strings of different sizes
hr: Nemoguæa OR operacija nad 'bit string'-ovima razlièite duljine

source: Cannot XOR bit strings of different sizes
hr: Nemoguæa XOR operacija nad 'bit string'-ovima razlièite duljine

source: Bit string is too large to fit in type integer
hr: 'Bit string' je prevelik da bi stao u 'integer' tip

source: INT64 is not supported on this platform
hr: INT64 nije podr¾an na ovoj platformi

source: Bit string is too large to fit in type int64
hr: 'Bit string' je prevelik da bi stao u 'int64' tip

source: value too long for type character(%d)
hr: vrijednost predugaèka za tip 'character(%d)'

source: value too long for type character varying(%d)
hr: vrijednost predugaèka za tip 'character varying(%d)'

source: Bad input string for type bytea
hr: Pogre¹an ulazni 'string' za tip 'bytea'

source: Invalid backend encoding; encoding max length is less than one.
hr: Pogre¹an 'backend encoding'; maksimalna du¾ina 'encoding'-a je manje od jedan

source: negative substring length not allowed
hr: negativna du¾ina 'substring'-a nije dozvoljena

source: byteaGetByte: index %d out of range [0..%d]
hr: byteaGetByte: indeks %d van opsega [0..%d]

source: byteaGetBit: index %d out of range [0..%d]
hr: byteaGetBit: indeks %d van opsega [0..%d]

source: byteaSetByte: index %d out of range [0..%d]
hr: byteaSetByte: indeks %d van opsega [0..%d]

source: byteaSetBit: index %d out of range [0..%d]
hr: byteaSetBit: indeks %d van opsega [0..%d]

source: byteaSetBit: new bit must be 0 or 1
hr: byteaSetBit: novi bit mora biti 0 ili 1

source: field position must be > 0
hr: pozicija polja mora biti > 0

source: GetCCHashFunc: type %u unsupported as catcache key
hr: GetCCHashFunc: tip %u nije podr¾an kao 'catcache' kljuè

source: CatalogCacheInitializeCache: load %d/%d w/%d, %u
hr: CatalogCacheInitializeCache: uèitavanje %d/%d w/%d, %u

source: CatalogCacheInitializeCache: load %d/%d w/%d
hr: CatalogCacheInitializeCache: uèitavanje %d/%d w/%d

source: CatalogCacheInit: only sys attr supported is OID
hr: CatalogCacheInit: jedini podr¾an sistemski atribut je OID

source: init_fcache: too many arguments
hr: init_fcache: previ¹e argumenata

source: ExecuteInvalidationMessage: bogus message id %d
hr: ExecuteInvalidationMessage: pogre¹an id poruke %d

source: Out of cache_callback_list slots
hr: Nedostatak cache_callback_list slotova

source: op_requires_recheck: op %u is not a member of opclass %u
hr: op_requires_recheck: 'op' %u nije èlan 'opclass' %u

source: cache lookup failed for relation %u attribute %d
hr: tra¾enje relacije %u atributa %d u 'cache'-u nije uspjelo

source: op_mergejoin_crossops: operator %u not found
hr: op_mergejoin_crossops: operator %u nije naðen

source: op_mergejoin_crossops: mergejoin operator %u has no matching < operator
hr: op_mergejoin_crossops: 'mergejoin' operator %u nema odgovarajuæi < operator

source: op_mergejoin_crossops: mergejoin operator %u has no matching > operator
hr: op_mergejoin_crossops: 'mergejoin' operator %u nema odgovarajuæi > operator

source: Operator OID %u does not exist
hr: OID %u operatora ne postoji

source: get_system_catalog_relid: cannot find %s
hr: get_system_catalog_relid: nije naðen %s

source: get_typdefault: failed to lookup type %u
hr: get_typdefault: neuspjelo tra¾enje tipa %u

source: getBaseType: failed to lookup type %u
hr: getBaseType: neuspjelo tra¾enje tipa %u

source: getTypeInputInfo: Cache lookup of type %u failed
hr: getTypeInputInfo: Tra¾enje tipa %u u nije uspjelo

source: getTypeOutputInfo: Cache lookup of type %u failed
hr: getTypeOutputInfo: tra¾enje tipa %u u nije uspjelo

source: get_attstatsslot: stavalues is null
hr: get_attstatsslot: 'stavalues' je null

source: get_attstatsslot: Cache lookup failed for type %u
hr: get_attstatsslot: tra¾enje tipa %u u 'cache'-u nije uspjelo

source: get_attstatsslot: stanumbers is null
hr: get_attstatsslot: 'stanumbers' je 'null'

source: get_attstatsslot: stanumbers is not a 1-D float4 array
hr: get_attstatsslot: 'stanumbers' nije '1-D float4 array'

source: out of memory for relation descriptor cache
hr: nedostatak memorije za 'relation descriptor cache'

source: trying to delete a rd_id reldesc that does not exist.
hr: poku¹aj brisanja 'rd_id reldesc' koji ne postoji

source: trying to delete a rd_node reldesc that does not exist.
hr: poku¹aj brisanja 'rd_node reldesc'-a koji ne postoji.

source: trying to delete a relname reldesc that does not exist.
hr: poku¹aj brisanja 'relname reldesc'-a koji ne postoji.

source: ScanPgRelation: bad buildinfo
hr: ScanPgRelation: pogre¹an 'buildinfo'

source: Bogus attribute number %d for %s
hr: Pogre¹an broj atributa %d za %s

source: catalog is missing %d attribute(s) for relid %u
hr: katalogu nedostaje %d atribut(i) za 'relid' %u

source: RelationInitIndexAccessInfo: no pg_index entry for index %u
hr: RelationInitIndexAccessInfo: u pg_index ne postoji naslov za index %u

source: RelationInitIndexAccessInfo: cache lookup failed for AM %u
hr: RelationInitIndexAccessInfo: nije uspjelo pretra¾ivanje cache-a za AM %u

source: IndexSupportInitialize: bogus pg_index tuple
hr: IndexSupportInitialize: pogre¹an tuple u pg_index

source: out of memory for operator class cache
hr: nedostatak memorije za 'operator class cache'

source: Bogus amopstrategy number %d for opclass %u
hr: Pogre¹an 'amopstrategy' broj %d za 'opclass' %u

source: Bogus amproc number %d for opclass %u
hr: Pogre¹an 'amproc' broj %d za 'opclass' %u

source: RelationReloadClassinfo system relation id=%d doesn't exist
hr: RelationReloadClassinfo sistemska relacija id=%d ne postoji

source: RelationClearRelation: relation %u deleted while still in use
hr: RelationClearRelation: relacija %u obrisana dok je jo¹ bila u upotrebi

source: RelationForgetRelation: relation %u is still open
hr: RelationForgetRelation: relacija %u je jo¹ uvijek otvorena

source: Relcache reference leak: relation "%s" has refcnt %d instead of %d
hr: Relcache reference leak: relacija "%s" ima 'refcnt' %d umjesto %d

source: RelationCacheInitializePhase2: no pg_class entry for %s
hr: RelationCacheInitializePhase2: ne postoji zapis u 'pg_class' sistemskom katalogu za %s

source: AttrDefaultFetch: second record found for attr %s in rel %s
hr: AttrDefaultFetch: drugi slog pronaðen za atribut %s u relaciji %s

source: AttrDefaultFetch: adbin IS NULL for attr %s in rel %s
hr: AttrDefaultFetch: 'adbin' IS NULL za atribut %s u relaciji %s

source: AttrDefaultFetch: unexpected record found for attr %d in rel %s
hr: AttrDefaultFetch: neoèekivani slog naðen za atribut %d u relaciji %s

source: AttrDefaultFetch: %d record(s) not found for rel %s
hr: AttrDefaultFetch: %d slog(ova) nije naðeno za relaciju %s

source: CheckConstraintFetch: unexpected record found for rel %s
hr: CheckConstraintFetch: neoèekivan slog naðen za relaciju %s

source: CheckConstraintFetch: conbin IS NULL for rel %s
hr: CheckConstraintFetch: 'conbin' IS NULL za relaciju rel %s

source: CheckConstraintFetch: %d record(s) not found for rel %s
hr: CheckConstraintFetch: %d slog(ova) nije naðeno za relaciju %s

source: Cannot create init file %s: %m Continuing anyway, but there's something wrong.
hr: Neuspje¹no kreiranje 'init' datoteke %s: %m Svejedno nastavljam, ali ne¹to tu nije u redu.

source: cannot write init file -- descriptor length
hr: neuspje¹no pisanje u 'init' datoteku -- descriptor length

source: cannot write init file -- reldesc
hr: neuspje¹no pisanje u 'init' datoteku -- reldesc

source: cannot write init file -- relation tuple form length
hr: neuspje¹no pisanje u 'init' datoteku -- relation tuple form length

source: cannot write init file -- relation tuple form
hr: neuspje¹no pisanje u 'init' datoteku -- relation tuple form

source: cannot write init file -- length of attdesc %d
hr: neuspje¹no pisanje u 'init' datoteku -- length of attdesc %d

source: cannot write init file -- attdesc %d
hr: neuspje¹no pisanje u 'init' datoteku -- attdesc %d

source: write_relcache_init_file: no pg_index entry for index %u
hr: write_relcache_init_file: u pg_index ne postoji naslov za index %u

source: cannot write init file -- index tuple form length
hr: neuspje¹no pisanje u 'init' datoteku -- index tuple form length

source: cannot write init file -- index tuple form
hr: neuspje¹no pisanje u 'init' datoteku -- index tuple form

source: cannot write init file -- am tuple form length
hr: neuspje¹no pisanje u 'init' datoteku -- am tuple form length

source: cannot write init file -- am tuple form
hr: neuspje¹no pisanje u 'init' datoteku -- am tuple form

source: cannot write init file -- strategy map length
hr: neuspje¹no pisanje u 'init' datoteku -- strategy map length

source: cannot write init file -- strategy map
hr: neuspje¹no pisanje u 'init' datoteku -- strategy map

source: cannot write init file -- operator vector length
hr: neuspje¹no pisanje u 'init' datoteku -- operator vector length

source: cannot write init file -- operator vector
hr: neuspje¹no pisanje u 'init' datoteku -- operator vector

source: cannot write init file -- support vector length
hr: neuspje¹no pisanje u 'init' datoteku -- support vector length

source: cannot write init file -- support vector
hr: neuspje¹no pisanje u 'init' datoteku -- support vector

source: Cannot rename init file %s to %s: %m Continuing anyway, but there's something wrong.
hr: Neuspje¹no preimenovanje 'init' datoteke %s u %s: %m Svejedno nastavljam, ali tu ne¹to nije u redu.

source: InitCatalogCache: Can't init cache %s (%d)
hr: InitCatalogCache: Neuspje¹na inicijalizacija 'cache'-a %s (%d)

source: SearchSysCache: Bad cache id %d
hr: SearchSysCache: Pogre¹an 'cache id' %d

source: SysCacheGetAttr: Bad cache id %d
hr: SysCacheGetAttr: Pogre¹an 'cache id' %d

source: SysCacheGetAttr: missing cache data for id %d
hr: SysCacheGetAttr: nedostaju 'cache' podaci za id %d

source: SearchSysCacheList: Bad cache id %d
hr: SearchSysCacheList: pogre¹an cache id : %d

source: elog: out of memory
hr: elog: nedovoljno memorije

source: statement: %s
hr: izraz: %s

source: elog: error during error recovery, giving up!
hr: elog: gre¹ka prilokom oporavljanja od gre¹ke, odustajem!

source: DebugFileOpen: open of %s: %m
hr: DebugFileOpen: otvoreno %s: %m

source: DebugFileOpen: %s reopen as stderr: %m
hr: DebugFileOpen: %s ponovno otvoren kao 'stderr': %m

source: DebugFileOpen: %s reopen as stdout: %m
hr: DebugFileOpen: %s ponovno otvoren kao 'stdout': %m

source: DebugFileOpen: could not open debugging file
hr: DebugFileOpen: nemoguæe otvaranje 'debug' datoteke

source: Numerical result out of range
hr: Numerièki rezultat van opsega

source: operating system error %d
hr: gre¹ka operativnog sistema %d

source: stat failed on file '%s': %m
hr: stat nije uspio na datoteci '%s': %m

source: Out of memory in load_external_function
hr: Nedovoljno memorije u 'load_external_function'

source: Load of file %s failed: %s
hr: Uèitavanje datoteke %s nije uspjelo: %s

source: Can't find function %s in file %s
hr: Funkcija %s nije naðena u datoteci %s

source: LOAD: could not open file '%s': %m
hr: LOAD: nemoguæe otvaranje datoteke '%s': %m

source: stat failed on %s: %s
hr: stat neuspje¹an na %s: %s

source: invalid macro name in dynamic library path
hr: pogre¹no ime makroa u 'dynamic library path'-u

source: zero length dynamic_library_path component
hr: dynamic_library_path komponenta sa duljinom 0

source: dynamic_library_path component is not absolute
hr: dynamic_library_path komponenta nije apsolutna

source: find_in_dynamic_libpath: trying %s
hr: find_in_dynamic_libpath: poku¹avam %s

source: fmgr_info: function %u: cache lookup failed
hr: fmgr_info: tra¾enje funkcije %u: u 'cache'-u nije uspjelo

source: fmgr_info: function %s not in internal table
hr: fmgr_info: funkcija %s nije u internoj tabeli

source: Unknown function API version %d
hr: Nepoznata verzija %d API funkcije

source: fmgr_info: cache lookup for language %u failed
hr: fmgr_info: tra¾enje jezika %u u 'cache'-u nije uspjelo

source: fmgr_info: language %u has old-style handler
hr: fmgr_info: jezik %u ima 'old-style handler'

source: Null result from %s
hr: Null rezultat od %s

source: Unknown version %d reported by %s
hr: Nepoznata verzija %d prijavljena od %s

source: Internal error: fmgr_oldstyle received NULL pointer
hr: Internal error: 'fmgr_oldstyle' je primio 'NULL pointer'

source: fmgr_oldstyle: function %u: too many arguments (%d > %d)
hr: fmgr_oldstyle: funkcija %u: previ¹e argumenata (%d > %d)

source: fmgr_security_definer: function %u: cache lookup failed
hr: fmgr_security_definer: tra¾enje funkcije %u: u 'cache'-u nije uspjelo

source: DirectFunctionCall1: function %p returned NULL
hr: DirectFunctionCall1: funkcija %p je vratila NULL

source: DirectFunctionCall2: function %p returned NULL
hr: DirectFunctionCall2: funkcija %p je vratila NULL

source: DirectFunctionCall3: function %p returned NULL
hr: DirectFunctionCall3: funkcija %p je vratila NULL

source: DirectFunctionCall4: function %p returned NULL
hr: DirectFunctionCall4: funkcija %p je vratila NULL

source: DirectFunctionCall5: function %p returned NULL
hr: DirectFunctionCall5: funkcija %p je vratila NULL

source: DirectFunctionCall6: function %p returned NULL
hr: DirectFunctionCall6: funkcija %p je vratila NULL

source: DirectFunctionCall7: function %p returned NULL
hr: DirectFunctionCall7: funkcija %p je vratila NULL

source: DirectFunctionCall8: function %p returned NULL
hr: DirectFunctionCall8: funkcija %p je vratila NULL

source: DirectFunctionCall9: function %p returned NULL
hr: DirectFunctionCall9: funkcija %p je vratila NULL

source: FunctionCall1: function %u returned NULL
hr: FunctionCall1: funkcija %u je vratila NULL

source: FunctionCall2: function %u returned NULL
hr: FunctionCall2: funkcija %u je vratila NULL

source: FunctionCall3: function %u returned NULL
hr: FunctionCall3: funkcija %u je vratila NULL

source: FunctionCall4: function %u returned NULL
hr: FunctionCall4: funkcija %u je vratila NULL

source: FunctionCall5: function %u returned NULL
hr: FunctionCall5: funkcija %u je vratila NULL

source: FunctionCall6: function %u returned NULL
hr: FunctionCall6: funkcija %u je vratila NULL

source: FunctionCall7: function %u returned NULL
hr: FunctionCall7: funkcija %u je vratila NULL

source: FunctionCall8: function %u returned NULL
hr: FunctionCall8: funkcija %u je vratila NULL

source: FunctionCall9: function %u returned NULL
hr: FunctionCall9: funkcija %u je vratila NULL

source: OidFunctionCall1: function %u returned NULL
hr: OidFunctionCall1: funkcija %u je vratila NULL

source: OidFunctionCall2: function %u returned NULL
hr: OidFunctionCall2: funkcija %u je vratila NULL

source: OidFunctionCall3: function %u returned NULL
hr: OidFunctionCall3: funkcija %u je vratila NULL

source: OidFunctionCall4: function %u returned NULL
hr: OidFunctionCall4: funkcija %u je vratila NULL

source: OidFunctionCall5: function %u returned NULL
hr: OidFunctionCall5: funkcija %u je vratila NULL

source: OidFunctionCall6: function %u returned NULL
hr: OidFunctionCall6: funkcija %u je vratila NULL

source: OidFunctionCall7: function %u returned NULL
hr: OidFunctionCall7: funkcija %u je vratila NULL

source: OidFunctionCall8: function %u returned NULL
hr: OidFunctionCall8: funkcija %u je vratila NULL

source: OidFunctionCall9: function %u returned NULL
hr: OidFunctionCall9: funkcija %u je vratila NULL

source: fmgr: function %u: too many arguments (%d > %d)
hr: fmgr: funkcija %u: previ¹e argumenata (%d > %d)

source: fmgr: function %u returned NULL
hr: fmgr: funkcija %u je vratila NULL

source: function called in context that does not accept a set result
hr: funkcija pozvana u kontekstu koji ne prihvaæa set rezultat

source: init_MultiFuncCall may not be called more than once
hr: init_MultiFuncCall ne mo¾e biti pozvana vi¹e od jednom

source: hash_search: bogus action %d
hr: hash_search: neispravna akcija %d

source: Hash table '%s' corrupted
hr: Hash tabela %s je koruptirana

source: ValidateBinary: "%s" is not a regular file
hr: ValidateBinary: "%s" nije regularna datoteka

source: ValidateBinary: "%s" is not user read/execute
hr: ValidateBinary: "%s" nije oznaèeno sa 'user read/execute' pravima

source: ValidateBinary: "%s" is not group read/execute
hr: ValidateBinary: "%s" nije oznaèeno sa 'group read/execute' pravima

source: ValidateBinary: "%s" is not other read/execute
hr: ValidateBinary: "%s" nije oznaèeno sa 'other read/execute' pravima

source: FindExec: found "%s" using argv[0]
hr: FindExec: naðen "%s" koristeæi argv[0]

source: FindExec: searching PATH ...
hr: FindExec: tra¾im PATH ...

source: FindExec: found "%s" using PATH
hr: FindExec: naðen "%s" koristeæi PATH

source: FindExec: could not read binary "%s"
hr: FindExec: nemoguæe proèitati 'binary' %s

source: FindExec: could not find a %s to execute
hr: FindExec: neuspjelo tra¾enje %s da bi bio izvr¹en

source: out of memory
hr: nedovoljno memorije

source: cannot get current working directory: %m
hr: ne mogu pronaæi trnutni radni direktorij %m

source: SetCharSet: unknown tag %s in file %s
hr: SetCharSet: nepoznat tag %s u datoteci %s

source: GetCharSetByHost: unknown tag %s in file %s
hr: GetCharSetByHost: nepoznat tag %s u datoteci %s

source: invalid user id %u
hr: pogre¹an id korisnika %u

source: Can't create lock file %s: %m
hr: Neuspje¹no kreiranje 'lock' datoteke %s: %m

source: Can't read lock file %s: %m
hr: Neuspje¹no èitanje 'lock' datoteke %s: %m

source: Bogus data in lock file %s
hr: Neispravni podaci u 'lock' datoteci %s

source: Can't remove old lock file %s: %m The file seems accidentally left, but I couldn't remove it. Please remove the file by hand and try again.
hr: Ne mogu obrisati staru 'lock' datoteku %s: %m Datoteka je sluèajno ostala neobrisana, ali sada je mogu obrisati. Poku¹ajte ruèno obrisati datoteki, pa poku¹ajte ponovo.

source: Can't write lock file %s: %m
hr: Neuspje¹no zapisivanje 'lock' datoteke %s: %m

source: Failed to rewrite %s: %m
hr: Neuspje¹no prepisivanje %s: %m

source: Failed to read %s: %m
hr: Neuspje¹no èitanje %s: %m

source: Bogus data in %s
hr: Pogre¹ni podaci u %s

source: Failed to write %s: %m
hr: Neuspje¹no pisanje %s: %m

source: File %s is missing. This is not a valid data directory.
hr: Datoteka %s ne postoji. Ovo nije ispravan direktorij baze podataka.

source: File %s does not contain valid data. You need to initdb.
hr: Datoteka %s ne sadr¾i podatke. Trebate pokrenuti 'initdb'.

source: The data directory was initialized by PostgreSQL version %ld.%ld, which is not compatible with this version %s.
hr: Direktorij baze podataka je inicijaliziran sa PostgreSQL verzijom %ld.%ld, koja nije kompatibilna sa ovom verzijom %s.

source: Database "%s", OID %u, has disappeared from pg_database
hr: Database "%s", OID %u, je nestala iz 'pg_database' sistemskog kataloga

source: Database "%s" is not currently accepting connections
hr: Baza podatak "%s" trenutno ne prihvaæa nikakve veze(connections)

source: Database "%s" does not exist in the system catalog.
hr: Baza podataka "%s" ne postoji u sistemskom katalogu.

source: Database "%s" does not exist. The database subdirectory '%s' is missing.
hr: Baza podataka "%s" ne postoji. Poddirektorij baze '%s' ne postoji.

source: Unable to change directory to '%s': %m
hr: Neuspje¹na promjena direktorija u '%s': %m

source: InitPostgres: bad backend id %d
hr: InitPostgres: pogre¹an 'backend id' %d

source: There are currently no users defined in this database system.
hr: Trenutno nema definiranih korisnika za ovu bazu podataka.

source: You should immediately run 'CREATE USER "%s" WITH SYSID %d CREATEUSER;'.
hr: Trebali biste odmah pokrenuti'CREATE USER "%s" WITH SYSID %d CREATEUSER;'.

source: default conversion proc for %s to %s not found
hr: inicijalna funkcija za konverziju iz %s u %s nije naðena

source: default conversion proc %u for %s to %s not found in pg_proc
hr: inicijalna funkcija %u za konverziju iz %s u %s nije naðena u 'pg_proc'

source: Failed to reset %s
hr: Neuspjelo resetiranje %s

source: Failed to commit %s
hr: Neuspio 'commit' %s

source: '%s' is not a valid option name
hr: '%s' nije ispravno ime opcije

source: '%s' cannot be changed after server start
hr: '%s' ne mo¾e biti promijenjeno nakon startanja servera

source: '%s' cannot be changed now
hr: '%s' ne mo¾e biti promijenjeno sada

source: '%s' cannot be set after connection start
hr: '%s' ne mo¾e biti promijenjeno nakon startanja veze

source: '%s': permission denied
hr: '%s': zabranjen pristup

source: SET %s takes only one argument
hr: SET %s mora imati samo jedan argument

source: SET variable name is required
hr: SET ime varijable je obavezno

source: cannot parse setting "%s"
hr: nemoguæe parsanje opcije "%s"

source: could not read configuration file `
hr: nemoguæe èitanje konfiguracijske datoteke

source: :%u: syntax error, token="%s"
hr: %u: sintaksna gre¹ka, token="%s"
