Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: Right hand side of operator %s has an unknown type Probably a bad attribute name
hr: Izraz sa desne strane operatora '%s' ima nepoznat tip Vjerovatno pogre¹no ime atributa

source: Unable to identify an operator '%s' for types '%s' and '%s' You will have to retype this query using an explicit cast
hr: Nemoguæe identificiranje operatora '%s' za tip '%s' i '%s' Morat æete drugaèije napisati izraz ili koristiti eksplicitnu konverziju(explicit cast)

source: operand of prefix operator '%s' has an unknown type (probably an invalid column reference)
hr: operand prefix operatora '%s' ima nepoznat tip (Vjerovatno pogre¹na referenca na kolonu)

source: operand of postfix operator '%s' has an unknown type (probably an invalid column reference)
hr: operand postfix operatora '%s' ima nepoznat tip (Vjerovatno pogre¹na referenca na kolonu)

source: Unable to identify a prefix operator '%s' for type '%s' You may need to add parentheses or an explicit cast
hr: Nemoguæe identificirati prefix operator '%s' za tip '%s' Morat æete koristiti zagrade ili eksplicitnu konverziju(explicit cast)

source: Unable to identify a postfix operator '%s' for type '%s' You may need to add parentheses or an explicit cast
hr: Nemoguæe identificirati postfix operator '%s' za tip '%s' Morat æete koristiti zagrade ili eksplicitnu konverziju(explicit cast)

source: Table reference "%s" is ambiguous
hr: Referenca na tabelu "%s" je problematièna

source: Table reference %u is ambiguous
hr: Referenca na tabelu %u je problematièna

source: scanNameSpaceForRelid: unexpected node type %d
hr: scanNameSpaceForRelid: neoèekivan tip noda %d

source: Table name "%s" specified more than once
hr: tablica "%s" specificirana vi¹e puta

source: scanNameSpaceForConflict: unexpected node type %d
hr: scanNameSpaceForConflict: neoèekivan tip noda %d

source: Column reference "%s" is ambiguous
hr: Referenca na kolonu "%s" je problematièna

source: Table "%s" has %d columns available but %d columns specified
hr: tablica "%s" ima %d raspolo¾ivih kolona, ali je %d kolona specificirano

source: expandRTE: unsupported RTE kind %d
hr: expandRTE: nepodr¾an 'RTE' tip %d

source: Invalid attnum %d for rangetable entry %s
hr: Pogre¹an 'attnum' %d za 'rangetable entry' %s

source: Relation "%s" does not have attribute %d
hr: Relacija "%s" nema atribut %d

source: Subquery %s does not have attribute %d
hr: 'Subquery' %s nema atribut %d

source: get_rte_attribute_type: unsupported RTE kind %d
hr: get_rte_attribute_type: nepodr¾an 'RTE' tip %d

source: Relation %s does not have attribute %d
hr: Relacija %s nema atribut %d

source: Adding missing FROM-clause entry%s for table "%s"
hr: Dodavanje nepostojeæe FROM-klauzule stavka%s za tabelu "%s"

source: You can't use relation names alone in the target list, try relation.*.
hr: Ne mo¾ete koristiti samo imena relacija u ciljnoj listi , poku¹ajte sa: relacija.*.

source: column "%s" is of type %s but expression is of type %s You will need to rewrite or cast the expression
hr: kolona "%s" je tipa %s ali je izraz tipa %s Morat æete drugaèije napisati izraz ili upotrijebit konverziju(cast)

source: Attribute '%s' specified more than once
hr: Attribute '%s' specificiran vi¹e puta

source: %s converted to %s
hr: %s konvertiran u %s

source: Type "%s" is only a shell
hr: Tip "%s" je samo ¹koljka(shell)

source: Unable to locate type oid %u in catalog
hr: Neuspjelo pronala¾enje 'type oid'-a %u u katalogu

source: Invalid type name '%s'
hr: Pogre¹no ime tipa '%s'

source: unterminated /* comment
hr: neterminirani /* komentar

source: unterminated bit string literal
hr: neterminirani 'bit string literal'

source: unterminated hexadecimal string literal
hr: neterminirani 'hexadecimal string literal'

source: unterminated quoted string
hr: neterminirani 'quoted string'

source: zero-length delimited identifier
hr: 'delimited identifier' nulte duljine

source: identifier "%s" will be truncated to "%.*s"
hr: identifikator "%s" æe biti odsijeæen u "%.*s"

source: unterminated quoted identifier
hr: neterminirani 'quoted identifier'

source: parser: %s at end of input
hr: parser: %s na kraju unosa

source: parser: %s at or near "%s" at character %d
hr: parser: %s na ili u blizini "%s" kod karaktera %d

source: syntax error: cannot back up
hr: sintaksna gre¹ka: nemoguæe kopiranje

source: SET TRANSACTION/READ ONLY not yet supported
hr: SET TRANSACTION/READ ONLY jo¹ nije podr¾an

source: Time zone interval must be HOUR or HOUR TO MINUTE
hr: Interval vremenske zone mora biti HOUR ili HOUR TO MINUTE

source: INTERVAL(%d) precision must be between %d and %d
hr: INTERVAL(%d) preciznost mora biti izmeðu %d i %d

source: GLOBAL TEMPORARY TABLE is not currently supported
hr: GLOBAL TEMPORARY TABLE nije jo¹ podr¾ana

source: CREATE TABLE / COLLATE %s not yet implemented; clause ignored
hr: CREATE TABLE / COLLATE %s jo¹ nije podr¾ano ; klauzula ignorirana

source: LIKE in table definitions not yet supported
hr: LIKE u definiciji tabele jo¹ nije podr¾an

source: FOREIGN KEY/MATCH PARTIAL not yet implemented
hr: FOREIGN KEY/MATCH PARTIAL nije jo¹ implementiran

source: CREATE TABLE AS may not specify INTO
hr: CREATE TABLE AS ne specificira INTO

source: CREATE ASSERTION is not yet supported
hr: CREATE ASSERTION jo¹ nije podr¾an

source: DROP ASSERTION is not yet supported
hr: DROP ASSERTION jo¹ nije podr¾an

source: FETCH / RELATIVE at current position is not supported
hr: FETCH / RELATIVE nije jo¹ podr¾an

source: FETCH / ABSOLUTE not supported, using RELATIVE
hr: FETCH / ABSOLUTE nije podr¾an, koristim RELATIVE

source: grant options are not implemented
hr: 'grant' opcije nisu implementirane!

source: CREATE FUNCTION / OUT parameters are not supported
hr: CREATE FUNCTION / OUT parametri nisu podr¾ani

source: CREATE FUNCTION / INOUT parameters are not supported
hr: CREATE FUNCTION / INOUT parametri nisu podr¾ani

source: parser: argument type missing (use NONE for unary operators)
hr: parser: tip argumenta nedostaje (koristite NONE za unarne operatore)

source: CREATE DOMAIN / COLLATE %s not yet implemented; clause ignored
hr: CREATE DOMAIN / COLLATE %s jo¹ nije podr¾ano; klauzula ignorirana

source: LIMIT #,# syntax not supported. Use separate LIMIT and OFFSET clauses.
hr: LIMIT #,# sintaksa nije podr¾ana. Koristite LIMIT i OFFSET klauzule.

source: LIMIT must not be negative
hr: LIMIT ne mo¾e biti negativan

source: OFFSET must not be negative
hr: OFFSET ne mo¾e biti negativan

source: sub-SELECT in FROM must have an alias For example, FROM (SELECT ...) [AS] foo
hr: 'sub-SELECT' izraz u FROM klauzuli mora imati zadan alias Na primjer, FROM (SELECT ...) [AS] foo

source: precision for FLOAT must be at least 1
hr: preciznost za FLOAT mora biti najmanje 1

source: precision for FLOAT must be less than 16
hr: preciznost za FLOAT mora biti manja od 16

source: NUMERIC precision %d must be between 1 and %d
hr: preciznost za NUMERIC %d mora biti izmeðu 1 i %d

source: NUMERIC scale %d must be between 0 and precision %d
hr: NUMERIC skala %d mora biti izmeðu 0 i preciznosti %d

source: DECIMAL precision %d must be between 1 and %d
hr: praciznost za DECIMAL %d mora biti izmeðu 1 i %d

source: DECIMAL scale %d must be between 0 and precision %d
hr: skala za DECIMAL %d mora biti izmeðu 0 i preciznosti %d

source: length for type '%s' must be at least 1
hr: du¾ina tipa '%s' mora biti najmanje 1

source: length for type '%s' cannot exceed %d
hr: du¾ina tipa '%s' ne mo¾e prema¹iti %d

source: TIMESTAMP(%d)%s precision must be between %d and %d
hr: TIMESTAMP(%d)%s preciznost mora biti izmeðu %d i %d

source: TIME(%d)%s precision must be between %d and %d
hr: TIME(%d)%s preciznost mora biti izmeðu %d i %d

source: Unequal number of entries in row expression
hr: Nejednak broj parametara u izrazu retka(row expression)

source: UNIQUE predicate is not yet implemented
hr: UNIQUE jo¹ nije implementiran

source: CURRENT_TIME(%d) precision must be between %d and %d
hr: CURRENT_TIME(%d) preciznost mora biti izmeðu %d i %d

source: CURRENT_TIMESTAMP(%d) precision must be between %d and %d
hr: CURRENT_TIMESTAMP(%d) preciznost mora biti izmeðu %d i %d

source: LOCALTIME(%d) precision must be between %d and %d
hr: LOCALTIME(%d) preciznost mora biti izmeðu %d i %d

source: LOCALTIMESTAMP(%d) precision must be between %d and %d
hr: LOCALTIMESTAMP(%d) preciznost mora biti izmeðu %d i %d

source: OLD used in non-rule query
hr: OLD kori¹ten samo u 'non-rule' upitu(query)

source: NEW used in non-rule query
hr: NEW kori¹ten samo u 'non-rule' upitu(query)

source: Operator '%s' not implemented for row expressions
hr: Operator '%s' nije implementiran za izraze retka(row expressions)

source: Wrong number of parameters on left side of OVERLAPS expression
hr: Pogre¹an broj parametara na lijevoj strani 'OVERLAPS' izraza

source: Wrong number of parameters on right side of OVERLAPS expression
hr: Pogre¹an broj parametara na desnoj strani 'OVERLAPS' izraza

source: Multiple ORDER BY clauses not allowed
hr: Vi¹estruka ORDER BY klauzula nije dozvoljena

source: Multiple FOR UPDATE clauses not allowed
hr: Vi¹estruka FOR UPDATE klauzula nije dozvoljena

source: Multiple OFFSET clauses not allowed
hr: Vi¹estruka OFFSET klauzula nije dozvoljena

source: Multiple LIMIT clauses not allowed
hr: Vi¹estruka LIMIT klauzula nije dozvoljena

source: PGSTAT: socket() failed: %m
hr: PGSTAT: socket() neuspje¹an: %m

source: PGSTAT: bind(127.0.0.1) failed: %m
hr: PGSTAT: bind(127.0.0.1) neuspje¹an: %m

source: PGSTAT: getsockname() failed: %m
hr: PGSTAT: getsockname() neuspje¹an: %m

source: PGSTAT: connect() failed: %m
hr: PGSTAT: connect() neuspje¹an: %m

source: PGSTAT: fcntl() failed: %m
hr: PGSTAT: fcntl() neuspje¹an: %m

source: PGSTAT: pipe() failed: %m
hr: PGSTAT: pipe() neuspje¹an: %m

source: PGSTAT: fork() failed: %m
hr: PGSTAT: fork nije uspio: %m

source: Only database superusers can reset statistic counters
hr: Samo 'database superusers' mo¾e resetirati statiène brojaèe

source: PGSTATBE: malloc() failed
hr: PGSTATBE: malloc() neuspje¹an

source: PGSTAT: Allocation of backend table failed
hr: PGSTAT: Akokacija 'backend' tabele neuspje¹no

source: PGSTAT: select() failed: %m
hr: PGSTAT: select() neuspje¹an: %m

source: PGSTAT: read() failed: %m
hr: PGSTAT: read() neuspje¹an: %m

source: PGSTAT: bogus message length
hr: PGSTAT: pogre¹na du¾ina poruke

source: PGSTATBUFF: fcntl() failed: %m
hr: PGSTATBUFF: fcntl() neuspje¹an: %m

source: PGSTATBUFF: malloc() failed
hr: PGSTATBUFF: malloc() neuspje¹an

source: PGSTATBUFF: select() failed: %m
hr: PGSTATBUFF: select() neuspje¹an: %m

source: PGSTATBUFF: recvfrom() failed: %m
hr: PGSTATBUFF: recvfrom() neuspje¹an: %m

source: PGSTATBUFF: write() failed: %m
hr: PGSTATBUFF: write() neuspje¹an: %m

source: PGSTAT: Invalid backend ID %d
hr: PGSTAT: pogre¹an 'backend' ID %d

source: PGSTAT: cannot open temp stats file %s: %m
hr: PGSTAT: nemoguæe otvaranje privremene status datoteke %s: %m

source: PGSTAT: database hash table corrupted during cleanup - abort
hr: PGSTAT: 'database hash table' koruptirana za vrijeme 'cleanup' procesa - odustati

source: PGSTAT: Cannot rename temp stats file %s: %m
hr: PGSTAT: nemoguæe preimenovati privremenu statusnu datoteku %s: %m

source: PGSTAT: corrupted pgstat.stat file
hr: PGSTAT: koruptirana pgstat.stat datoteka

source: data directory %s was not found
hr: direktorij sa podacima %s nije naðen

source: could not read permissions of directory %s: %m
hr: nemoguæe èitanje prava pristupa za direktorij %s: %m

source: data directory %s has group or world access; permissions should be u=rwx (0700)
hr: direktorij sa podacima %s ima 'group or world access'; prava pristupa bi trebala biti u=rwx (0700)

source: %s does not find the database system. Expected to find it in the PGDATA directory "%s", but unable to open file "%s": %s
hr: %s nije prona¹ao bazu podataka. Oèekivano je da bude naðena u PGDATA direktoriju "%s", ali nije uspjelo otvaranje datoteke "%s": %s

source: Assert checking is not compiled in.
hr: 'Assert checking' nije ukompajliran.

source: --%s requires argument
hr: --%s zahtjeva argument

source: -c %s requires argument
hr: -c %s zahtjeva argument

source: Try '%s --help' for more information.
hr: Poku¹ajte '%s --help' za vi¹e informacija.

source: invalid argument -- %s
hr: pogre¹an argument -- %s

source: The number of buffers (-B) must be at least twice the number of allowed connections (-N) and at least 16.
hr: Broj 'buffers'-a (-B) mora biti najmanje dva puta veæi od broja dozvoljenih veza(connections) (-N) a najmanje 16.

source: %s: could not locate executable, bailing out...
hr: %s: neuspjelo lociranje programa , izlaz...

source: For SSL, TCP/IP connections must be enabled.
hr: Za SSL, TCP/IP konekcije moraju biti ukljuèene.

source: cannot create INET stream port
hr: nemoguæe kreiranje 'INET stream' porta

source: cannot create UNIX stream port
hr: nemoguæe kreirati UNIX stream port

source: fork failed: %s
hr: fork nije uspio: %s

source: %s is the PostgreSQL server.
hr: %s je PostgreSQL server.

source: Usage: %s [OPTION]...
hr: Kori¹tenje: %s [OPCIJA...]

source: Options:
hr: Opcije:

source: -A 1|0 enable/disable run-time assert checking
hr: -A 1|0 ukljuèi/iskljuèi 'run-time assert checking'

source: -B NBUFFERS number of shared buffers (default %d)
hr: -B NBUFFERS broj dijeljenih buffer-a (shared buffers) (inicijalno %d)

source: -c NAME=VALUE set run-time parameter
hr: -c NAME=VALUE postavljanje 'run-time' parametara

source: -d 1-5 debugging level
hr: -d 1-5 debugging nivo

source: -D DATADIR database directory
hr: -D DATADIR direktorij baze podataka

source: -F turn fsync off
hr: -F iskljuèi 'fsync'

source: -h HOSTNAME host name or IP address to listen on
hr: -h HOSTNAME ime host-a (host name) ili IP addresa na kojoj æe server raditi

source: -i enable TCP/IP connections
hr: -i omoguæi TCP/IP konekcije

source: -k DIRECTORY Unix-domain socket location
hr: -k DIRECTORY 'Unix-domain socket' lokacija

source: -l enable SSL connections
hr: -l omoguæi SSL konekcije

source: -N MAX-CONNECT maximum number of allowed connections (default %d)
hr: -N MAX-CONNECT maksimalan broj dozvoljenih veza(inicijalno %d)

source: -o OPTIONS pass 'OPTIONS' to each backend server
hr: -o OPTIONS proslijediti 'OPTIONS' za svaki 'backend server'

source: -p PORT port number to listen on (default %d)
hr: -p PORT broj porta na kojem æe server raditi (inicijalno %d)

source: -S silent mode (start in background without logging output)
hr: -S tihi mod (startaj u pozadini bez logiranja izlaza(logging output))

source: -n do not reinitialize shared memory after abnormal exit
hr: -n ne reinicijaliziraj dijeljenu memoriju(shared memory) nakon neregularnog izlaza

source: -s send SIGSTOP to all backend servers if one dies
hr: -s po¹alji SIGSTOP svim 'backend server'-ima ako jedan neregularno izaðe

source: Please read the documentation for the complete list of run-time configuration settings and how to set them on the command line or in the configuration file. Report bugs to <pgsql-bugs@postgresql.org>.
hr: Molimo pogledajte dokumentaciju za kompletnu listu 'run-time' konfiguracijskih parametara i kako ih postaviti iz komandne linije ili u konfiguracijskoj datoteci. Prijavite neipravnosti rada(bugs) na <pgsql-bugs@postgresql.org>.

source: incomplete startup packet
hr: nekompletan startni paket

source: invalid length of startup packet
hr: pogre¹na duljina startnog paketa

source: failed to send SSL negotiation response: %m
hr: Slanje 'SSL negotiation' odgovora nije uspjelo: %m

source: unsupported frontend protocol
hr: nepodr¾an 'frontend' protokol

source: no PostgreSQL user name specified in startup packet
hr: PostgreSQL korisnièko ime nije specificirano u startnom paketu

source: The database system is starting up
hr: Baza podataka se starta

source: The database system is shutting down
hr: Rad baze podataka je zaustavljen

source: The database system is in recovery mode
hr: Baza podataka je u 'recovery' modu

source: Sorry, too many clients already
hr: Na¾alost, previ¹e klijentskih veza je veæ otvoreno

source: processing cancel request: sending SIGINT to process %d
hr: procesiranje zahtjeva za odustajanjem(cancel request): slanje SIGINT procesu %d

source: bad key in cancel request for process %d
hr: pogre¹an kljuè u zahtjevu za odustajanjem(cancel request) za proces %d

source: bad pid in cancel request for process %d
hr: pogre¹an pid u zahtjevu za odustajanjem(cancel request) za process %d

source: smart shutdown request
hr: 'smart shutdown' zahtijev

source: shutdown process %d already running
hr: 'shutdown process' %d veæ radi

source: fast shutdown request
hr: 'fast shutdown' zahtijev

source: aborting any active transactions
hr: zaustavljanje svih aktivnih transakcija

source: immediate shutdown request
hr: 'immediate shutdown' zahtijev

source: shutdown process
hr: shutdown proces

source: startup process
hr: startup proces

source: aborting startup due to startup process failure
hr: zaustavljanje startup-a zbog 'startup process' pogre¹ke

source: startup process %d died while shutdown process %d already running
hr: startup proces %d uni¹ten za vrijeme 'shutdown process'-a %d veæ radi

source: all server processes terminated; reinitializing shared memory and semaphores
hr: svi serverski procesi terminirani; reinicijaliziram 'shared memory' i 'semaphores'

source: child process
hr: proces potomka

source: server process
hr: serverski proces

source: terminating any other active server processes
hr: terminiranje svih ostalih aktivnih serverskih procesa

source: %s (pid %d) exited with exit code %d
hr: %s (pid %d) iza¹ao sa 'exit code' %d

source: %s (pid %d) was terminated by signal %d
hr: %s (pid %d) je terminiran signalom %d

source: %s (pid %d) exited with unexpected status %d
hr: %s (pid %d) iza¹ao sa neoèekivanim statusom %d

source: connection startup failed
hr: startanje konekcije nije uspjelo

source: connection startup failed (fork failure): %s
hr: startanje konekcije nije uspjelo (fork failure): %s

source: connection received: host=%s port=%hu
hr: veza primljena: host=%s port=%hu

source: connection received: host=%s
hr: veza primljena: host=%s

source: connection authorized: user=%s database=%s
hr: veza autorizirana: host=%s database=%s

source: could not launch startup process (fork failure): %m
hr: nemoguæe pokretanje 'startup' procesa (fork failure): %m

source: could not launch checkpoint process (fork failure): %m
hr: nemoguæe pokretanje 'checkpoint' procesa (fork failure): %m

source: could not launch shutdown process (fork failure): %m
hr: nemoguæe pokretanje 'shutdown' procesa (fork failure): %m

source: cannot create file %s: %s
hr: nemoguæe kreiranje datoteke %s: %s

source: writing file %s failed
hr: pisanje u datoteku %s nije uspjelo

source: Attempt to insert rule "%s" failed: already exists
hr: Poku¹aj dodavanja pravila(rule) "%s" neuspjelo: veæ postoji

source: rule actions on OLD currently not supported use views or triggers instead
hr: akcije pravila(rule actions) nad OLD nisu trenutno podr¾ana koristite 'view' ili 'trigger' umjesto pravila

source: rule actions on NEW currently not supported use triggers instead
hr: akcije pravila(rule actions) nad NEW nisu trenutno podr¾ana koristite 'view' ili 'trigger' umjesto pravila

source: instead nothing rules on select currently not supported use views instead
hr: 'instead nothing' pravila trenutno za SELECT nisu podr¾ana koristite 'view' umjesto pravila

source: multiple action rules on select currently not supported
hr: vi¹estruke akcije pravila 'action rules' za SELECT trenutno nisu podr¾ana

source: only instead-select rules currently supported on select
hr: samo 'instead-select' pravila su trenutno podr¾ana za SELECT

source: select rule's target list has too many entries
hr: ciljna lista SELECT pravila(select rule) ima previ¹e stavaka

source: select rule's target entry %d has different column name from %s
hr: ciljna lista SELECT pravila(select rule) %d ima drugaèiji naziv kolone od %s

source: select rule's target entry %d has different type from attribute %s
hr: ciljna lista SELECT pravila(select rule) %d ima drugaèiji tip od atributa %s

source: select rule's target entry %d has different size from attribute %s
hr: ciljna lista SELECT pravila(select rule) %d ima drugaèiju velièinu od atributa od %s

source: select rule's target list has too few entries
hr: ciljna lista SELECT pravila(select rule) ima premalo stavaka

source: "%s" is already a view
hr: "%s" je veæ 'view'

source: view rule for "%s" must be named "%s"
hr: 'view rule' za "%s" mora biti imenovan "%s"

source: Relation "%s" is not empty. Cannot convert it to view
hr: Relacija "%s" nije prazna. Nemoguæe konvertiranje u 'view'

source: Attempt to rename rule "%s" failed: "%s" already exists
hr: Poku¹aj preimenovanja 'rule'-a "%s" nije uspio: "%s" veæ postoji

source: Multiple assignments to same attribute "%s"
hr: Vi¹estruko dodijeljivanje istom atributu "%s"

source: query rewritten %d times, may contain cycles
hr: upit prepisa(rewritten) %d puta, mo¾da sadr¾i cirkularnu definiciju

source: Rule "%s" not found
hr: 'Rule' "%s" nije naðen

source: RemoveRewriteRuleById: Rule %u does not exist
hr: RemoveRewriteRuleById: Pravilo(rule) %u ne postoji

source: LruDelete: failed to close %s: %m
hr: LruDelete: neuspjelo zatvaranje %s: %m

source: FileClose: failed to close %s: %m
hr: FileClose: neuspjelo zatvaranje %s: %m

source: FileClose: failed to unlink %s: %m
hr: FileClose: neuspjelo prekidanje veze %s: %m

source: CSTRING not supported in fastpath protocol
hr: CSTRING nepodr¾an u 'fastpath' protokolu

source: Message from PostgreSQL backend: The Postmaster has informed me that some other backend died abnormally and possibly corrupted shared memory. I have rolled back the current transaction and am going to terminate your database system connection and exit. Please reconnect to the database system and repeat your query.
hr: Poruka od PostgreSQL 'backend' procesa: Postmaster me obavijestio da je neki drugi 'backend' proces neregularno zaustavljen, i vjerovatno koruptirao dijeljenu memoriju(shared memory). Napravljen je 'roll back' svih tekuæih transakcija i bit æe prekinuta va¹a veza sa serverom. Molimo da se ponovno spojite na server i ponovite va¹ upit(query).

source: This connection has been terminated by the administrator.
hr: Ova veza je prekinuta od strane administratora.

source: Query was cancelled.
hr: Uput(Query) je otkazan

source: Assert checking is not compiled in
hr: 'Assert checking' nije ukompajliran

source: only one -x flag is allowed
hr: samo jedan -x flag je dozvoljen

source: use -x {off,nor,nopull,nopm,pullall,wait}
hr: koristite -x {off,nor,nopull,nopm,pullall,wait}

source: Query statistics are disabled because parser, planner, or executor statistics are on.
hr: Statistika upita je iskljuèena jer je statistika 'parser'-a, 'planner'-a, ili 'executor'-a ukljuèena.

source: %s: invalid command line arguments Try -? for help.
hr: %s: pogre¹an argument komandne linije Poku¹ajte -? za pomoæ.

source: %s: user name undefined and no database specified
hr: %s: korisnièko ime nedefinirano i baza podataka nije specificirana

source: unknown frontend message was received
hr: nepoznata 'frontend' poruka je poslana

source: CreateCommandTag: unknown parse node type %d
hr: CreateCommandTag: nepoznat tip 'parse' noda: %d

source: Closing pre-existing portal "%s"
hr: Zatvaram veæ postojeæi portal "%s"

source: "%s" is not %s %s. Use DROP %s to remove %s %s
hr: "%s" nije %s %s. Koristite DROP %s da bi obrisali %s %s

source: "%s" is not %s %s
hr: "%s" nije %s %s

source: %s "%s" does not exist
hr: %s "%s" ne postoji

source: %s "%s" is a system %s
hr: %s "%s" je sistemski %s

source: relation "%s" is a system catalog
hr: relacija "%s" je sistemski katalog

source: ALTER TABLE: permission denied
hr: ALTER TABLE: zabranjen pristup
