Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: You must have Postgres superuser privilege to use server-side lo_export(). Anyone can use the client-side lo_export() provided by libpq.
hr: Morate imati 'Postgres superuser' privilegije da biste koristil serverski 'lo_export()'. Svaki korisnik mo¾e koristiti 'client-side lo_export()' omoguæen u libpq biblioteci.

source: lo_export: can't open inv object %u
hr: lo_export: nemoguæe otvaranje 'inv object'-a %u

source: lo_export: can't open unix file "%s": %m
hr: lo_export: nemoguæe otvaranje unix datoteke "%s": %m

source: lo_export: error while writing "%s"
hr: lo_export: gre¹ka kod zapisivanja "%s"

source: failed to create SSL context: %s
hr: neuspjelo kreiranje SSL konteksta: %s

source: failed to load server certificate (%s): %s
hr: neuspjelo uèitavanje serverskog certifikata (%s): %s

source: failed to stat private key file (%s): %s
hr: neuspjelo uèitavanje datoteke privatnog kljuèa (%s): %s

source: bad permissions on private key file (%s)
hr: pogre¹ne privilegije nad datotekom privatnog kljuèa (%s)

source: failed to load private key file (%s): %s
hr: neuspjelo uèitavanje datoteke privatnog kljuèa (%s): %s

source: check of private key failed: %s
hr: neuspjela provjera privatnog kljuèa: %s

source: could not read root cert file (%s): %s
hr: nemoguæe otvoriti datoteku certifikata (%s): %s

source: failed to initialize SSL connection: %s
hr: neuspjela inicijalizacija SSL konekcije: %s

source: secure connection from '%s'
hr: sigurna veza(secure connection= od '%s'

source: Password is stored MD5 encrypted. 'password' and 'crypt' auth methods cannot be used.
hr: Zaporka je spremljena u MD5 enkripciji. 'password' i 'crypt' metode autentifikacije ne mogu biti kori¹tene.

source: Token too long in authentication file, skipping, %s
hr: Token predugaèak u autentifikacijskoj datoteci , preskaèem, %s

source: could not open %s: %m
hr: nemoguæe otvaranje %s: %m

source: load_hba: Unable to open authentication config file "%s": %m
hr: load_hba: nemoguæe otvaranje konfiguracije autentifikacije datoteke "%s": %m

source: parse_ident_usermap: invalid syntax in pg_ident.conf file at line %d, token "%s"
hr: parse_ident_usermap: pogre¹na sintaksa u pg_ident.conf datoteci u liniji %d, token "%s"

source: load_ident: Unable to open usermap file "%s": %m
hr: load_ident: Nemoguæe otvaranje 'usermap' datoteke "%s": %m

source: No such group as '%s'
hr: Takva grupa ne postoji '%s'

source: Could not set group of %s: %m
hr: Nemoguæe setiranje grupe %s: %m

source: Could not set permissions on %s: %m
hr: Nemoguæe setiranje prava pristupa za %s: %m

source: StreamConnection: accept() failed: %m
hr: StreamConnection: accept() nije uspio: %m

source: StreamConnection: getsockname() failed: %m
hr: StreamConnection: getsockname() nije uspio: %m

source: StreamConnection: setsockopt(TCP_NODELAY) failed: %m
hr: StreamConnection: setsockopt(TCP_NODELAY) nije uspio: %m

source: pq_recvbuf: recv() failed: %m
hr: pq_recvbuf: recv() neuspje¹an: %m

source: pq_recvbuf: unexpected EOF on client connection
hr: pq_recvbuf: neoèekivani EOF na klijentskoj vezi

source: pq_flush: send() failed: %m
hr: pq_flush: send() neuspje¹an: %m

source: pq_eof: recv() failed: %m
hr: pq_eof: recv() neuspje¹an: %m

source: pq_sendint: unsupported size %d
hr: pq_sendint: nepodr¾ana velièina %d

source: pq_getint: unsupported size %d
hr: pq_getint: nepodr¾ana velièina %d

source: %s: setsysinfo failed: %s
hr: %s: 'setsysinfo' neuspje¹an: %s

source: "root" execution of the PostgreSQL server is not permitted. The server must be started under an unprivileged user id to prevent a possible system security compromise. See the documentation for more information on how to properly start the server.
hr: "root" izvr¹avanje PostgreSQL servera nije dozvoljeno. Server mora biti startan sa privilegiranim korisnikom da bi spreèio moguæe sistemske sigurnosne kompromise. Za vi¹e informacija kako ispravno startati server pogledajte dokumentaciju.

source: %s: invalid current euid %d
hr: %s: pogre¹an trenutni 'euid' %d

source: _copyAConst: unknown node type %d
hr: _copyAConst: nepoznat tip noda: %d

source: _copyValue: unknown node type %d
hr: _copyValue: nepoznat tip noda: %d

source: copyObject: don't know how to copy node type %d
hr: copyObject: nepoznata metoda kopiranja za tip noda %d

source: _equalParam: Invalid paramkind value: %d
hr: _equalParam: Pogre¹na 'paramkind' vrijednost: %d

source: _equalValue: unknown node type %d
hr: _equalValue: nepoznat tip noda: %d

source: equal: don't know whether nodes of type %d are equal
hr: equal: nepoznato jesu li nodovi tipa %d jednaki

source: tryout to nconc a list to itself
hr: poku¹aj dodavanja(nconc) liste na samu sebe

source: _outValue: don't know how to print type %d
hr: _outValue: nepoznato kako ispisati tip %d

source: _outNode: don't know how to print type %d
hr: _outNode: nepoznato kako ispisati tip %d

source: Cache lookup for type %u failed
hr: Tra¾enje tipa %u u cache-u nije uspjelo

source: nodeRead: did not find '}' at end of plan node
hr: nodeRead: nije naðen '}' na kraju plan noda

source: nodeRead: Bad type %d
hr: nodeRead: Pogre¹an tip %d

source: toIntList: unexpected datatype
hr: toIntList: neoèekivan tip podataka

source: toOidList: unexpected datatype
hr: toOidList: neoèekivan tip podataka

source: _readExpr: unknown opType "%.*s"
hr: _readExpr: nepoznat opType "%.*s"

source: badly formatted planstring "%.10s"...
hr: lo¹e formatiran 'planstring' "%.10s"...

source: readDatum: expected '%s', got '%s'; length = %lu
hr: readDatum: oèekivan '%s', dobiven '%s'; du¾ina = %lu

source: gimme_gene: Internal error - minimum_count not set
hr: gimme_gene: interna gre¹ka - minimum_count nije setiran

source: SELECT FOR UPDATE is not supported for inherit queries
hr: SELECT FOR UPDATE nije podr¾an za nasljeðene upite

source: recurse_pushdown_safe: unexpected node %d
hr: recurse_pushdown_safe: neoèekivan tip noda %d

source: recurse_push_qual: unexpected node %d
hr: recurse_push_qual: neoèekivan nod %d

source: set_joinrel_size_estimates: unsupported join type %d
hr: set_joinrel_size_estimates: nepodr¾an join tip %d

source: extract_or_indexqual_conditions: no matching clause
hr: extract_or_indexqual_conditions: nema odgovarajuæe klauzule

source: pred_test_simple_clause: unknown test_op
hr: pred_test_simple_clause: nepoznat test_op

source: pred_test_simple_clause: null test result
hr: pred_test_simple_clause: null test rezultat

source: prefix_quals: unexpected operator %u
hr: prefix_quals: neoèekivan operator %u

source: prefix_quals: no = operator for type %u
hr: prefix_quals: nema = operator za tip %u

source: prefix_quals: no >= operator for type %u
hr: prefix_quals: nema >= operatora za tip %u

source: prefix_quals: no < operator for type %u
hr: prefix_quals: nema < operatora za tip %u

source: network_prefix_quals: unexpected operator %u
hr: network_prefix_quals: neoèekivan operator %u

source: network_prefix_quals: no %s operator for type %u
hr: network_prefix_quals: nema %s operatora za tip %u

source: network_prefix_quals: no <= operator for type %u
hr: network_prefix_quals: nema <= operatora za tip %u

source: sort_inner_and_outer: unexpected join type %d
hr: sort_inner_and_outer: neoèekivan 'join' tip %d

source: match_unsorted_outer: unexpected join type %d
hr: match_unsorted_outer: neoèekivan 'join' tip %d

source: match_unsorted_inner: unexpected join type %d
hr: match_unsorted_inner: neoèekivan 'join' tip %d

source: make_rels_by_joins: failed to build any %d-way joins
hr: make_rels_by_joins: neuspjelo graðenje ijednog %d-smjernog 'join'-a

source: make_jointree_rel: unexpected node type %d
hr: make_jointree_rel: neoèekivan tip noda %d

source: make_join_rel: unsupported join type %d
hr: make_join_rel: nepodr¾an 'join' tip %d

source: create_plan: unknown pathtype %d
hr: create_plan: pgre¹an 'pathtype' %d

source: create_scan_plan: unknown node type: %d
hr: create_scan_plan: nepoznat tip noda: %d

source: create_join_plan: unknown node type: %d
hr: create_join_plan: nepoznat tip noda: %d

source: fix_indxqual_sublist: indexqual clause is not binary opclause
hr: fix_indxqual_sublist: 'indexqual' klauzula nije binarna 'opclause'

source: fix_indxqual_operand: var is not index attribute
hr: fix_indxqual_operand: var nije indeksni atribut

source: make_sort_from_pathkeys: cannot find tlist item to sort
hr: make_sort_from_pathkeys: namoguæe pronaèi 'list item' za sortiranje

source: SELECT FOR UPDATE cannot be applied to a join
hr: SELECT FOR UPDATE ne mo¾e biti apliciran na 'JOIN'NULL

source: add_base_rels_to_query: unexpected node type %d
hr: add_base_rels_to_query: neoèekivan tip noda %d

source: UNION JOIN is not implemented yet
hr: UNION JOIN jo¹ nije implementiran

source: SELECT FOR UPDATE cannot be applied to the nullable side of an OUTER JOIN
hr: SELECT FOR UPDATE ne mo¾e biti upotrijebljen sa 'OUTER JOIN'-om koji vraæa NULL

source: JOIN qualification may not refer to other relations
hr: JOIN kvalifikacija mo¾da ne referencira druge relacije

source: Unable to identify an equality operator for types '%s' and '%s'
hr: Nemoguæe identificirati operator jednakosti za tipove '%s' i '%s'

source: Equality operator for types '%s' and '%s' should be mergejoinable, but isn't
hr: Operator jednakosti za tipove '%s' i '%s' trebao bi bit spjiv(mergejoinable), ali nije

source: SELECT FOR UPDATE is not allowed in subselects
hr: SELECT FOR UPDATE nije dozvoljen u kombinaciji sa 'subselect'

source: cache lookup failed for operator %u
hr: tra¾enje operatora %u u cache-u nije uspjelo

source: Aggregate function calls may not be nested
hr: Pozivi agregatnih funkcija ne mogu biti ugnje¾ðeni

source: Sub-SELECT uses un-GROUPed attribute %s.%s from outer query
hr: Sub-SELECT koristi ne-GROUP-iran atribut %s.%s iz vanjskog upta

source: Function OID %u does not exist
hr: Funkcijski OID %u ne postoji

source: Unable to devise a query plan for the given query
hr: Nemoguæe pronaæi 'query plan' za zadani upit

source: build_base_rel: rel already exists
hr: build_base_rel: rel veæ postoji

source: make_base_rel: unsupported RTE kind %d
hr: make_base_rel: nepodr¾an 'RTE' tip %d

source: CREATE VIEW specifies more column names than columns
hr: CREATE VIEW specificira vi¹e imena kolona nego ¹to je zadano kolona

source: INSERT ... SELECT may not specify INTO
hr: INSERT ... SELECT mo¾da nije specificiran INTO

source: INSERT has more expressions than target columns
hr: INSERT ima vi¹e izraza nego ciljnih kolona

source: INSERT has more target columns than expressions
hr: INSERT ima vi¹e ciljnih kolona nego izraza

source: parser: unrecognized node (internal error)
hr: parser: nepoznat nod (internal error)

source: %s will create implicit sequence '%s' for SERIAL column '%s.%s'
hr: %s æe implicitno kreirati sekvencu '%s' za SERIAL kolonu '%s.%s'

source: %s/(NOT) NULL conflicting declaration for '%s.%s'
hr: %s/(NOT) NULL u konfliktu sa deklaracijom za '%s.%s'

source: %s/DEFAULT multiple values specified for '%s.%s'
hr: %s/DEFAULT vi¹estruke vrijednosti definirane za '%s.%s'

source: %s / PRIMARY KEY multiple primary keys for table '%s' are not allowed
hr: %s / PRIMARY KEY vi¹estruki primarni kljuèevi za tabelu '%s' nisu dozvoljeni

source: inherited table "%s" is not a relation
hr: nasljeðena tablica "%s" nije relacija

source: inherited attribute "%s" cannot be a PRIMARY KEY because it is not marked NOT NULL
hr: nasljeðeni atribut "%s" ne mo¾e biti PRIMARY KEY jer nije oznaèen kao NOT NULL

source: Existing attribute "%s" cannot be a PRIMARY KEY because it is not marked NOT NULL
hr: Postojeæi atribut "%s" ne mo¾e biti PRIMARY KEY jer nije oznaèen kao NOT NULL

source: %s: column "%s" named in key does not exist
hr: %s: kolona "%s" imenovana u kljuèu ne postoji

source: %s: column "%s" appears twice in %s constraint
hr: %s: kolona "%s" se pojavljuje dva puta u %s 'constraint'-u

source: %s: failed to make implicit index name
hr: %s: neuspje¹no kreiranje implicitnog imena indeksa

source: %s / %s%s will create implicit index '%s' for table '%s'
hr: %s / %s%s æe kreirati implicitni indeks '%s' za tabelu '%s'

source: %s will create implicit trigger(s) for FOREIGN KEY check(s)
hr: %s æe kreirati implicitni 'trigger'(e) za FOREIGN KEY provjeru(e)

source: Rule WHERE condition may not contain references to other relations
hr: WHERE uvjet ne mo¾e sadr¾avati reference na druge relacije

source: Rule WHERE condition may not contain aggregate functions
hr: WHERE uvjet ne mo¾e sadr¾avati agregatne funkcije

source: Rules with WHERE conditions may only have SELECT, INSERT, UPDATE, or DELETE actions
hr: WHERE klauzula mo¾e imati samo, INSERT, UPDATE, ili DELETE akcije

source: ON SELECT rule may not use OLD
hr: 'ON SELECT rule' ne smije korisitit OLD

source: ON SELECT rule may not use NEW
hr: 'ON SELECT rule' ne smije korisitit NEW

source: ON INSERT rule may not use OLD
hr: 'ON INSERT rule' ne smije korisitit OLD

source: ON DELETE rule may not use NEW
hr: 'ON DELETE rule' ne smije korisitit NEW

source: DECLARE CURSOR must not specify INTO
hr: DECLARE CURSOR ne smije imati INTO klauzulu

source: DECLARE/UPDATE is not supported Cursors must be READ ONLY
hr: DECLARE/UPDATE nije podr¾an Cursors mora biti READ ONLY

source: ORDER BY on a UNION/INTERSECT/EXCEPT result must be on one of the result columns
hr: ORDER BY u UNION/INTERSECT/EXCEPT rezultat mora biti iz jedne od rezultantnih kolona

source: INTO is only allowed on first SELECT of UNION/INTERSECT/EXCEPT
hr: INTO dozvoljen samo u prvom SELECT u UNION/INTERSECT/EXCEPT

source: Portal may not appear in UNION/INTERSECT/EXCEPT
hr: Portal se mo¾da ne pojavljuje u UNION/INTERSECT/EXCEPT

source: Each %s query must have the same number of columns
hr: Svaki %s upit mora imati jednak broj kolona

source: CREATE TABLE AS specifies too many column names
hr: CREATE TABLE AS specificirao previ¹e naziva kolona

source: Unexpected node type in ALTER TABLE ADD CONSTRAINT
hr: Neoèekivan tip stavke u ALTER TABLE ADD CONSTRAINT

source: Wrong number of parameters, expected %d but got %d
hr: Neispravan broj parametara, oèekivano %d, primljeno %d

source: Cannot use subselects in EXECUTE parameters
hr: Nemoguæe koristiti 'subselect'-e u EXECUTE parametrima

source: Cannot use aggregates in EXECUTE parameters
hr: Nemoguæe koristiti agregate u EXECUTE parametrima

source: Parameter $%d of type %s cannot be coerced into the expected type %s You will need to rewrite or cast the expression
hr: Parametar $%d je tipa %s, ne mo¾e bit konvertiran u oèekivani tip %s Morate izraz napisati drugaèije ili upotrijebiti 'cast'

source: SELECT FOR UPDATE is not allowed with DISTINCT clause
hr: SELECT FOR UPDATE nije dozvoljen u kombinaciji sa DISTINCT klauzulom

source: SELECT FOR UPDATE is not allowed with GROUP BY clause
hr: SELECT FOR UPDATE nije dozvoljen u kombinaciji sa GROUP BY klauzulom

source: SELECT FOR UPDATE is not allowed with AGGREGATE
hr: SELECT FOR UPDATE nije dozvoljen u kombinaciji sa AGGREGATE klauzulom

source: FOR UPDATE: relation "%s" not found in FROM clause
hr: FOR UPDATE: relacija "%s" nije naðena u FROM klauzuli

source: Misplaced DEFERRABLE clause
hr: Pogre¹no smje¹tena DEFERRABLE klauzula

source: Multiple DEFERRABLE/NOT DEFERRABLE clauses not allowed
hr: Vi¹estruke DEFERRABLE/NOT DEFERRABLE klauzule nisu dozvoljene

source: Misplaced NOT DEFERRABLE clause
hr: Pogre¹no smje¹tena NOT DEFERRABLE klauzula

source: INITIALLY DEFERRED constraint must be DEFERRABLE
hr: 'INITIALLY DEFERRED constraint' mora biti 'DEFERRABLE'

source: Misplaced INITIALLY DEFERRED clause
hr: Krivo smje¹tena INITIALLY DEFERRED klauzula

source: Multiple INITIALLY IMMEDIATE/DEFERRED clauses not allowed
hr: Vi¹estruka INITIALLY IMMEDIATE/DEFERRED klauzula nije dopu¹tena

source: Misplaced INITIALLY IMMEDIATE clause
hr: Krivo smje¹tena INITIALLY IMMEDIATE klauzula

source: Attribute %s.%s must be GROUPed or used in an aggregate function
hr: Atribut %s.%s mora biti grupiran (GROUP) ili kori¹ten u agregatnoj funkciji

source: Aggregates not allowed in WHERE clause
hr: Agregati nisu dozvoljeni u WHERE klauzuli

source: Aggregates not allowed in JOIN conditions
hr: Agregati nisu dozvoljeni u JOIN uvjetu

source: Aggregates not allowed in GROUP BY clause
hr: Agregati nisu dozvoljeni u GROUP BY klauzuli

source: JOIN/ON clause refers to "%s", which is not part of JOIN
hr: JOIN/ON klauzula referencira "%s", koji nije dio JOIN klauzule

source: sub-select in FROM must have an alias
hr: 'sub-select' u FROM mora imati alias

source: Unexpected parse analysis result for subselect in FROM
hr: Neoèekivana analiza rezultata za subselect u FROM klauzuli

source: Expected SELECT query from subselect in FROM
hr: Oèekivan SELECT upit(query) u 'subselect'-u specificiranom u FROM klauzuli

source: Subselect in FROM may not have SELECT INTO
hr: 'Subselect' u FROM klauzuli nema SELECT INTO izraz

source: FROM function expression may not refer to other relations of same query level
hr: FROM funkcijski izraz mo¾da ne referencira druge relacije na istom nivou upita(query)

source: cannot use aggregate function in FROM function expression
hr: nedozvoljeno kori¹tenje agregatne funkcije u 'FROM function' izrazu

source: Coercion function not allowed in FROM clause
hr: Prinudne funkcije(Coercion function) nisu dozvoljene u FROM klauzuli

source: USING column name "%s" appears more than once
hr: USING ime kolone "%s" pojavljuje se vi¹e puta

source: Common column name "%s" appears more than once in left table
hr: Uobièajeno ime kolone "%s" pojavljuje se vi¹e nego jednom u lijevoj tabeli

source: JOIN/USING column "%s" not found in left table
hr: JOIN/USING kolona "%s" nije naðena u lijevoj tabeli

source: Common column name "%s" appears more than once in right table
hr: Uobièajeno ime kolone "%s" pojavljuje se vi¹e nego jednom u desnoj tabeli

source: JOIN/USING column "%s" not found in right table
hr: JOIN/USING kolona "%s" nije naðena u desnoj tabeli

source: Column alias list for "%s" has too many entries
hr: Lista naziva kolona za "%s" ima previ¹e stavki

source: buildMergedJoinVar: unexpected jointype %d
hr: buildMergedJoinVar: nepodr¾an join tip %d

source: %s '%s' is ambiguous
hr: %s '%s' je problematièan

source: Non-integer constant in %s
hr: Necijelobrojna(Non-integer) konstanta u %s

source: %s position %d is not in target list
hr: %s pozicija %d nije u listi ciljeva

source: For SELECT DISTINCT, ORDER BY expressions must appear in target list
hr: U SELECT DISTINCT izrazu , ORDER BY izraz mora biti u ciljnoj listi

source: SELECT DISTINCT ON expressions must match initial ORDER BY expressions
hr: SELECT DISTINCT ON izraz mora odgovarati inicijalnom ORDER BY izrazu

source: coerce_type: no conversion function from %s to %s
hr: coerce_type: nema funkcije za konverziju iz %s u %s

source: coerce_type_constraints: failed to lookup type %u
hr: coerce_type_constraints: neuspjelo tra¾enje tipa %u

source: Argument of %s must be type boolean, not type %s
hr: Argument %s mora biti logièkog(boolean), a ne %s tipa

source: Argument of %s must not be a set function
hr: Argument %s ne mo¾e biti funkcija koja vraæa set

source: %s types '%s' and '%s' not matched
hr: %s tipovi '%s' i '%s' ne odgovaraju

source: %s unable to convert to type %s
hr: %s neuspje¹no konvertiranje u tip %s

source: Expression too complex: nesting depth exceeds max_expr_depth = %d
hr: Expression too complex: dubina ugnje¾ðenja prelazi max_expr_depth = %d

source: Parameter '$%d' is out of range
hr: Parametar '$%d' je van opsega

source: Bad query in subselect
hr: Pogre¹an upit(query) u 'subselect'-u

source: Subselect must have a field
hr: 'Subselect' mora imati polje

source: Subselect must have only one field
hr: 'Subselect' mora imati samo jedno polje

source: Row comparison cannot use operator %s
hr: Usporedba retka ne mo¾e koristiti operator %s

source: Subselect has too many fields
hr: 'Subselect' ima previ¹e polja

source: %s has result type of %s, but must return %s to be used with quantified predicate subquery
hr: '%s' ima rezultantni tip %s, ali mora vratiti %s da bi bio kori¹ten u 'quantified predicate subquery'

source: %s must not return a set to be used with quantified predicate subquery
hr: %s ne mo¾e vratiti set da bi bio kori¹ten u 'quantified predicate subquery'

source: Subselect has too few fields
hr: 'Subselect' ima premalo polja

source: transformExpr: unexpected booltesttype %d
hr: transformExpr: neoèekivan booltesttype %d

source: transformExpr: does not know how to transform node %d (internal error)
hr: transformExpr: nepoznata metoda transformacije noda %d (internal error)

source: Attribute "%s" not found
hr: Atribut "%s" nije naðen

source: Invalid qualified name syntax (too many names)
hr: Pogre¹na 'qualified name' sintaksa (previ¹e imena)

source: exprType: Cannot get type for untransformed sublink
hr: exprType: Nepoznat tip za 'untransformed sublink'

source: exprType: Do not know how to get type for %d node
hr: exprType: Nepoznat tip za %d nod

source: Cannot cast type %s to %s
hr: Nemoguæe konvertiranje(cast) tipa %s u %s

source: Cannot pass more than %d arguments to a function
hr: Nemoguæe slanje vi¹e od %d argumenata funkciji

source: Function '%s' does not allow NULL input
hr: Funkcija '%s' ne dozvoljava NULL ulaz

source: Cannot find type OID for relation %u
hr: 'type OID'-a za relaciju %u nije naðen

source: Cannot pass result of sub-select or join %s to a function
hr: Nemoguæe proslijediti rezultat 'sub-select'-a ili 'join'-a %s u funkciju

source: %s(*) specified, but %s is not an aggregate function
hr: %s(*) specificiran, ali %s nije agregatna funkcija

source: DISTINCT specified, but %s is not an aggregate function
hr: DISTINCT specificiran, ali %s nije agregatna funkcija

source: Attribute notation .%s applied to type %s, which is not a complex type
hr: Attribute notation .%s namijenjen za tip %s, koji nije kompleksan tip

source: Attribute "%s" not found in datatype %s
hr: Atribut "%s" nije naðen u tipu podataka %s

source: Aggregates may not return sets
hr: Pozivi agregatnih funkcija ne mogu vraæati set

source: No such attribute %s.%s.%s
hr: Nepostojeæi atribut %s.%s.%s

source: No such attribute %s.%s
hr: Nepostojeæi atribut %s.%s

source: Function %s(%s) does not exist%s%s
hr: Funkcija %s(%s) ne postoji %s%s

source: %s: function %s(%s) does not exist%s%s
hr: %s: funkcija %s(%s) ne postoji %s%s

source: %s: aggregate %s(*) does not exist
hr: %s: agregat %s(*) ne postoji

source: %s: aggregate %s(%s) does not exist
hr: %s: agregat %s(%s) ne postoji

source: %s: function %s(*) is not an aggregate
hr: %s: funkcija %s(*) nije agregatna

source: %s: function %s(%s) is not an aggregate
hr: %s: funkcija %s(%s) nije agregatna

source: array index expressions must be integers
hr: Indeksni izrazi za nizove moraju biti cijelobrojni(integer)

source: Array assignment requires type %s but expression is of type %s You will need to rewrite or cast the expression
hr: Dodjeljivanje niza zahtijeva tip %s ali izraz je tipa %s Morat æete drugaèije napisati ili konvertirati(cast) izraz

source: %s: Prefix operator '%s' for type '%s' does not exist
hr: %s: Prefiks operator '%s' za tip %s ne postoji

source: %s: Postfix operator '%s' for type '%s' does not exist
hr: %s: Postfiks operator '%s' za tip %s ne postoji

source: %s: Operator '%s' for types '%s' and '%s' does not exist
hr: %s: Operator '%s' za tipove '%s' i '%s' ne postoji

source: Unable to identify an ordering operator '%s' for type '%s' Use an explicit ordering operator or modify the query
hr: Neuspjelo identificiranje operatora redosljeda(ordering operator) '%s' za tip '%s' Koristite explicitni operator redosljeda, ili drugaèije napi¹ite upit

source: Left hand side of operator '%s' has an unknown type Probably a bad attribute name
hr: Izraz sa lijeve strane operatora '%s' ima nepoznat tip Vjerovatno pogre¹no ime atributa
