Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: GetTupleForTrigger: failed ReadBuffer
hr: GetTupleForTrigger: 'ReadBuffer' nije uspio

source: DeferredTriggerExecute: failed to fetch old tuple
hr: DeferredTriggerExecute: neuspio pristup starom slogu

source: DeferredTriggerExecute: failed to fetch new tuple
hr: DeferredTriggerExecute: neuspio pristup novom slogu

source: DeferredTriggerExecute: can't find trigger %u
hr: DeferredTriggerExecute: nemoguæe pranaæi trigger %u

source: deferredTriggerInvokeEvents: relation %u has no triggers
hr: deferredTriggerInvokeEvents: relacija %u nema 'trigger'-a

source: DeferredTriggerBeginXact() called while inside transaction
hr: DeferredTriggerBeginXact() pozvan iz unutra¹njosti transakcije

source: unnamed constraints cannot be set explicitly
hr: neimenovani 'constraint'-i nemogu biti zadani eksplicitno

source: Constraint '%s' is not deferrable
hr: Constraint '%s' nije uklonjiv

source: Constraint '%s' does not exist
hr: Constraint '%s' ne postoji

source: DeferredTriggerSaveEvent() called outside of transaction
hr: DeferredTriggerSaveEvent() pozvan izvan transakcije

source: DefineType: type names must be %d characters or less
hr: DefineType: imena tipova moraju imati %d ili manje znakova

source: DefineType: "%s" alignment not recognized
hr: DefineType: "%s" poravnanje nije poznato

source: DefineType: "%s" storage not recognized
hr: DefineType: "%s" skladi¹tenje(storage) nije poznato

source: DefineType: attribute "%s" not recognized
hr: DefineType: atribut "%s" nije poznat

source: Define: "input" unspecified
hr: Define: "input" nije specificiran

source: Define: "output" unspecified
hr: Define: "output" nije specificiran

source: Type input function %s must return %s
hr: Ulazna funkcija tipa %s() mora vratiti %s

source: Type output function %s must return cstring
hr: Izlazna funkcija tipa %s() mora vratiti cstring

source: RemoveTypeById: type %u not found
hr: RemoveTypeById: tip %u nije naðen

source: CREATE DOMAIN: domain names must be %d characters or less
hr: CREATE DOMAIN: imena domena moraju imati %d ili manje znakova

source: DefineDomain: %s is not a basetype
hr: DefineDomain: %s nije bazni tip

source: CREATE DOMAIN has multiple DEFAULT expressions
hr: CREATE DOMAIN ima vi¹estrki DEFAULT izraz

source: CREATE DOMAIN has conflicting NULL / NOT NULL constraint
hr: CREATE DOMAIN ima konfliktni NULL / NOT NULL 'constraint'

source: CREATE DOMAIN / UNIQUE indexes not supported
hr: CREATE DOMAIN / UNIQUE indeksi nisu podr¾ani

source: CREATE DOMAIN / PRIMARY KEY indexes not supported
hr: CREATE DOMAIN / PRIMARY KEY indeksi nisu podr¾ani

source: DefineDomain: CHECK Constraints not supported
hr: DefineDomain: CHECK Constraints nisu podr¾ani

source: DefineDomain: DEFERRABLE, NON DEFERRABLE, DEFERRED and IMMEDIATE not supported
hr: DefineDomain: DEFERRABLE, NON DEFERRABLE, DEFERRED i IMMEDIATE nisu podr¾ani

source: DefineDomain: unrecognized constraint node type
hr: DefineDomain: nepoznat 'constraint node' tip

source: RemoveDomain: type "%s" does not exist
hr: RemoveDomain: tip '%s' ne postoji

source: %s is not a domain
hr: %s nije 'domain'

source: attempted to define composite type relation with no attrs
hr: poku¹aj definiranja virtualnie relacije bez atributa

source: write_group_file: unable to write %s: %m
hr: write_group_file: neuspjelo pisanje %s: %m

source: Invalid group name '%s'
hr: Pogre¹no ime grupe '%s'

source: Invalid user name '%s'
hr: Pogre¹no ime korisnika '%s'

source: rename %s to %s: %m
hr: preimenovati %s u %s: %m

source: write_user_file: unable to write %s: %m
hr: write_group_file: neuspje¹no pisanje %s: %m

source: Invalid user password '%s'
hr: Pogre¹na zaporka korisnika '%s'

source: CREATE USER: conflicting options
hr: CREATE USER: opcije u konfliktu

source: CREATE USER: option "%s" not recognized
hr: CREATE USER: opcija "%s" nije poznata

source: user id must be positive
hr: korisnièi 'id' mora biti pozitivan

source: CREATE USER: permission denied
hr: CREATE USER: zabranjen pristup

source: CREATE USER: user name "%s" is reserved
hr: CREATE USER: korisnik pod imenom "%s" je rezerviran

source: CREATE USER: user name "%s" already exists
hr: CREATE USER: korisnik pod imenom "%s" veæ postoji

source: CREATE USER: sysid %d is already assigned
hr: CREATE USER: 'sysid' %d je veæ dodijeljen

source: CREATE USER: password encryption failed
hr: CREATE USER: enkripcija zaporke nije uspjela

source: ALTER USER: conflicting options
hr: ALTER USER: opcije u konfliktu

source: ALTER USER: option "%s" not recognized
hr: ALTER USER: opcija "%s" nije poznata

source: ALTER USER: permission denied
hr: ALTER USER: zabranjen pristup

source: ALTER USER: user "%s" does not exist
hr: ALTER USER: korisnik "%s" ne postoji

source: DROP USER: permission denied
hr: DROP USER: pristup zabranjen

source: DROP USER: user "%s" does not exist (no users removed)
hr: DROP USER: korisnik "%s" ne postoji (niti jedan korisnik nije obrisan)

source: DROP USER: user "%s" does not exist
hr: DROP USER: korisnik "%s" ne postoji

source: current user cannot be dropped
hr: trenutni korisnik ne mo¾e biti obrisan

source: session user cannot be dropped
hr: korisnik u trenutnom okru¾enju ne mo¾e biti obrisan

source: DROP USER: user "%s" owns database "%s", cannot be removed%s
hr: DROP USER: korisnik "%s" je vlasnik baze podataka "%s", ne mo¾e biti obrisan %s

source: CheckPgUserAclNotNull: "%s" not found
hr: CheckPgUserAclNotNull: "%s" nije naðen

source: To use passwords, you have to revoke permissions on %s so normal users cannot read the passwords. Try 'REVOKE ALL ON "%s" FROM PUBLIC'.
hr: Da biste koristili zaporke, morate zabraniti pristup(revoke permission) prema %s tako da regularni korisnici ne mogu proèitati zaporke. Poku¹ajte 'REVOKE ALL ON "%s" FROM PUBLIC'.

source: CREATE GROUP: conflicting options
hr: CREATE GROUP: opcije u konfliktu

source: CREATE GROUP: option "%s" not recognized
hr: CREATE GROUP: opcija "%s" nije poznata

source: group id must be positive
hr: identifikator grupe(group id) mora biti pozitivan

source: CREATE GROUP: permission denied
hr: CREATE GROUP: pristup zabranjen

source: CREATE GROUP: group name "%s" is reserved
hr: CREATE GROUP: grupa sa imenom "%s" je rezervirana

source: CREATE GROUP: group name "%s" already exists
hr: CREATE GROUP: grupa sa imenom "%s" veæ postoji

source: CREATE GROUP: group sysid %d is already assigned
hr: CREATE GROUP: 'group sysid' %d je veæ dodijeljen

source: %s: group "%s" does not exist
hr: %s: group "%s" ne postoji

source: AlterGroup: unknown tag %s
hr: AlterGroup: nepoznata oznaka %s

source: %s: user "%s" is already in group "%s"
hr: %s: korisnik "%s" je veæ u grupi "%s"

source: ALTER GROUP: group "%s" does not have any members
hr: ALTER GROUP: grupa "%s" nema niti jednog èlana

source: ALTER GROUP: user "%s" is not in group "%s"
hr: ALTER GROUP: korisnik "%s" nije u grupi "%s"

source: DROP GROUP: permission denied
hr: DROP GROUP: zabranjen pristup

source: DROP GROUP: group "%s" does not exist
hr: DROP GROUP: grupa "%s" ne postoji

source: oldest Xmin is far in the past --- close open transactions soon to avoid wraparound problems
hr: najstariji Xmin je iz daleke pro¹losti --- zatvoriti transakciju ubrzo kako bi izbjegli 'wraparound' probleme

source: pg_class entry for relid %u vanished during vacuuming
hr: pg_class zapis za relid %u je izgubljen tijekom 'vacuum' procesa

source: Some databases have not been vacuumed in over 2 billion transactions. You may have already suffered transaction-wraparound data loss.
hr: Neke baze podataka nisu vakumirane(vacuumed) prije vi¹e od 2 biliona transakcija. Mo¾da ste veæ izgubili neke podatke unutar transakcija.

source: Some databases have not been vacuumed in over 1 billion transactions. Better vacuum them soon, or you may have a wraparound failure.
hr: Neke baze podataka nisu nisu vakumirane(vacuumed) prije vi¹e od 2 biliona transakcija. Bolje ih je vakumirati uskoro ili bi mogli imati 'wraparound' neispravnosti.

source: Some databases have not been vacuumed in %d transactions. Better vacuum them within %d transactions, or you may have a wraparound failure.
hr: Neke baze podataka nisu vakumirane(vacuumed) u %d transakcijama. Bolje ih je vakumirati unutar %d transakcija, ili bi mogli imati 'wraparound' neispravnosti.

source: Skipping "%s" --- only table or database owner can VACUUM it
hr: Preskaèem "%s" --- samo vlasnik tabele ili baze podataka mo¾e izvr¹iti 'VACUUM' nad ovim

source: VACUUM (full_vacuum_rel): FlushRelationBuffers returned %d
hr: VACUUM (full_vacuum_rel): FlushRelationBuffers je vratio %d

source: Rel %s: Uninitialized page %u - fixing
hr: Rel %s: Neinicijalizirana stranica %u - popravljam

source: Rel %s: TID %u/%u: InsertTransactionInProgress %u - can't shrink relation
hr: Rel %s: TID %u/%u: InsertTransactionInProgress %u - nemoguæe smanjivanje relacije

source: Rel %s: TID %u/%u: DeleteTransactionInProgress %u - can't shrink relation
hr: Rel %s: TID %u/%u: DeleteTransactionInProgress %u - nemoguæe smanjivanje relacije

source: HEAP_MOVED_IN was not expected
hr: HEAP_MOVED_IN nije oèekivano

source: HEAP_MOVED_OFF was expected
hr: HEAP_MOVED_OFF je oèekivano

source: Parent item in update-chain not found - can't continue repair_frag
hr: Roditeljska stavka u lancu a¾uriranja(update-chain) nije naðena - nemoguæe nastaviti 'repair_frag'

source: Child itemid in update-chain marked as unused - can't continue repair_frag
hr: 'itemid' potomka u lancu a¾uriranja(update-chain) oznaèen kao neiskori¹ten - nemoguæe nastaviti 'repair_frag'

source: Parent itemid marked as unused
hr: Roditeljski 'itemid' oznaèen kao neiskori¹ten

source: Too old parent tuple found - can't continue repair_frag
hr: Prestar roditeljski slog naðen - nemoguæe nastaviti 'repair_frag'

source: failed to add item with len = %lu to page %u (free space %lu, nusd %u, noff %u)
hr: neuspjelo dodavanje stavke du¾ine = %lu stranici %u (free space %lu, nusd %u, noff %u)

source: HEAP_MOVED_IN was not expected (2)
hr: HEAP_MOVED_IN nije oèekivan (2)

source: Invalid XVAC in tuple header (4)
hr: Pogre¹an XVAC u zaglavlju sloga(tuple)

source: HEAP_MOVED_OFF was expected (2)
hr: HEAP_MOVED_OFF je oèekivan (2)

source: HEAP_MOVED_OFF/HEAP_MOVED_IN was expected
hr: HEAP_MOVED_OFF/HEAP_MOVED_IN je oèekivan

source: Invalid XVAC in tuple header (2)
hr: Pogre¹an XVAC u zaglavlju sloga(tuple)(2)

source: Rel %s: Pages: %u --> %u; Tuple(s) moved: %u. %s
hr: Relacija %s: Stranica: %u --> %u; slog(ova) premje¹teno: %u. %s

source: Invalid XVAC in tuple header (3)
hr: Pogre¹an XVAC u zaglavlju sloga(tuple)(3)

source: HEAP_MOVED_OFF was expected (3)
hr: HEAP_MOVED_OFF je oèekivan (2)

source: VACUUM (repair_frag): FlushRelationBuffers returned %d
hr: VACUUM (repair_frag): FlushRelationBuffers je vratio %d

source: VACUUM (vacuum_heap): FlushRelationBuffers returned %d
hr: VACUUM (vacuum_heap): FlushRelationBuffers je vratio %d

source: Index %s: NUMBER OF INDEX' TUPLES (%.0f) IS NOT THE SAME AS HEAP' (%.0f). Recreate the index.
hr: Index %s: NUMBER OF INDEX' TUPLES (%.0f) IS NOT THE SAME AS HEAP' (%.0f). Ponovno kreirajte indeks.

source: Removed %d tuples in %d pages. %s
hr: Obrisano %d zapisa u %d stranica. %s

source: VACUUM (lazy_truncate_heap): FlushRelationBuffers returned %d
hr: VACUUM (lazy_truncate_heap): FlushRelationBuffers je vratio %d

source: Truncated %u --> %u pages. %s
hr: Obrisano %u --> %u stranica. %s

source: SET DATESTYLE: invalid list syntax
hr: SET DATESTYLE: pogre¹na sintaksa liste

source: SET DATESTYLE: unrecognized keyword %s
hr: SET DATESTYLE: nepoznata kljuèna rijeæ %s

source: SET DATESTYLE: conflicting specifications
hr: SET DATESTYLE: specifikacije u konfliktu

source: SET TIME ZONE: illegal INTERVAL; month not allowed
hr: SET TIME ZONE: pogre¹an INTERVAL; mjesec nije dozvoljen

source: Unable to clear TZ environment variable
hr: Neuspjelo brisanje TZ varijable okru¾enja(environment variable)

source: SET TRANSACTION ISOLATION LEVEL must be called before any query
hr: SET TRANSACTION ISOLATION LEVEL mora biti pozvan prije ijednog upita(query)

source: Conversion between %s and %s is not supported
hr: Konverzija izmeðu %s i %s nije podr¾ana

source: SET SERVER_ENCODING is not supported
hr: SET SERVER_ENCODING nije podr¾an

source: attempted to define virtual relation with no attrs
hr: poku¹aj definiranja virtualnie relacije bez atributa

source: %s is not a view
hr: %s nije 'view'

source: Cannot change number of columns in view
hr: Nemoguæe mijenjanje broja kolona u 'view'-u

source: Cannot change name of view column "%s"
hr: Nemoguæe mijenjanje imena kolone "%s" u 'view'-u

source: Cannot change datatype of view column "%s"
hr: Nemoguæe mijenjanje tipa podataka za kolonu "%s" u 'view'-u

source: ExecReScan: node type %d not supported
hr: ExecReScan: tip noda %d nije podr¾an

source: ExecMarkPos: node type %d not supported
hr: ExecMarkPos: tip noda %d nije podr¾an

source: ExecRestrPos: node type %d not supported
hr: ExecRestrPos: tip noda %d nije podr¾an

source: ExecCheckRTEPerms: bogus operation %d
hr: ExecCheckRTEPerms: neispravna operacija %d

source: You can't change sequence relation %s
hr: Ne mo¾ete promijeniti sekvencu relacije %s

source: You can't change toast relation %s
hr: Ne mo¾ete promijeniti 'toast' relaciju %s

source: You can't change view relation %s
hr: Ne mo¾ete promijeniti 'view' relaciju %s

source: ExecutePlan: NO (junk) `ctid' was found!
hr: ExecutePlan: NO (junk) `ctid' je naðen!

source: ExecutePlan: (junk) `ctid' is NULL!
hr: ExecutePlan: (junk) `ctid' je NULL!

source: ExecutePlan: NO (junk) `%s' was found!
hr: ExecutePlan: NO (junk) `%s' nije naðen!

source: ExecutePlan: (junk) `%s' is NULL!
hr: ExecutePlan: (junk) `%s' je NULL!

source: ExecutePlan: unknown operation in queryDesc
hr: ExecutePlan: nepoznata operacija u 'queryDesc'

source: ExecUpdate: UPDATE can't run without transactions
hr: ExecUpdate: UPDATE ne mo¾e biti izvr¹en bez transakcije

source: %s: Fail to add null value in not null attribute %s
hr: %s: Neuspjelo dodavanje 'null' vrijednosti u atribut %s koji ne prihvaèa 'null'

source: %s: rejected due to CHECK constraint "%s" on "%s"
hr: %s: nije prihvaæeno zbog 'CHECK constraint'-a "%s" na "%s"

source: EvalPlanQual: can't find RTE %d
hr: EvalPlanQual: nije naðen RTE %d

source: EvalPlanQual: t_xmin is uncommitted ?!
hr: EvalPlanQual: t_xmin nije 'committed' ?!

source: ExecInitNode: node type %d unsupported
hr: ExecInitNode: tip noda %d nije podr¾an

source: ExecProcNode: node type %d unsupported
hr: ExecProcNode: tip nodae %d nije podr¾an

source: ExecCountSlotsNode: node type %d unsupported
hr: ExecCountSlotsNode: tip noda %d nije podr¾an

source: ExecEndNode: node type %d unsupported
hr: ExecEndNode: tip noda %d nije podr¾an

source: ExecGetTupType: node type %d unsupported
hr: ExecGetTupType: tip noda %d nije podr¾am

source: ExecEvalArrayRef: can only handle %d dimensions
hr: ExecEvalArrayRef: mo¾e obraditi samo %d dimenzija

source: ExecEvalArrayRef: upper and lower indices mismatch
hr: ExecEvalArrayRef: zabuna u gornjem i donjem pokazatelju

source: ExecEvalAggref: no aggregates in this expression context
hr: ExecEvalAggref: nema agregata u ovom kontekst izraza

source: ExecEvalParam: new/old params with same id & diff names
hr: ExecEvalParam: new/old parametri sa istim identifikatorom i razlièitim imenima

source: ExecEvalParam: invalid paramkind %d
hr: ExecEvalParam: pogre¹an tip parametra %d

source: ExecEvalParam: Unknown value for parameter %s
hr: ExecEvalParam: nepoznata vrijednost za parametar %s

source: GetAttributeByNum: Invalid attribute number
hr: GetAttributeByNum: pogre¹an broj atributa

source: GetAttributeByNum: cannot access system attributes here
hr: GetAttributeByNum: nemoguæ pristup sistemskim atributima odavde

source: GetAttributeByNum: a NULL isNull flag was passed
hr: GetAttributeByNum: NULL isNull zastavica prosljeðena

source: GetAttributeByName: Invalid attribute name
hr: GetAttributeByName: Pogre¹an naziv atributa

source: GetAttributeByName: a NULL isNull flag was passed
hr: GetAttributeByName: NULL isNull zastavica prosljeðena

source: GetAttributeByName: attribute %s not found
hr: GetAttributeByName: atribut %s nije naðen

source: Functions and operators can take only one set argument
hr: Funkcije i operatori mogu primiti samo jedan set paramatara

source: Set-valued function called in context that cannot accept a set
hr: 'Set-valued' funkcija pozvana u kontekstu koji ne prihvaæa set

source: ExecMakeTableFunctionResult: unknown returnMode %d
hr: ExecMakeTableFunctionResult: nepoznat 'returnMode' %d

source: ExecEvalNullTest: unexpected nulltesttype %d
hr: ExecEvalNullTest: neoèekivan nulltesttype %d

source: ExecEvalBooleanTest: unexpected booltesttype %d
hr: ExecEvalBooleanTest: neoèekivan booltesttype %d

source: Domain %s does not allow NULL values
hr: Domain '%s' ne dozvoljava NULL vrijednsoti

source: Domain CHECK Constraints not yet implemented
hr: Domain CHECK Constraint nije jo¹ implementiran

source: ExecEvalConstraintTest: Constraint type unknown
hr: ExecEvalConstraintTest: Nepoznat tip 'constraint'-a

source: ExecEvalExpr: unknown expression type %d
hr: ExecEvalExpr: nepoznat tip izraza %d

source: ExecTargetList: fjoin nodes not currently supported
hr: ExecTargetList: 'fjoin nodes' nisu trenutno podr¾ani

source: Plan requires more slots than are available send mail to your local executor guru to fix this
hr: Plan zahtjeva vi¹e slotova nego ¹to je na raspolaganju Po¹aljite mail va¹em lokalnom guru-u da ovo popravi

source: init_sql_fcache: Cache lookup failed for procedure %u
hr: init_sql_fcache: tra¾enje procedure %u u cache-u nije uspjelo.

source: init_sql_fcache: Cache lookup failed for type %u
hr: init_sql_fcache: tra¾enje tipa %u u cache-u nije uspjelo.

source: init_sql_fcache: null prosrc for procedure %u
hr: init_sql_fcache: 'null prosrc' za proceduru %u

source: InstrStartTimer called twice in a row
hr: InstrStartTimer pozvan dva puta u retku

source: InstrStopNode without start
hr: InstrStopNode bez starta

source: ExecInitAgg: could not find any aggregate functions
hr: ExecInitAgg: nemoguæe pronaæi niti jednu agregatnu funkciju

source: ExecAgg: cache lookup failed for aggregate %u
hr: ExecAgg: tra¾enje agregata %u u cache-u nije uspjelo.

source: Aggregate %u needs to have compatible input type and transition type
hr: Agregat %u treba imati kompatibilni input tip i prelazni tip

source: Unable to identify an equality operator for type %s
hr: Nemoguæe identificirati operator jednakosti za tip %s

source: GetAggInitVal: cache lookup failed on aggregate transition function return type %u
hr: GetAggInitVal: nije uspjelo tra¾enje povratnog tipa %u agregatne tranzicijske funkcije

source: Aggregate function %u called as normal function
hr: Agregatna funkcija %u pozvana kao normalna funkcija

source: ExecProcAppend: subnode is NULL
hr: ExecProcAppend: subnode je NULL

source: Query-specified return tuple and actual function return tuple do not match
hr: Povratni slog(tuple)-e specificiran od strane upita(query) i stvarni slog(tuple) koji vraæa funkcija ne odgovaraju

source: ExecHash: hash table is NULL.
hr: ExecHash: 'hash table' je NULL.

source: Insufficient memory for hash table.
hr: Nedovoljno memorije za 'hash table'.

source: hashFunc: Invalid typLen %d
hr: hashFunc: Pogre¹an 'typLen' %d

source: ExecInitHashJoin: unsupported join type %d
hr: ExecInitHashJoin: nepodr¾ani 'join' tip %d

source: Read from hashjoin temp file failed
hr: Èitanje iz 'hashjoin' privremene datoteke nije uspjelo

source: Failed to rewind hash temp file
hr: Neuspjelo premotavanje 'hash' privremene datoteke

source: Write to hashjoin temp file failed
hr: Pisanje u 'hashjoin' privremenu datoteku nije uspjelo

source: ExecInitIndexScan: indxqual not an opclause!
hr: ExecInitIndexScan: 'indxqual' nije 'opclause'!

source: indexes of the relation %u was inactivated
hr: indeks relacije %u je bio iskljuèen

source: MJFormSkipQuals: op not an Oper!
hr: MJFormSkipQuals: op nije operator!

source: ExecMergeJoin: unsupported join type %d
hr: ExecMergeJoin: nepodr¾an join tip %d

source: ExecMergeJoin: invalid join state %d, aborting
hr: ExecMergeJoin: pogre¹no stanje 'join'-a %d, odustajem

source: RIGHT JOIN is only supported with mergejoinable join conditions
hr: RIGHT JOIN je podr¾an samo sa spojivim 'join' uvjetima

source: FULL JOIN is only supported with mergejoinable join conditions
hr: FULL JOIN je podr¾an samo sa spojivim 'join' uvjetima

source: ExecInitMergeJoin: unsupported join type %d
hr: ExecInitMergeJoin: nepodr¾an 'join' tip %d

source: ExecInitNestLoop: unsupported join type %d
hr: ExecInitNestLoop: nepodr¾an 'join' tip %d

source: ExecSetOp: bogus command code %d
hr: ExecSetOp: neispravan kod komande %d

source: ExecSubPlan: can't set parent params from subquery
hr: ExecSubPlan: nemoguæe setiranje roditeljskih parametara iz 'subquery' izraza

source: More than one tuple returned by a subselect used as an expression.
hr: Vi¹e nego jedan slog je vraæen od strane kori¹tenog 'subselect' izraza.

source: ExecSubPlan: failed to find placeholder for subplan result
hr: ExecSubPlan: neuspjelo tra¾enje nosioca for 'subplan result'

source: ExecSetParamPlan: ANY/ALL subselect unsupported
hr: ExecSetParamPlan: ANY/ALL 'subselect' nije podr¾an

source: ExecReScanSetParamPlan: direct correlated subquery unsupported, yet
hr: ExecReScanSetParamPlan: direktan korelacijski 'subquery' nije jo¹ podr¾an.

source: ExecReScanSetParamPlan: setParam list is NULL
hr: ExecReScanSetParamPlan: 'setParam' lista je NULL

source: ExecReScanSetParamPlan: extParam list of plan is NULL
hr: ExecReScanSetParamPlan: 'extParam' lista plana je NULL

source: Memory exhausted in DLNewList
hr: Memorija iscrpljena u 'DLNewList'

source: Memory exhausted in DLNewElem
hr: Memorija iscrpljena u 'DLNewElem'

source: %s authentication failed for user "%s"
hr: %s autorizacija nije uspjela za korisnika "%s"

source: Missing or erroneous pg_hba.conf file, see postmaster log for details
hr: Nepostojeæa ili neispravna pg_hba.conf datoteka, vidi 'postmaster log' za detalje

source: No pg_hba.conf entry for host %s, user %s, database %s
hr: Nepostojeæa pg_hba.conf stavka za 'host' %s, korisnik %s, baza podataka %s

source: pg_local_sendauth: can't do setsockopt: %m
hr: pg_local_sendauth: nemoguæe izvr¹iti 'setsockopt': %m

source: cannot open large object %u
hr: nemoguæe otvaranje 'large object'-a %u

source: lo_close: invalid large obj descriptor (%d)
hr: lo_close: pogre¹an 'large obj descriptor' (%d)

source: lo_read: invalid large obj descriptor (%d)
hr: lo_read: pogre¹an 'large obj descriptor' (%d)

source: lo_write: invalid large obj descriptor (%d)
hr: lo_write: pogre¹an 'large obj descriptor' (%d)

source: lo_lseek: invalid large obj descriptor (%d)
hr: lo_lseek: pogre¹an 'large obj descriptor' (%d)

source: lo_tell: invalid large object descriptor (%d)
hr: lo_tell: pogre¹an 'large obj descriptor' (%d)

source: You must have Postgres superuser privilege to use server-side lo_import(). Anyone can use the client-side lo_import() provided by libpq.
hr: Morate imati 'Postgres superuser' privilegije da biste koristil serverski 'lo_import()'. Svaki korisnik mo¾e koristiti 'client-side lo_import()' omoguæen u libpq biblioteci.

source: lo_import: can't open unix file "%s": %m
hr: lo_import: nemoguæe otvaranje unix datoteke "%s": %m

source: lo_import: can't create inv object for "%s"
hr: lo_import: nemoguæe kreiranje 'inv object'-a za "%s"

source: lo_import: error while reading "%s"
hr: lo_import: gre¹ka kod èitanja "%s"
