Repository: postgres/postgres
Catalog: src/backend/po/*.po
Languages: hr

source: Cache lookup failed for procedure %u
hr: Tra¾enje procedure %u u cache-u nije uspjelo

source: Cache lookup failed for operator %u
hr: Tra¾enje operatora %u u cache-u nije uspjelo

source: Cache lookup failed for opclass %u
hr: Tra¾enje 'opclass' %u u cache-u nije uspjelo

source: Improper qualified name (too many dotted names): %s
hr: Neispravno ime (previ¹e imena sa toèkom - 'dotted names'): %s

source: Improper relation name (too many dotted names)
hr: Neispravno ime relacije (previ¹e imena sa toèkom - 'dotted names')

source: recomputeNamespacePath: invalid list syntax
hr: recomputeNamespacePath: pogre¹na sintaksa liste

source: %s: not authorized to create temp tables
hr: %s: nije autoriziran za kreiranje privremenih tablela(temp tables)

source: no aggregate name supplied
hr: agregatno ime nije dostavljeno

source: aggregate must have a transition function
hr: agregacija mora imati tranzicijsku funkciju

source: return type of transition function %s is not %s
hr: povratni tip tranzicijske funkcije %s nije %s

source: RemoveConstraintById: constraint %u not found
hr: RemoveConstraintById: constraint %u nije naðen

source: RemoveConstraintById: relation %s has relchecks = 0
hr: RemoveConstraintById: relacija %s ima 'relchecks' = 0

source: no conversion name supplied
hr: ime konverzije ime nije dostavljeno

source: conversion name "%s" already exists
hr: ime konverzije "%s" veæ postoji

source: default conversion for %s to %s already exists
hr: inicijalna konverzija za %s u %s veæ postoji

source: Conversion %u search from syscache failed
hr: Neuspjelo tra¾enje konverzije %u u 'syscache'-u

source: conversion %u does not exist
hr: konverzija %u ne postoji

source: conversion %s not found
hr: konverzija %s nije naðena

source: LargeObjectDrop: large object %u not found
hr: LargeObjectDrop: 'large object' %u nije naðen

source: no namespace name supplied
hr: namespace nije dostavljen

source: namespace "%s" already exists
hr: namespace sa imenom "%s" veæ postoji

source: "%s" is not a valid operator name
hr: "%s" nije ispravno ime operatora

source: at least one of leftarg or rightarg must be specified
hr: barem jedan lijevi ili desni argument mora biti specificiran

source: only binary operators can have commutators
hr: samo binarni operatori mogu imati komutator

source: only binary operators can have join selectivity
hr: samo binarni operatori mogu imati 'join selectivity'

source: only binary operators can hash
hr: samo binarni operatori mogu imati 'hash'

source: only binary operators can mergejoin
hr: samo binarni operatori mogu imati 'mergejoin'

source: OperatorDef: operator "%s" already defined
hr: OperatorDef: operator "%s" je veæ definirana

source: OperatorDef: operator %u not found
hr: OperatorDef: operator %u nije naðen

source: operator cannot be its own negator or sort operator
hr: operator ne mo¾e biti vlastiti negator ili sort operator

source: OperatorDef: can't create operator shell "%s"
hr: OperatorDef: nemoguæe kreiranje operatorskog shell-a "%s"

source: functions cannot have more than %d arguments
hr: funkcija nemogu imati vi¹e od %d parametara

source: method %s already an attribute of type %s
hr: metoda %s je veæ atribut tipa %s

source: function %s already exists with same argument types
hr: funkcija %s veæ postoji sa istim tipovima argumenata

source: ProcedureCreate: you do not have permission to replace function %s
hr: ProcedureCreate: nemate prava nad bazom da biste mogli zamijeniti funkciju %s

source: ProcedureCreate: cannot change return type of existing function. Use DROP FUNCTION first.
hr: ProcedureCreate: nemoguæe promijeniti povratni tip postojeæe funkcije. Upotrijebite 'DROP FUNCTION'.

source: function %s is an aggregate
hr: funkcija %s je agregatna(aggregate)

source: function %s is not an aggregate
hr: funkcija %s nije agregatna(aggregate)

source: function declared to return %s, but no SELECT provided
hr: funkcija je deklarirana sa povratnim tipom %s, ali SELECT nije definiran

source: function declared to return void, but final statement is a SELECT
hr: funkcija deklarirana bez povratnog tipa(void), ali finalni izraz je 'SELECT'

source: function declared to return %s, but final statement is not a SELECT
hr: funkcija deklarirana sa povratnim tipom %s, ali finalni izraz nije 'SELECT'

source: function declared to return %s returns multiple columns in final SELECT
hr: funkcija deklarirana sa povratnim tipom %s vraæa vi¹e od jedne kolone u finalnom 'SELECT' izrazu.

source: return type mismatch in function: declared to return %s, returns %s
hr: gre¹ka u povratnom tipu funkcije: deklarirana sa povratnim tipom %s, vraæa povratni tip %s

source: function declared to return %s does not SELECT the right number of columns (%d)
hr: funkcija deklarirana sa povratnim tipom %s ne vraæa u SELECT izrazu ispravan broj kolona (%d)

source: function declared to return %s returns %s instead of %s at column %d
hr: funkcija deklarirana sa povratnim tipom %s vraæa tip %s umjesto %s u koloni %d

source: cache lookup of function %u failed
hr: nije uspjelo tra¾enje funkcije %u u 'cache'-u

source: there is no built-in function named "%s"
hr: 'built-in' funkcija imenom "%s" ne postoji

source: SQL functions cannot return type %s
hr: SQL funkcije ne mogu vratiti tip %s

source: SQL functions cannot have arguments of type %s
hr: SQL funkcije ne mogu imati parametre tipa %s

source: TypeCreate: invalid type internal size %d
hr: TypeCreate: pogre¹na interna velièina tipa %d

source: TypeCreate: fixed size types must have storage PLAIN
hr: TypeCreate: tipovi sa finsnim velièinama moraju imati 'storage PLAIN'

source: type %s already exists
hr: tipe %s veæ postoji

source: type %s does not exist
hr: tip %s ne postoji

source: type named %s already exists
hr: tip sa imenom %s veæ postoji

source: DefineAggregate: attribute "%s" not recognized
hr: DefineAggregate: atribut "%s" nije poznat

source: Define: "basetype" unspecified
hr: Define: "basetype" nije specificiran

source: Define: "stype" unspecified
hr: Define: "stype" nije specificiran

source: Define: "sfunc" unspecified
hr: Define: "sfunc" nije specificiran

source: Aggregate transition datatype cannot be %s
hr: Agregatni prezalni tip podataka ne mo¾e bit %s

source: RemoveAggregate: couldn't find pg_proc tuple for %s
hr: RemoveAggregate: 'pg_proc tuple' za %s nije naðen

source: Skipping "%s" --- only table or database owner can ANALYZE it
hr: Preskaèem "%s" --- samo vlasnik tabele ili baze mo¾e analizirati (ANALYZE).

source: Skipping "%s" --- can not process indexes, views or special system tables
hr: %s: nemoguæe procesiranje 'index'-a, 'view'-a ili specijalnih sistemskih tablica

source: Analyzing %s.%s
hr: Analizira se %s.%s

source: cache lookup of type %u failed
hr: nije uspjelo tra¾enje tipa %u u cache-u

source: acquire_sample_rows: ReadBuffer(%s,%u) failed
hr: acquire_sample_rows: ReadBuffer(%s,%u) nije uspio

source: Async_Listen: We are already listening on %s
hr: Async_Listen: Veæ slu¹amo na %s

source: AtCommit_Notify: notifying self
hr: AtCommit_Notify: obavje¹tavamo sebe

source: AtCommit_Notify: notifying pid %d
hr: AtCommit_Notify: obavje¹tavanje pid-a %d

source: AtCommit_Notify: done
hr: AtCommit_Notify: gotovo

source: Async_NotifyHandler: perform async notify
hr: Async_NotifyHandler: izvr¹i asinkronu obavjest

source: Async_NotifyHandler: done
hr: Async_NotifyHandler: gotovo

source: EnableNotifyInterrupt: perform async notify
hr: EnableNotifyInterrupt: izvr¹i asinkronu obavjest

source: EnableNotifyInterrupt: done
hr: EnableNotifyInterrupt: gotovo

source: ProcessIncomingNotify: received %s from %d
hr: ProcessIncomingNotify: primljen %s od %d

source: ProcessIncomingNotify: done
hr: ProcessIncomingNotify: gotovo

source: NOTIFY for %s
hr: NOTIFY za %s

source: CLUSTER: cannot find index "%s" for table "%s"
hr: CLUSTER: indeks "%s" za tabelu "%s" nije naðen

source: CLUSTER: "%s" is not an index for table "%s"
hr: CLUSTER: "%s" nije index za tabelu "%s"

source: CLUSTER: cannot cluster system relation "%s"
hr: CLUSTER: nemoguæe klasteriranje sistemske relacije "%s"

source: Cache lookup failed for index %u
hr: Nije uspjelo pretra¾ivanje cache-a za index %u

source: cache lookup failed for index %u
hr: nije uspjelo pretra¾ivanje cache-a za index %u

source: CLUSTER: Cannot find tuple for relation %u
hr: CLUSTER: slog(tuple) za relaciju %u nije naðen

source: CLUSTER: FlushRelationBuffers returned %d
hr: CLUSTER: FlushRelationBuffers vratio %d

source: CLUSTER: expected both swapped tables to have TOAST tables
hr: CLUSTER: oèekivano da obje 'swapped' tabele imaju TOAST tabele

source: CLUSTER: expected one dependency record for TOAST table, found %ld
hr: CLUSTER: oèekivan jedan slog zavisnosti za TOAST tabelu, naðeno %ld

source: An attempt was made to comment on a unknown type: %d
hr: Poku¹aj komentiranja nepoznatog tipa: %d

source: relation "%s" is not an index
hr: relacija "%s" nije 'index'

source: relation "%s" is not a sequence
hr: relacija "%s" nije 'sequence'

source: relation "%s" is not a table
hr: relacija "%s" nije tablica(table)

source: relation "%s" is not a view
hr: relacija "%s" nije 'view'

source: CommentAttribute: must specify relation.attribute
hr: CommentAttribute: mora biti specificirano relacija.atribut

source: Relation "%s" has no column "%s"
hr: Relacija "%s" nema kolone "%s"

source: CommentDatabase: database name may not be qualified
hr: CommentDatabase: ima baze podataka mo¾da nije zadano

source: database "%s" does not exist
hr: baza podataka "%s" ne postoji

source: you are not permitted to comment on database "%s"
hr: Nemate prava za komentiranje na bazi podataka "%s"

source: Database comments may only be applied to the current database
hr: Komentari mogu biti zadani samo za teluæu bazu podataka

source: CommentSchema: schema name may not be qualified
hr: CommentSchema: ime ¹eme(schema name) mo¾da nije zadano

source: CommentSchema: Schema "%s" could not be found
hr: CommentSchema: ©ema "%s" nije naðena

source: rule "%s" does not exist
hr: rule "%s" ne postoji

source: There are multiple rules "%s" Please specify a relation name as well as a rule name
hr: Postoje vi¹estruka pravila(rules) "%s" Specificirajte ime relacije kao i ime pravila(rule name)

source: CommentTrigger: must specify relation and trigger
hr: CommentTrigger: specificirajte relaciju(relation) i 'trigger'

source: trigger "%s" for relation "%s" does not exist
hr: 'trigger' "%s" definiran za relaciju "%s" ne postoji

source: CommentConstraint: must specify relation and constraint
hr: CommentConstraint: specificirajte relaciju(relation) i 'constraint'

source: Relation "%s" has multiple constraints named "%s"
hr: Relacija "%s" ima vi¹estruki 'constraint' pod imenom "%s"

source: constraint "%s" for relation "%s" does not exist
hr: constraint "%s" za relaciju "%s" ne postoji

source: Invalid for encoding name: %s
hr: Pogre¹no ime za 'encoding': %s

source: Invalid to encoding name: %s
hr: Pogre¹no za ime 'encoding'-a: %s

source: COPY: BINARY option appears more than once
hr: COPY: BINARY opcija pojavljuje se vi¹e puta

source: COPY: OIDS option appears more than once
hr: COPY: OIDS opcija pojavljuje se vi¹e puta

source: COPY: DELIMITER string may only be defined once in query
hr: COPY: DELIMITER string mo¾e biti definiran samo jednom u upitu(query)

source: COPY: NULL representation may only be defined once in query
hr: COPY: 'NULL representation' mo¾e biti definiran samo jednom u upitu(query)

source: COPY: option "%s" not recognized
hr: COPY: opcija "%s" nije poznata

source: You can not specify the DELIMITER in BINARY mode.
hr: Ne mo¾ete specificirati DELIMITER u BINARY modu.

source: You can not specify NULL in BINARY mode.
hr: Ne mo¾ete specificirati NULL u BINARY modu.

source: You must have Postgres superuser privilege to do a COPY directly to or from a file. Anyone can COPY to stdout or from stdin. Psql's \copy command also works for anyone.
hr: Morate imati Postgres 'superuser' privilegije da biste kopirali(COPY) direktno u datoteku ili iz datoteke. Svaki korisnik mo¾e kopirati na 'stdout' ili iz 'stdin'.Psql \copy komanda takoðe je dostupna za svakog korisnika.

source: COPY BINARY is not supported to stdout or from stdin
hr: COPY BINARY nije podr¾an za 'stdout' ili 'stdin'

source: COPY delimiter must be a single character
hr: 'COPY delimiter' mora biti jedan znak

source: COPY: table "%s" does not have OIDs
hr: COPY: tablica "%s" nema OID-e

source: You cannot copy view %s
hr: Nemoguæe kopiranje view-a %s

source: You cannot change sequence relation %s
hr: Nemoguæe izmijeniti relaciju sequence %s

source: You cannot copy object %s
hr: Nemoguæe kopirati objekt %s

source: COPY command, running in backend with effective uid %d, could not open file '%s' for reading. Errno = %s (%d).
hr: COPY komanda pokrenuta na serveru s efektivním uid %d, ne mo¾e otvoriti datoteku '%s' za èitanje. Errno = %s (%d).

source: COPY: %s is a directory
hr: COPY: %s je direktorij

source: You cannot copy sequence %s
hr: Nemoguæe kopiranje sekvence(sequence) %s

source: Relative path not allowed for server side COPY command
hr: Relativna staza nije dopu¹tena u serverskoj varijanti COPY komande

source: COPY command, running in backend with effective uid %d, could not open file '%s' for writing. Errno = %s (%d).
hr: COPY komanda pokrenuta na serveru s efektivním uid %d, ne mo¾e otvoriti datoteku'%s' za pisanje. Errno = %s (%d).

source: COPY: couldn't lookup info for type %u
hr: COPY: nemoguæe pronaæi informaciju o tipu %u

source: COPY BINARY: cstring not supported
hr: COPY BINARY: cstring nije podr¾an

source: COPY BINARY: file signature not recognized
hr: COPY BINARY: potpis datoteke nije prepoznat

source: COPY BINARY: incompatible integer layout
hr: COPY BINARY: nekompatibilni 'integer' oblik

source: COPY BINARY: bogus file header (missing flags)
hr: COPY BINARY: pogre¹no zaglavlje datoteke (nedostaju zastavice)

source: COPY BINARY: unrecognized critical flags in header
hr: COPY BINARY: nepoznate kritiène zastavice u zaglavlju

source: COPY BINARY: bogus file header (missing length)
hr: COPY BINARY: pogre¹no zaglavlje datoteke (nedostaje du¾ina)

source: COPY BINARY: bogus file header (wrong length)
hr: COPY BINARY: pogre¹no zaglavlje datoteke (pogre¹na duljina)

source: Invalid Oid
hr: Pogre¹an Oid

source: Missing data for column "%s"
hr: Ne postije podaci za kolonu "%s"

source: COPY BINARY: tuple field count is %d, expected %d
hr: COPY BINARY: broj polja u æeliji je %d, oèekivano je %d

source: COPY BINARY: unexpected EOF
hr: COPY BINARY: neoèekivani EOF

source: COPY BINARY: sizeof(Oid) is %d, expected %d
hr: COPY BINARY: sizeof(Oid) je %d, oèekivano je %d

source: COPY BINARY: Invalid Oid
hr: COPY BINARY: pogre¹an Oid

source: COPY BINARY: sizeof(field %d) is %d, expected %d
hr: COPY BINARY: sizeof(polo¾ka %d) je %d, oèekivano je %d

source: COPY BINARY: bogus varlena length
hr: COPY BINARY: pogre¹na du¾ina 'varlena'

source: GetInputFunction: Cache lookup of type %u failed
hr: GetInputFunction: nije uspjelo tra¾enje tipa %u u cache-u

source: GetTypeElement: Cache lookup of type %u failed
hr: GetTypeElement: nije uspjelo tra¾enje tipa %u u cache-u

source: CopyReadAttribute: end of record marker corrupted
hr: CopyReadAttribute: 'end of record' oznaka koruptirana

source: Attribute "%s" specified more than once
hr: Atribut "%s" specificiran vi¹e puta

source: CREATE DATABASE: conflicting options
hr: CREATE DATABASE: opcije u konfliktu

source: CREATE DATABASE: option "%s" not recognized
hr: CREATE DATABASE: opcija "%s" nije poznata

source: %d is not a valid encoding code
hr: %d nije ispravan 'encoding' kod

source: %s is not a valid encoding name
hr: %s nije validno 'encoding' ime

source: CREATE DATABASE: bogus encoding parameter
hr: CREATE DATABASE: pogre¹an 'encoding' parametar

source: CREATE DATABASE: permission denied
hr: CREATE DATABASE: zabranjen pristup

source: CREATE DATABASE: database "%s" already exists
hr: CREATE DATABASE: baza podataka "%s" veæ postoji

source: CREATE DATABASE: template "%s" does not exist
hr: CREATE DATABASE: uzorak (template) "%s" ne postoji

source: CREATE DATABASE: permission to copy "%s" denied
hr: CREATE DATABASE: nemate prava za 'copy' "%s"

source: CREATE DATABASE: source database "%s" is being accessed by other users
hr: CREATE DATABASE: izvornoj bazi podataka "%s" pristupaju drugi korisnici

source: CREATE DATABASE: invalid backend encoding
hr: CREATE DATABASE: pogre¹an 'backend encoding'

source: database path may not contain single quotes
hr: staza baze podataka ne mo¾e sadr¾avati jednostruke navodnike

source: CREATE DATABASE: unable to create database directory '%s': %m
hr: CREATE DATABASE: nemoguæe kreiranje staze baze podataka '%s': %m

source: CREATE DATABASE: unable to remove temp directory '%s': %m
hr: CREATE DATABASE: nemoguæe brisanje privremenog direktorija '%s': %m

source: CREATE DATABASE: could not link '%s' to '%s': %m
hr: CREATE DATABASE: nemoguæe povezati '%s' i '%s': %m

source: CREATE DATABASE: could not initialize database directory
hr: CREATE DATABASE: neuspijela inicijalizacija direktorija baze podataka

source: CREATE DATABASE: could not initialize database directory; delete failed as well
hr: CREATE DATABASE: neuspijela inicijalizacija direktorija baze podataka; brisanje takoðe nije uspjelo

source: DROP DATABASE: cannot be executed on the currently open database
hr: DROP DATABASE: ne mo¾e biti izvr¹en na trenutno otvorenoj bazi podataka

source: DROP DATABASE: database "%s" does not exist
hr: DROP DATABASE: baza podataka "%s" ne postoji

source: DROP DATABASE: permission denied
hr: DROP DATABASE: zabranjen pristup

source: DROP DATABASE: database is marked as a template
hr: DROP DATABASE: baza podataka je oznaèena kao uzorak(template)

source: DROP DATABASE: database "%s" is being accessed by other users
hr: DROP DATABASE: bazi podataka "%s" pristupaju drugi korisnici

source: DROP DATABASE: Database "%s" doesn't exist despite earlier reports to the contrary
hr: DROP DATABASE: baza podataka "%s" ne postoji unatoè prethodnom opreènom izvje¹taju

source: Relative paths are not allowed as database locations
hr: Relativne staze nisu dozvoljene kao oznaka lokacije baze podataka

source: Absolute paths are not allowed as database locations
hr: Apsolutne staze nisu dozvoljene kao oznaka lokacije baze podataka

source: Postmaster environment variable '%s' not set
hr: 'Postmaster' ambijentna varijabla '%s' nije postavljena

source: Postmaster environment variable '%s' must be absolute path
hr: 'Postmaster' ambijentna varijabla '%s' mora sadr¾avati apsolutnu stazu

source: Alternate path is too long
hr: Alternativna staza je predugaèka

source: could not remove '%s': %m
hr: nemoguæe brisanje '%s': %m

source: database directory '%s' could not be removed
hr: direktorij baze podataka '%s' ne mo¾e biti obrisan

source: database %u does not exist
hr: baza podataka %u ne postoji

source: Define: "%s" requires a parameter
hr: Define: "%s" zahtjeva parametar

source: Define: cannot interpret argument of "%s"
hr: Define: nemoguæe interpretiranje argumenta "%s"

source: Define: "%s" requires a numeric value
hr: Define: "%s" zahtjeva numerièku vrijednost

source: Define: argument of "%s" must be a name
hr: Define: argument "%s" mora biti ime

source: Define: argument of "%s" must be a type name
hr: Define: argument "%s" mora biti ime tipa

source: Define: "%s" requires an integral value
hr: Define: "%s" zahtjeva cijelobrojnu(integer) vrijednost

source: Define: invalid argument for "%s": "%s"
hr: Define: pogre¹an argument za "%s": "%s"

source: show_sort_keys: no tlist entry for key %d
hr: show_sort_keys: ne postoji 'tlist' zapis za kljuè %d

source: SQL function cannot return shell type "%s"
hr: SQL funkcije ne mogu vratiti tip "%s"

source: Return type "%s" is only a shell
hr: Povratni tip "%s" je samo ¹koljka(shell)

source: Type "%s" does not exist
hr: tip "%s" ne postoji

source: ProcedureCreate: type %s is not yet defined
hr: ProcedureCreate: typ %s nije definiran

source: could not create type %s
hr: nemoguæe kreiranje tipa %s

source: SQL function cannot accept shell type "%s"
hr: SQL funkcije ne mogu prihvatiti tip "%s"

source: Argument type "%s" is only a shell
hr: Tip argumenta "%s" je samo ¹koljka(shell)

source: Functions cannot accept set arguments
hr: Funkcije ne mogu prihvatiti set argumente

source: conflicting or redundant options
hr: konflikt redundantnih opcija

source: invalid CREATE FUNCTION option
hr: pogre¹na CREATE FUNCTION opcija

source: no function body specified
hr: tijelo funkcije nije specificirano

source: no language specified
hr: jezik nije specificiran

source: invalid volatility
hr: pogre¹na promijenjivost

source: Unrecognized function attribute '%s' ignored
hr: Nepoznati atribut funkcije '%s' je ignoriran

source: CREATE FUNCTION: only one AS item needed for %s language
hr: CREATE FUNCTION: samo jedna 'AS' klauzula potrebna za jezik %s

source: language "%s" does not exist
hr: jezik "%s" ne postoji

source: RemoveFunction: couldn't find tuple for function %s
hr: RemoveFunction: slog(tuple) za funkciju %s nije naðen

source: RemoveFunction: function '%s' is an aggregate Use DROP AGGREGATE to remove it
hr: RemoveFunction: funkcija '%s' je agregatna Upotrijebite DROP AGGREGATE da biste je obrisali

source: Removing built-in function "%s"
hr: brisanje ugraðene funkcije "%s"

source: RemoveFunctionById: couldn't find tuple for function %u
hr: RemoveFunctionById: slog(tuple) za funkciju %u nije naðen

source: RemoveFunctionById: couldn't find pg_aggregate tuple for %u
hr: RemoveFunctionById: 'pg_aggregate tuple' za funkciju %u nije naðen

source: SetFunctionReturnType: couldn't find tuple for function %u
hr: SetFunctionReturnType: slog(tuple) za funkciju %u nije naðen

source: SetFunctionReturnType: function %u doesn't return OPAQUE
hr: SetFunctionReturnType: funkcija %u ne vraæa tip OPAQUE

source: SetFunctionArgType: couldn't find tuple for function %u
hr: SetFunctionArgType: slog(tuple) za funkciju %u nije naðen

source: SetFunctionArgType: function %u doesn't take OPAQUE
hr: SetFunctionArgType: funkcija %u ne prima tip OPAQUE

source: source data type %s does not exist
hr: izvorni tip podataka %s ne postoji

source: target data type %s does not exist
hr: ciljni tip podataka %s ne postoji

source: source data type and target data type are the same
hr: izvorni i ciljni tip podataka su isti

source: source data type %s is only a shell
hr: izvorni tip podataka %s je samo ¹koljka(shell)

source: target data type %s is only a shell
hr: ciljni tip podataka %s je samo ¹koljka(shell)

source: source data type %s is a pseudo-type
hr: izvorni tip podataka %s pseudo tip

source: target data type %s is a pseudo-type
hr: ciljni tip podataka %s pseudo tip

source: must be owner of type %s or type %s
hr: mora biti vlasnik tipa %s ili tipa %s

source: cast function must take 1 argument
hr: funkcija za konverziju(cast function) mora primati 1 argument

source: argument of cast function must match source data type
hr: argument konverzije(cast) mora odgovarati izvornom tipu podatka

source: return data type of cast function must match target data type
hr: povratni tip konverzijske funkcije(cast function) mora odgovarati ciljnom tipu podataka

source: cast function must not be volatile
hr: konverzijska funkcija ne mo¾e biti nestalna(volatile)

source: cast function must not be an aggregate function
hr: konverzijska funkcija ne mo¾e biti agregatna

source: cast function must not return a set
hr: konverzijska funkcija ne mo¾e vratiti set

source: source and target datatypes are not physically compatible
hr: izvorna i ciljna baza podataka nisu fizièki kompatibilne

source: cast from data type %s to data type %s already exists
hr: konverzija iz tipa %s u tip %s veæ postoji
